{"name":"**_Oileán Dairbhre_**","nameHtml":"<p><strong><em>Oileán Dairbhre</em></strong></p>\n","safeName":"_Oileán-Dairbhre_","coordinates":{"irishGrid":{"sheet":"V","eastings":"370","northings":"730"},"fullIrishGrid":{"sheet":"","eastings":"37000","northings":"73000"},"tmcGrid":{"sheet":"","eastings":"436985.692","northings":"573062.047"},"geo":{"lat":"51.88586636","long":-10.36817235}},"cursor":62560,"description":"<p><strong><em>Oileán Dairbhre</em></strong> V370-730          Sheet 83 Population 700. A large and varied island lying ENE to WSW on the NW tip of the Iveragh Peninsula. Valencia marks the southern tip of the entrance to Dingle Bay. Inside the island is the flat and sheltered Portmagee Channel, joining Knightstown in the NE to Portmagee in the SW.  The piers at Knightstown and nearby Cahirciveen are by Nimmo. Knightstown is the only town on the island. A ferry runs from here to the mainland opposite at Reenard. Portmagee is a town on the mainland to which the island is connected by a bridge. The bridge opens to allow larger vessels through. The outer parts of the island are 9<em>km</em> or so of committing cliffs, by far the most dramatic of which are at the W end at Bray Head at V327-725. There is only one waystop on the outside section, about halfway along. History Footsteps in the rocks belonging to a tiny tetrapod dinosaur were found some years ago and date back to about 360 million years ago.  Overhead the NE entrance is Valentia Radio, one of the main coastal radio stations of Ireland. The first transatlantic cable was laid from here to Trinity Bay in Newfoundland, a process that began in 1855. In 1857, the ‘Agamemnon’ was nearly lost in a great storm when the cable snapped, at the edge of the continental shelf, 560<em>km</em> out to sea. Later, in 1859, the ‘Great Eastern’ completed the whole of the task solo. Adjacent to the radio station is an abandoned slate quarry.  The slate quarry opened in 1816 and its produce was used in the British House of Commons. Tides The tide flooding northeast past the island to fill Dingle Bay enters Portmagee Channel from both ends simultaneously, meeting 2km east of Portmagee.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Portmagee Channel</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"170\">4:50 after Cobh HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"170\">1:35 before Cobh HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Local HW is about an hour before Cobh. Streams reach 2kn at Portmagee itself and 1.5kn at Knightstown and Fort Point Lighthouse. Circumnavigation A circumnavigation is an obvious challenge, being logistics free, but is quite long at 25<em>km</em> or so. Many interesting stops might be made, and there are committing stretches on the outside. To save effort, these tides should be carefully planned. A suggestion perhaps, presuming ever-present SW winds, is to embark from Portmagee on the last of the ebb. Utilise the slack/early flood up the exposed part of the coast. Then enjoy the full-blooded flood in, to, and past Knightstown, almost home. Bray Head has a watchtower and huge overhanging cliffs, with fragmented rocks lying off the base with channels between them. NNE from here, reflected waves and strong tides, especially at the protruding points, make for an interesting passage. The only waystop on the outside part of the island is onto a storm beach at V358-762, tucked inside Shrone Point in an E-facing cove. This is about halfway between Bray Head and Reenadrolaun Point, at the lowest part of this section of the island. It is reachable by boreen if necessary. There is good camping and water may be had in the nearby river. If the journey is broken on Horse or Long Island, just 8<em>km</em> of paddling will reach this point. Nevertheless, the steepest cliffs and strongest tides are in this section so expect to be challenged to some degree. The cliffs on the E part of the outside are higher, but not as steep, and get a little shelter. Expect a bounce again at Reenadrolaun Point at V384-786, after which the going should ease considerably. There is a good, sheltered beach just inside Fort Point lighthouse at V404-783, with camping in the grounds, for use in distress only. There is also a less convenient slip outside and W of the point, with better camping but a more awkward landing. Really, those looking to camp in isolation hereabouts would be better to go to nearby Beginish. Knightstown is a pretty spot, worth visiting. All the island’s facilities are here – pubs, restaurants, dive schools, lifeboat, ferry, harbour, sailing. The channel back to Portmagee has fine views, but should be avoided at LW or with contrary tides.</p>\n","costalZone":"**The South Coast**"}