{"name":"**Ballycotton Island**","nameHtml":"<p><strong>Ballycotton Island</strong></p>\n","safeName":"Ballycotton-Island","coordinates":{"irishGrid":{"sheet":"X","eastings":"011","northings":"637"},"fullIrishGrid":{"sheet":"","eastings":"201100","northings":"63700"},"tmcGrid":{"sheet":"","eastings":"601050.239","northings":"563763.884"},"geo":{"lat":"51.82611493","long":-7.98476399}},"cursor":32639,"description":"<p><strong>Ballycotton Island</strong> X011-637          Sheet 81 Known locally as the Outer Island, and also as the Lighthouse Island, it is 50m high, steep and rocky. The lighthouse and associated buildings dominate the high part of the island. There are two landings, each difficult, each consisting of a flight of steps to a pier, located on the N and E flanks respectively, that on the E usually being a shade more friendly. There is a small sea-arch on the SE tip. There are breeding Shag, Great Black-backed Gulls, and Herring Gulls. <strong>Cork Harbour</strong> SPA (Parts only) Bewick &amp; Whooper Swan, Golden Plover, Bar-tailed Godwit, Common Tern. Cobh is a standard port for tidal information for most of the south/southwest of Ireland.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Mouth of Cork Harbour</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">In</td>\n\n<td width=\"173\">5:40 before Cobh HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">Out</td>\n\n<td width=\"173\">Cobh HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The West Passage of Great Island, particularly where narrowest at Verolme Dockyards, can achieve 3kn. The tidal streams in the harbour generally flood north and west, following the channels, strongest in the middle, circling islands both sides, notably Great Island. They generally ebb in reverse. There are exceptions:</p>\n<ul>\n<li>The current is always weak at about the Spit Bank just 1<em>km</em> off Cobh itself,</li>\n<li>At the harbour mouth, the ebb runs SE from Ram’s Head W811-619 towards Roches Point W824-601 and then SW, so that even the largest vessels are swept towards White Bay and then crabbed across the mouth of the harbour towards Ringabella Bay W795-580,</li>\n<li>In reverse, much the same, the stream sets into White Bay then NW,</li>\n<li>The strength of the tide is raised by S wind and especially SE wind (for a longer stronger flood).An increase of up to 1m has been known in Cork in gales.</li>\n<li>The strength of the tide is cut by N winds (for a weaker shorter flood), and by fresh water in the rivers in quantity (for a longer stronger ebb).</li>\n</ul>\n<p>At or about LW and the beginning of the flood</p>\n<ul>\n<li>At the harbour mouth, the main flood stream makes into the harbour at first on the W side past Camden Fort at Ram’s Head W811-619, -0020 before mid-channel.</li>\n<li>The stream in White Bay is weak.</li>\n<li>If there is fresh water flowing in the Owenboy River from the direction of Carrigaline, the stream there sets on its S side and around Ram’s Head W811-619 for some time after the flood has otherwise begun.</li>\n<li>From Ram’s Head W811-619 the ingoing salt water stream branches – part goes up the Owenboy River in the direction of Carrigaline W740-625, – and the main stream goes N, almost immediately dividing into two streams, one W of Cobh towards Cork and the other towards the E channel of Great Island.</li>\n<li>Because at this stage fresh water is still flowing outwards from the E channel of Great Island, when the two streams meet, a remarkable eddy forms around the area of the Spit Lighthouse W812-658.An inshore current is forced across Cuskinny Bay W820-670 and along the shore as far as Morloag Point W853-672.</li>\n<li>The flood is felt at Paddy’s Point W795-647 fully -0030 anywhere else in the harbour.For a considerable time before any change in midstream, the flood sets close inshore past this point, Ringaskiddy W777-648 and as far as Monkstown W771-661 and sometimes further.  This is apparently because in mid-channel, an undercurrent sets before the surface current makes.</li>\n<li>The ingoing W flood stream does not make at Cobh until a full hour at least after it has begun at the harbour mouth.</li>\n<li>The length and strength of the tide from Cobh up to Cork depends a lot on the amount of fresh water in the river.</li>\n</ul>\n<p>At or about HW at the beginning of the ebb</p>\n<ul>\n<li>The outgoing stream E of Great Island begins -0100, and continues along the E side of the harbour past Corkbeg Island W827-637</li>\n<li>The stream out of the Owenboy river begins -0100</li>\n<li>If there is much freshwater in the river Lee, there is a strong E ebb close inshore past Cobh.The ebb stream past White Point W786-657 strikes Haulbowline Island and then</li>\n</ul>\n","costalZone":"**The South Coast**"}