{"name":"**Ballinacourty**","nameHtml":"<p><strong>Ballinacourty</strong></p>\n","safeName":"Ballinacourty","coordinates":{"irishGrid":{"sheet":"X","eastings":"294","northings":"926"},"fullIrishGrid":{"sheet":"","eastings":"229400","northings":"92600"},"tmcGrid":{"sheet":"","eastings":"629344.151","northings":"592657.489"},"geo":{"lat":"52.08506438","long":-7.5718387}},"cursor":30604,"description":"<p><strong>Ballinacourty</strong> X294-926          Sheet 82 The pier and slip (water and good parking) at Ballinacourty Gold Coast Bar and Hotel is the local launch spot of choice of Waterford sea kayakers. Two rocky islands off Ballinacourty Point / Lighthouse – Carricknamoan X316-919 <em>Carrig na mBan</em> and the lesser Carricknagaddy X314-920<em>Carrig na Gadaí</em> covers at HW.  Carrickapane X319-908 <em>An Carraig Dubh</em> way out in the middle of the bay is by far the most important and is valued as a pitstop on touring the bay.  At lower water a sheltered lagoon is formed at the E end where there is a dependable landing onto slabs.  A WW2 mine exploded near Carrickapane after the war. <strong>Helvick Head – <em>Ceann Heilbhic</em></strong> Helvick Head is a lovely spot, a noted holiday area. There is the ‘new’ pier at Helvick at X313-892 – <em>Cé Heilbhic</em>, just inside the head. Parking and launching is easy beside the RNLI station. Toilets and water are available. This is a busy working trawler harbour. The ‘old’ pier at Ballynagaul atX299-888- <em>Baile na nGall</em>, is now somewhat silted. This is a noted small Gaeltacht area. The Clancy Brothers are very much associated with this area. This Carrick-on-Suir ballad singing family group emerged in the early 1960s with their <em>báinín</em> jersies in the USA to inject pride in English speaking Irish Ireland. As was then popular in south Tipperary they holidayed in Helvick.  Later, they settled here. The area as a whole is called Ring or <em>An Rinn</em>. The name probably derives from the mighty dune system guarding the inner bay called locally the Cunnigar – <em>An Coinigéar.</em> Rock climbing Helvick is a noted rock climbing spot. The cliff is about 1.5<em>km</em> SW of the gap between Helvick Head and Goat Island. The crag is immediately underneath and is accessed from the noted viewpoint and car park at X307-882. The rock is an isolated pocket of purple mudstone with some sandstone. This is said to be much better than pure red sandstone. It is solid, and takes good gear. The rock nearer to the head looks good from below, but is awkward to access from above, and may not be as good, being sandstone. Enquiries to Gerry Moss germoss@eircom.net. SPA Peregrine, Chough.</p>\n","costalZone":"**The South Coast**"}