{"name":"**Bear Island – _An tOileán Mór_**","nameHtml":"<p><strong>Bear Island – <em>An tOileán Mór</em></strong></p>\n","safeName":"Bear-Island-–-_An-tOileán-Mór_","coordinates":{"irishGrid":{"sheet":"V","eastings":"686","northings":"446"},"fullIrishGrid":{"sheet":"","eastings":"68600","northings":"44600"},"tmcGrid":{"sheet":"","eastings":"468578.256","northings":"544668.224"},"geo":{"lat":"51.63910529","long":-9.89878624}},"cursor":50085,"description":"<p><strong>Bear Island – <em>An tOileán Mór</em></strong> V686-446          Sheet 84 17.2 sq.<em>km</em>. Bear Haven, a natural harbour of naval importance for centuries, separates this massive island from the mainland. The permanent population is about 200. The distinctly mountainous W end of the island, opposite Castletown Bearhaven, is the most convenient to reach. There are many ‘Private’ signs about the W end, but the Beara Way gives access to the interior. Walking on the high ground is lovely, along little-used waymarked trails and the scenery is wonderful. Ardnakinna Lighthouse at V672-423, marking the W entrance to Bear Haven, is very recent, lit in 1965. The only village is towards the E end at Rerrin, where the island is narrowest. The many guns and fortifications on the island were mostly built as recently as 1910, and some held IRA prisoners during the War of Independence. There are two Martello Towers where there were once four, two having being knocked down for later military building works. The island and its fortifications were held by the British, even after Irish independence, until 1938. They were handed over to the Irish , with other so called ‘Treaty Ports’, Swilly, Cobh and Bantry Bay, after a trade war. This was soon much regretted, when Britain went to immediate and terrible war with Germany. Two 6 inch guns can still be seen at Lonehort Fort, the biggest fort on the island. Two ferries ply between the mainland and the island. The western ferry is from downtown Castletown Bearhaven. The eastern ferry is from Beal Lough at V717-463, 3<em>km</em> E of the town. Embarkation and Landing The harbour of the major fishing town of Castletown Bearhaven is the logical embarkation place. Launch at the slipway at V680-461. The western ferry sets out from here. The pier is one of Nimmo’s.  The slip is just opposite the SuperValu supermarket, which is seriously well stocked. Good parking. The grid reference marks the nearest ferry landing point in a small sheltered bay inside the W end, where kayaks may also land. Tides Bear Haven is a natural harbour varying from narrow and mountainous at its western entrance, to low and shallow at its eastern end. Tides flow in and out at both ends simultaneously, meeting in the middle. The stronger tides flow at 2kn through the western entrance and turbulence may be expected. Tides are not strong otherwise in the sound. At the eastern entrance, they reach 0.5kn.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"346\"><strong>Entrances to Bere Haven</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"94\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"170\">5:50 after Cobh HW</td>\n\n<td width=\"94\">2kn (west)</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"170\">0:25 before Cobh HW</td>\n\n<td width=\"94\">2kn (west)</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Tides enter and leave much as with local HW and LW. Circumnavigation There are many interesting spots in the 21<em>km</em> around the island, some of which are listed here, clockwise from the W end. V674-433        Just inside the narrowest point of the western entrance to Bear Haven, it is reachable by backpacking or paddling. The landing is onto sheltered steps, easily identified inside a large yellow buoy and below a zigzag track. A seriously idyllic camping spot, midge free. Shore fishing. Water nearby. V677-440        Gun forts (private) at Fort Point, and also just S at V677-435. V696-447        There are a number of choices for more private camping away from ferries, but for those constrained to use the inside channel, perhaps the nicest would be about 1<em>km</em> E of the western ferry arrival point. Keep away from either ferry as the water is churned up and the swimming unattractive. V741-443        There is a handy stony beach at a slip just inside Rerrin Bay, on the E side. Rerrin is in the E and the only village on the island. Hereabouts the island is waisted which is most convenient to inspect the conditions outside. The village has restaurants, pubs and other facilities. The eastern ferry leaves from Beal Lough at V717-463 about 3<em>km</em> E of Castletown Bearhaven. The eastern end of the island is by far the prettier, welcoming, and more civilised. V748-447        E of the eastern ferry is low lying, but there is a super campsite in the shallow bay near two houses, and also elsewhere E of there towards Lonehort Point. V755-443        Lonehort Harbour lies SW of Lonehort Point. Though storm beaches separate the two, the harbour is the more dependable resting point on a circumnavigation. A bump may be expected at several points along the outside, including Leahern’s Point. V755-435        Leahern’s Point, sheltering Lonehort harbour. V739-434        Storm beach at Coosavaud (means ‘Boat Harbour’), E facing, by a slipway. V721-427        Splendid little cove with a very narrow, S facing entrance, just NE of prominent Greenane Rock, gives great respite. It is better than the nearby and more obvious SW facing cove below houses at V724-428. V672-423        There is no respite from the above cove until the lighthouse at Ardnakinna Point, but watch for the waterfall at about V712-424, and there are others. V671-424        Illaundoonagaul, almost an island, has sea arches of the finest variety, which, being inside the entrance, are very inspectable.</p>\n","costalZone":"**The South Coast**"}