{"name":"**Capel Island**","nameHtml":"<p><strong>Capel Island</strong></p>\n","safeName":"Capel-Island","coordinates":{"irishGrid":{"sheet":"X","eastings":"100","northings":"700"},"fullIrishGrid":{"sheet":"","eastings":"210000","northings":"70000"},"tmcGrid":{"sheet":"","eastings":"609948.349","northings":"570062.479"},"geo":{"lat":"51.88264655","long":-7.85549651}},"cursor":31945,"description":"<p><strong>Capel Island</strong> X100-700          Sheet 81 This attractive, 37m high island is just off Knockadoon Head, which separates Ballycotton Bay from Youghal Bay. It is privately owned but became (mostly) a Birdwatch Ireland nature reserve in 1994. The stub of an unfinished lighthouse on its highest point dominates the island. Stone walls surround the building, and a small, square out-house is worth investigating to see the dramatic drop from the hole in its floor. The seaward side of the island is most attractive and there is a colony of breeding Cormorant (60 pairs in 1995) at the SW corner. Otter are also present. There is no water, and a possible deterrent to camping is a herd of goats. There were 30 or so in 1995, only 12 in 2002. In 2010, the lighthouse now has a locked gate. Embarkation There is a pier and slipway at X092-703 for embarkation at Knockadoon Head where there are two well-sheltered beaches. The only water hereabouts is at houses and the local Dominican summer school camp, and the nearest shops and facilities are at Ballymacoda, 5<em>km</em> to the W. Given the proximity of the island to Knockadoon Head local kayakers usually paddle across from Youghal. There is excellent parking and short carry at Ferrypoint X116-778 on the Waterford side of the Blackwater River opposite Youghal. It makes for a nice paddle to Capel Island. About 8<em>km_each way. Landing A low headland projects NW from mid-NW side of the island. There are beaches at either side of the base of this headland. The beach to the SW side (on a direct line between Knockadoon Pier and the tower on the island) does not exist at HW and is more exposed, but access to the interior is easier. The beach to the NE side does not exist at HW and access to the interior is scramblier. At HW, a deep-water landing may be had onto rocks on the sheltered cove E of this headland. Tides Local HW/LW are as Cork. So is slack, according to local paddlers. A fierce tide runs through Capel Island Sound. In Youghal Bay, southerly winds raise a heavy sea. The coastline westward to the beach at Ballymakeagh at X050-688 is very pleasant, and there are great views eastwards to Ardmore and Helvick. Knockadoon Head was the fastest developing rock climbing crag in Ireland in 2003.  It remains a popular low season target of opportunity for its sunny south facing aspect. <strong>Ballycotton Islands</strong> There are two contrasting islands lying just off the coast from Ballycotton village in E Cork. Embarkation Embarkation is best from a small slipway at the village where there is a small field in which to park, and a very easy gradient yielding a short carry of 50-100m maximum. This is about 1_km</em> WNW of the harbour, opposite the Garda barracks. It is reached by a laneway beside a shop at W989-643. There is water available here and also at the harbour from public taps. Ballycotton has good facilities, B&amp;Bs, pubs and restaurants. The harbour itself is slightly further E at W999-637. Launching is difficult, but is possible from either of two slipways reached by narrow, steep alleyways. Descent to the beach is also possible behind the toilets on the main pier. In addition, there are steep, narrow steps halfway down the outside (E) of the pier which gives awkward access to a small beach. The W pier of the harbour is little more than a breakwater. Tides In Ballycotton Sound and between the inner island and the coast, 2<em>kn</em> is achieved,. Slack water is thought by local paddlers to be much as for LW/HW Cork.</p>\n","costalZone":"**The South Coast**"}