{"name":"**Cape Clear Island – _Oileán Cléire_**","nameHtml":"<p><strong>Cape Clear Island – <em>Oileán Cléire</em></strong></p>\n","safeName":"Cape-Clear-Island-–-_Oileán-Cléire_","coordinates":{"irishGrid":{"sheet":"V","eastings":"954","northings":"218"},"fullIrishGrid":{"sheet":"","eastings":"95400","northings":"21800"},"tmcGrid":{"sheet":"","eastings":"495372.122","northings":"521873.296"},"geo":{"lat":"51.43987785","long":-9.50505695}},"cursor":40044,"description":"<p><strong>Cape Clear Island – <em>Oileán Cléire</em></strong> V954-218          Sheet 88 This Gaeltacht island is truly the Land’s End of SW Ireland. Cape Clear is actually the most SW point of Cape Clear Island, called Pointabullaun at V943-197. Mountainous, steep, and imposing, the island is home in winter to about 135 people or 110 voters and many more in summer. A ferry runs all year from Baltimore – twice daily in winter, more often in summer. In summer, there is also a ferry from Schull. The island has pubs, B&amp;Bs, restaurants, two hostels, a well-appointed campsite at V954-212, windmills, very basic shops and provisions, and the most famous bird observatory in the country at V954-219. The island is extremely waisted, the waist being known as ‘The Waist’, with the North Harbour to landward, and South Harbour on the seaward side. The waist itself is high and narrow, and the roads in the vicinity of the waist are extremely steep, that giving access to the E end of the island being called the A1 and having a gradient of about 1:4. The co-operative club serves excellent meals and drink on the harbour, and Cotter’s Bar is also located here. There is a third wee pub up at the waist. A fourth, modern pub, Danny Mike’s, has been built just S of the waist, and excellent food may be had from breakfast to dinner time. “<em>Dún an Óir</em>” (Gold Fort) is the mediaeval castle on the projecting headland just WSW of the North Harbour. On private land, it was once an influential affair under the O’Driscolls, who ruled locally. The Spanish came in 1601 under Don Juan del Aquila. After the defeat of Gaelic Ireland in Kinsale that year, the castle, and Ireland generally, not to mention the Spanish, fell into decline. There is the ruin of a lighthouse on the middle summit, which was the main landfall light for ships arriving from America during most of the 19th Century. Its light was too high up, and therefore too often obscured by fog. It was decided, after 100 lives were lost in a shipwreck in 1847, to build a lighthouse on the Fastnet Rock. Incoming liners long ago passed by the island, and the passengers would toss messages overboard in sealed containers.  These were forwarded from the signal station and arrived in London hours before the ship.  The islanders were first in Europe to hear of the assassination of Abraham Lincoln. The island would repay a fortnight’s visit, and the walking repays fitness. Landing The main landing is at the beach in the well-sheltered pier in North Harbour, where the ferry comes in. For a fleeting visit, land on the sandy beach, dead ahead of the harbour entrance. For longer visits, consider the remoter mud/shingle beach under the bird observatory in the inner harbour, hard right just inside the harbour entrance. Should conditions allow, landing is also very sheltered in South Harbour. Land here easiest at the stony beach on the E side, inside the lovely old quay and under the youth hostel at V958-213. Circumnavigation A circumnavigation is a committing 15<em>km</em> and requires good conditions and planning. Note particularly that the tidal timings vary at each end of the island. The crux of the trip will always be off Cape Clear itself, W of South Harbour, but Gascanane Sound may provide technical interest also. Begin and end at North or South Harbour. Landings, as waystops only, may be had on the N side, where roads are shown going down to the sea, near the little rocky island Illauneana (V970-235). Both are stony landings, that to the E being steep also. The landing apparent on the map at V984-230 on the E side is very difficult. It is an exposed, steep slipway, impossible without good conditions and best avoided. There are no landings on the SE side, nor W of South Harbour round to North Harbour. There is a mighty sea arch at Pointanbullig on the E side of the South Harbour entrance. Camping The main camping is a well-appointed campsite at V954-212. For kayakers, this is inconvenient to the North Harbour, involving a long carry past the waist. Better by far is to land in South Harbour, on the W side, under the campsite. The only possible camping ‘sauvage’ may be had inconveniently, on the N side where roads are shown going down to the sea, near the little rocky island Illauneana (V970-235). Nothing is known as to availability of water. Hostels B&amp;B and a hostel may be had at Cotter’s Bar, just above the main pier. There is an ‘An Oige’ youth hostel at the South Harbour at V958-213. Those landing here will be well rewarded for their extra effort in terms of the welcome, as an outdoor pursuits centre runs from the hostel called ‘Cleire Lasmuigh’ or in the English, ‘Cape Clear Island Outdoors Activity’. Calm conditions are needed to paddle around to this spot. Birding At the pier in North Harbour is the Bird Observatory building, like a youth hostel. This (in season) is strictly for birders. The birding season locally is the autumn months of August through to November, so paddlers may be welcome at other times. Even in season, especially for those possessing binoculars and who know a covert from a supercilium, it may be worth asking. When a new “first” (such as Yellow Bellied Sapsucker or Red Eyed Vireo, to name recent samples) gets reported on the bird grapevine, the island becomes suddenly thronged with highly motivated, intensely competitive individuals. They have all abandoned faraway families and jobs with zero notice, here to see, “tick” and “twitch” on the avian wonder that has dropped in. These people are not dangerous when approached, even when they occur in numbers. However, as they have no interest in those outside their own kind, they will mostly ignore you, so there is little point, and anyway they speak a language all their own. Because of its extreme SW position, Cape Clear Island is directly in the path of long distance birds and cetaceans gaining and regaining the North Atlantic from all points E and S. Accordingly, Cape Clear is internationally famous for its migrants and vagrants, and virtually nowhere else in the country has as many rarities, and mega-rarities. Most bird observation is done near the waist and on the W end of the island. Dawn and dusk sea-watching of both birds and cetaceans is done mostly from Blananarragaun at V947-197, which juts out at the extreme S tip of the island. Get there by following a path along the top of the cliffs on the W side of South Harbour. When approaching, it appears inaccessible, but keep your nerve, it is easy enough to scramble out. Morning or evening, this is one spot you will never have to yourself. The area just behind the Youth Hostel is also a renowned birding spot, especially for the smaller passerines, and much ringing and counting takes place hereabouts. Good birds are seen further E on the island as well, especially on the N side, among the sheltered wooded spots. Climbing There is excellent rock climbing on the Bill of Clear, thin, well-protected slabs, and some steeper work, with plenty of scope remaining. These are reported in the ‘New Climbs’ bulletins of the late ‘80s. Tides The flood tide arrives at the western end of Cape Clear and runs along the northern and south coasts at the following times:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"251\"><strong>North &amp; south coast of Cape Clear</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NE</td>\n\n<td width=\"170\">4:20 before Cobh HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SW</td>\n\n<td width=\"170\">1:50 after Cobh HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The situation is more complex on the eastern and western sides. In the east in Gascanane Sound, the times are as follows:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Gascanane Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SE</td>\n\n<td width=\"170\">5:20 after Cobh HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NW</td>\n\n<td width=\"170\">0:55 before Cobh HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>In the west, the flood separates at the Bill of Clear (V937-204), which juts out from the northern tip of the western side. The northern branch is uncomplicated. The southern branch sets up heavy confused seas as it continues to Blananarragaun, the point 1.5km to the southeast, which juts out from the southern tip. After Blananarragaun, it makes a big eddy anticlockwise around the outer part of South Harbour. On the ebb, there is a big eddy set up by Blananarragaun, clockwise to the Bill of Clear and back along the cliffs under Cape Clear. Thus, there is always a race off Blananarragaun when the tide is running and usually a heavy, confused sea state between Blananarragaun and the Bill of Clear.  It is all very confused and uncertain. Offshore to the mighty Fastnet, the tides run east/west.</p>\n","costalZone":"**The South Coast**"}