{"name":"**Chapel Island**","nameHtml":"<p><strong>Chapel Island</strong></p>\n","safeName":"Chapel-Island","coordinates":{"irishGrid":{"sheet":"V","eastings":"980","northings":"497"},"fullIrishGrid":{"sheet":"","eastings":"98000","northings":"49700"},"tmcGrid":{"sheet":"","eastings":"497971.935","northings":"549767.215"},"geo":{"lat":"51.69102562","long":-9.47576697}},"cursor":48153,"description":"<p><strong>Chapel Island</strong> V980-497          Sheet 85 1.5<em>km</em> N of the embarkation point.  A large twin island, the interior of the smaller W half is accessible.  There are the remains of a cottage in the dip between the two halves, on the W side.  There are that many rabbits about the W end that tripping in a burrow is a potential danger.  The whole W half is overrun with ragweeds.  There is also slight evidence of ancient lazybeds.  Two horses grazed in 2008.  Very pleasant. The bigger E half  is inaccessible.  A pedestrian access was forced at one time at the narrow prow leading from the dip, but it has eroded so much that it is now dangerous.  Consequently, the interior has gone back to the wild, and holds no apparent interest for the recreational user. Land easily either side of the dip onto gravely beaches.  No water found. <strong>Glengarriff Harbour</strong> A pleasant, sheltered spot for an excursion on a short or windy day. It is interesting to dodge in and out among the smaller rocks and islands of the bay, trying not to disturb seals and other wildlife, admiring the posh houses and boats, goats, and generally luxuriant landscape. Some of the islets are individually mentioned. Note the warnings on visiting Garinish. Do not disturb the seals. Local boats bring tourists to view the seals so any messing about is less than appreciated. The local boats can phut-phut up to within a few feet of the seals and be ignored. Familiarity breeds contempt. Kayaks, being unfamiliar, are held in high esteem by the seals, who panic on sight. Otter are reported, and terns. Camping is neither appropriate nor welcomed, nor was it found. Embarkation Probably easiest from a sheltered pier and slip about 1<em>km</em> S of Glengarriff where the Castletown Bearhaven road meets the sea at a spot called locally ‘Ellen’s Rock’ at V925-552. Smaller ferries than those from Glengarriff ply from here, and the landing spot on Garinish can be seen 1<em>km</em> to the E.</p>\n","costalZone":"**The South Coast**"}