{"name":"**Dursey Island**","nameHtml":"<p><strong>Dursey Island</strong></p>\n","safeName":"Dursey-Island","coordinates":{"irishGrid":{"sheet":"V","eastings":"506","northings":"414"},"fullIrishGrid":{"sheet":"","eastings":"50600","northings":"41400"},"tmcGrid":{"sheet":"","eastings":"450582.197","northings":"541468.755"},"geo":{"lat":"51.60587346","long":-10.15724332}},"cursor":51122,"description":"<p><strong>Dursey Island</strong> V506-414          Sheet 84 Huge but sparsely populated island (permanent population of 9) of Great Blasket proportions. It is connected to the mainland by cable car at Dursey Sound. This is the only cable car in Ireland and the only cable car in Europe that crosses salt water. The Beara Way runs the length of the island – along the main roadway outwards and over the hilltops back. It goes past the signal tower on the summit, and makes for a splendid day’s walk. The main area of habitation is about one third along the island but there is no village as such. There is no beach. Embarkation In calm conditions, launching is practical (if a bit awkward) at Dursey Sound, from the pier at V507-418. Certainly, no exploration of the outer parts of the island or the off-lying rocks would be sensible if conditions made launching impossible here. More dependably, there is a magnificent, sheltered strand at the pier and slip at White Strand Quay, in the extreme SW of Allihies Bay, at V523-428. Landing and Camping The pier and steep slip at V506-414 are well sheltered, just outside the S entrance to the sound. No water was found nearby but there must be. Camping is possible just SW of the slipway towards an old churchyard. There is no easy landing other than at the slipway. Rock pools just S of the slipway, which form and un-form with the tide, may provide a landing. Historic O’Sullivan Bere ruled here until 1601. When gaelic Ireland and its Spanish allies were defeated in the Battle of Kinsale 1601, he famously marched with 1,000 soldiers to Leitrim, to join the remnants of the rebellion, rather than give in. They set out on New Year’s Eve 1601. The hardship endured over 20 days and the courage of the men, live on in folklore to this day. Only a few dozen made it all the way to join O’Rourke of Breffni and Red Hugh O’Donnell of Donegal. It was all in vain, and the rebellion fizzled out in 1607, with the Flight of the Earls. The English destroyed his Dursey castle in 1602 in his absence. He might never have been so well known to posterity but that the great scholar and historian Don Philip O’Sullivan, his nephew and great admirer, was a Dursey man, born in 1590. Don Philip recorded the great feats of his defeated uncle, in Latin. His best known work was <em>Ireland under Elizabeth</em> published in Lisbon 1621. Tides The 14km circumnavigation is a challenging experience and races may be expected off the twin outermost points and elsewhere as tides and wind dictate. Tides flow up to 4kn in Dursey Sound and constantly boil, especially over a rock in mid-channel, under the cable-car wires. There is usually clapotis at the northeastern corner of the sound, which kayakers have found to extend 1.5km to Garinish Point to the northeast. Beware flukey winds at the northern entrance. The flood eddies on both sides of the southern entrance. Off the outer tip of Dursey lie the Calf, the Heifer, the Cow and the Bull, mighty, remote and challenging rocks. Until recently, no kayaks had landed. The Bull has a huge lighthouse complex. The Cow has nothing. The Calf has an abandoned stump of a lighthouse. Off these, the main tidal streams around Ireland split. One stream heads south through Dursey Sound and on to Cork, Wexford and Dublin. The other heads north to Kerry, Mayo, Donegal and Antrim. The two streams meet again at Carlingford, the Isle of Man and the England/Scotland border.</p>\n<table width=\"412\">\n\n<tbody>\n\n<tr>\n\n<td width=\"119\"><strong>Dursey Island</strong></td>\n\n<td colspan=\"2\" width=\"132\"><strong>Dursey Sound</strong></td>\n\n<td rowspan=\"2\" width=\"161\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"119\"><strong>Direction</strong></td>\n\n<td width=\"76\"><strong>Direction</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"119\">E (flood)</td>\n\n<td width=\"76\">S</td>\n\n<td width=\"57\">4kn</td>\n\n<td width=\"161\">5:00 before Cobh HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"119\">W (ebb)</td>\n\n<td width=\"76\">N</td>\n\n<td width=\"57\">4kn</td>\n\n<td width=\"161\">1:30 after Cobh HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>On the flood, there is extensive eddying in the bay between the southern entrance to Dursey Sound and Crow Head to the south.</p>\n","costalZone":"**The South Coast**"}