{"name":"**Fastnet Rock – _Carraig Aonair_**","nameHtml":"<p><strong>Fastnet Rock – <em>Carraig Aonair</em></strong></p>\n","safeName":"Fastnet-Rock-–-_Carraig-Aonair_","coordinates":{"irishGrid":{"sheet":"V","eastings":"886","northings":"163"},"fullIrishGrid":{"sheet":"","eastings":"88600","northings":"16300"},"tmcGrid":{"sheet":"","eastings":"488573.476","northings":"516374.462"},"geo":{"lat":"51.38916731","long":-9.60108714}},"cursor":41485,"description":"<p><strong>Fastnet Rock – <em>Carraig Aonair</em></strong> V886-163          Sheet 88 Fastnet is remote. It lies about 20<em>km</em> from Baltimore or Schull. It is easiest reached from Cape Clear Island at about half that distance. The rock itself is 24m high and the lighthouse projects way beyond. It is a bleak, desolate place, its buildings all shuttered, its stairs and pathways steep and narrow and unprotected by maintained railings for the mostpart. A first attempt to build the lighthouse was in cast iron, completed in 1853. It wasn’t a success. In 1899, they began a granite replacement. This was first constructed in Cornwall of numbered blocks, 2,074 of them, weighing 3 – 5 tons each. These were then dismantled, taken to Rock Island, off Crookhaven, and reassembled. Then they were dismantled again, and reassembled again on the Fastnet. This was achieved without fatality, unusually in the Irish experience. The whole task was completed in 1904. Launch Schull and Baltimore are each the bones of 20km.  Nearest mainland launch as the crow flies is 13km at Galley Cove V788-247 at Crookhaven, or 14km from Colla Pier V916-293 outside Schull.  If possible, maybe break the journey in or out or both in Cape Clear Island at 9km.  Trip planning is a tension between getting the tidal flow right and not arriving at LW, if wanting to go ashore. Landing This is one of the more exposed lighthouse island landings, always subject to surge and scend. Certainly, few enough kayakers get here, because it is remote, but far fewer still go ashore, because to do so is so difficult. Fastnet is on a shallow shelf, always kicking up in the 200m or so around the rock. The landing platform is at the SE corner. Consider sending half the party ashore at a time, for safety. The steps for landing are approximately 01m proud of the water at LW. This has not been accurately measured, but a substantial height differential has been absolutely verified, so it complicates a slingshot approach to trip planning, where one would leave Cape Clear on the ebb, arrive at the Fastnet at LW and return on the start of the flood. Tides In prevailing westerlies, local kayakers agree it is perhaps best to do the whole thing on the flood. This allows one to arrive in plenty of time to land, take photos and rest before coming ‘home’ on the last of the flood.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Between Fastnet and Cape Clear</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"66\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">4:20 before Cobh HW</td>\n\n<td width=\"66\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">1:50 after Cobh HW</td>\n\n<td width=\"66\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>However, near the rock itself, it swerves more north / south as follows:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Within 2km of the Fastnet</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"66\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SSE</td>\n\n<td width=\"170\">4:05 before Cobh HW</td>\n\n<td width=\"66\">2.25kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NNW</td>\n\n<td width=\"170\">2:00 after Cobh HW</td>\n\n<td width=\"66\">2.25kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>With westerly winds, the flood starts earlier and runs harder and the ebb starts earlier and runs harder in easterlies. Beware also of the shallow areas northeast and southwest of the Rock which can throw up confused seas.</p>\n","costalZone":"**The South Coast**"}