{"name":"**Goat Island (Mór)**","nameHtml":"<p><strong>Goat Island (Mór)</strong></p>\n","safeName":"Goat-Island-(Mór)","coordinates":{"irishGrid":{"sheet":"V","eastings":"893","northings":"274"},"fullIrishGrid":{"sheet":"","eastings":"89300","northings":"27400"},"tmcGrid":{"sheet":"","eastings":"489273.506","northings":"527472.047"},"geo":{"lat":"51.48903124","long":-9.59450209}},"cursor":43969,"description":"<p><strong>Goat Island (Mór)</strong> V893-274          Sheet 88 The main Goat Island is ‘L’ shaped and has a ruined cottage and lazy beds on the eastern leg. Fences suggest recent grazing. Certainly, despite the lack of obvious grazing, in the summer of 95 the island was not overgrown. It was really quite inviting, a most attractive island. A deep-water landing may be had onto a natural but steep-sloping ramp at the E tip, just S of a prominent sea arch. At the join of the ‘L’, there is a sea arch where, except at the highest tides, there is a sand bank in the middle, but no reasonable access to the interior.  For a couple of hours either side of HW this makes for a lovely passage, highly recommended. Crookhaven / Galley Cove Galley Cove V788-246 is laid out as a picnic spot, but however it is mostly used as a wild camping site, and locals advise there is no problem with camping there. There are four individual slightly raised hardstand BBQ sites which are thereby dryer for tent pitching, and beside them is plenty of grass in good conditions. The site is between Galley Cove and (local name) Cockleshell Beach or White Strand (per the OS) V785-247 just across the road. Have a look at <a href=\"http://www.coastalhelicopterview.ie/\"><a href=\"http://www.coastalhelicopterview.ie\">http://www.coastalhelicopterview.ie</a></a> where the area is clearly visible from a few of the photos. It is a good mile walk along the road to Crookhaven, which has no footpath for most of it, and with a few blind corners, so it is nearly as easy to paddle down for provisions and a pint. Call into O’Sullivans on the pier in Crookhaven for local information. There is a small shop attached to O’Sullivans bar for basic provisions. Galley Cove is just about the closest accessible departure point to the Fastnet, and very suitable for aiming to get to Fastnet at HW (which would solve the LW “steps out of the water” issue). There are some lovely deep caves a short paddle around the corner West from Galley Cove, to the inside of Reen Point V790-242, the caves facing West. A nice short trip is a lap of Crookhaven starting and finishing on Cockleshell beach. The cars can be parked at Galley Cove and only require a short carry. Be sure to do it clockwise as there is a fantastic tunnel V817-255 through the waisting immediately inside Streek Head V819-255.  The entry is spectacular, and the exit is relatively sheltered, however if in any doubt, first go around the point to check it out. Mizen Head A place of strong tides, big seas and a real feeling of exposure. There is a super cave just below Mizen Head, on the South side, below the car park for the visitors centre at V740-235.  The cave faces West so can only be entered on very calm days. Very deep (150m perhaps) with loads of colours throughout, there is a beach at the very back which can have many seals resting on it.  Voted by locals to be a truly most spectacular cave. Day Tripping Launch nearest from Barley Cove on the East side, but the put in spot will vary with conditions.  More dependable is Galley Cove V792-246.  On the North side the position is far more uncertain.  The nearest haul out is at the infamous Dunlough Bay V739-265, which is exposed.  This was the scene of Ireland’s and Europe’s largest ever illegal drug smuggling seizure in 2012 when a RIB foundered in the bay, the petrol engine having been filled with diesel.  The slip is steep, there is an old windlass, a pier with steps, and seemingly always a surge. Quite exposed and a good distance in from a straight line crossing from Mizen to Three Castle Head, this only of use in exceptionally calm days, and not worth investigating in passing speculatively. From the carpark above the slip there is a lovely walk (20 odd minutes each way) to Three Caste Head.  The three castles are in a spectacular setting, well worth the trip. Access is across private lands, with a donation box for the upkeep. Toor Pier V749-283 is 3km beyond Three Castle Head and is only slightly the better option.  It too needs very gentle conditions, as otherwise the slip is very steep and overgrown.  It has a reputation as a boat eater, but seal launching plastic boats is quite possible.  Steps nearby are also smothered in weed, and it isn’t easy.  The pier is popular with divers, who can manage better.  Vehicular approach is a bit tedious.  There is no other safe option short of Dunmanus Harbour V848-333 at fully 10km ENE. Beware of a race between Mizen and Three Castle Head, especially with wind against tide. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Mizen Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SSE</td>\n\n<td width=\"170\">5:05 before Cobh HW</td>\n\n<td width=\"57\">4kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NNW</td>\n\n<td width=\"170\">1:20 after Cobh HW</td>\n\n<td width=\"57\">4kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p><strong>Dunmanus Bay</strong></p>\n","costalZone":"**The South Coast**"}