{"name":"**Great Saltee Island**","nameHtml":"<p><strong>Great Saltee Island</strong></p>\n","safeName":"Great-Saltee-Island","coordinates":{"irishGrid":{"sheet":"X","eastings":"952","northings":"974"},"fullIrishGrid":{"sheet":"","eastings":"295200","northings":"97400"},"tmcGrid":{"sheet":"","eastings":"695129.764","northings":"597456.378"},"geo":{"lat":"52.12079534","long":-6.61081916}},"cursor":26088,"description":"<p><strong>Great Saltee Island</strong> X952-974          Sheet 77 This is a beautiful island. Grazed and easily walked or camped on, this island is lovely and deservedly popular with Irish paddlers. The island is a famed bird-watching spot, and is often inhabited by birding visitors in season, mainly spring and autumn. Once inhabited by 20 people, the island became uninhabited relatively early by Irish island standards. There are monuments and references to Prince Michael of Saltee on the island. He bought the island in 1943, crowned himself Prince in 1972, and died in 1998. Renewed interest in the island by his extended family has resulted in some of the scrub being removed around the remains of the old rick yard and the corn stands are more clearly visible. Landing Land at X952-974 on the N side, E of the middle. The main landing area has recently been improved with a channel having been cleared through the boulder beach, which in June 2003 gave a welcome sandy strip even at the lower stages of the tide. There are steps above to a house in trees. This landing is sheltered in most conditions. Privacy Predictably, members of the family are almost certainly in residence in August, long weekends, or periods of settled good weather. The tradition of flying the Prince of Saltee flag from the flagpole above the landing when the family are in residence has been renewed. During such periods, day-trippers must arrive later than 1100 and vacate the island by 1630.  Camping is not permitted. Circumnavigation Circumnavigation gives good fun in tidal races off the appropriate points, but beware that there is much eddying. There is excellent cliff scenery, and a particularly pretty channel just E of the S tip. Sea conditions at the southern tip become fearsome in strong winds or with wind against tide.</p>\n","costalZone":"**The South Coast**"}