{"name":"**Great Skellig**","nameHtml":"<p><strong>Great Skellig</strong></p>\n","safeName":"Great-Skellig","coordinates":{"irishGrid":{"sheet":"V","eastings":"250","northings":"608"},"fullIrishGrid":{"sheet":"","eastings":"25000","northings":"60800"},"tmcGrid":{"sheet":"","eastings":"424988.309","northings":"560864.458"},"geo":{"lat":"51.77269215","long":-10.53612082}},"cursor":59890,"description":"<p><strong>Great Skellig</strong> V250-608          Sheet 83 Nothing that the visitor has read or been told about this island, nor even the sight of it from near or far, at dawn or dusk, will prepare one for the reality when one lands. Monks Monks inhabited the island from at least the 6<sup>th</sup> Century. A monastic settlement thrived here through Europe’s Dark Ages. Inhabitation may be much older, as monks were most practical individuals, well capable of adopting, adapting and improving on the practices of those who went before them. Vikings raided here in 823 but got poor return for their efforts. These monks were true ascetics, and there was nothing to rob. The settlement consists of beehive-type huts, built on the very summit. Actually, they are built on the secondary of two such summits, but only a pedant would say so. Keep clear of the actual summit of the island, which requires climbing. Many have climbed up and been unable to climb back down.  Climbing down is harder than climbing up. The visitor will be left incredulous at the system of roads and pathways accessing the different parts of the island. Those who conceived and built what is to be seen here wouldn’t remove their caps in the presence of those who built the pyramids. Marvel at the pathways and walls, the stone staircases, the dwellings, the churches, the sheer drops everywhere. Some parts of the Skellig are very dangerous, and for the avoidance of doubt, there are no shops, facilities of any kind, or toilets. There is definitively no drinking water, despite some literature saying otherwise. The many wells are disused and unclean. Embarkation For the kayaker, the Skelligs are a major challenge. They are further out from a landing than any other island dealt with in this guide. Further, there is a serious risk that on arrival, conditions will not be suitable to land. Therefore, the trip should only be undertaken in settled weather. Ideally, choose dead calm conditions. In any event, do <em>not</em> choose wind from the E/NE. Alternatively, those fit enough to turn round and go home again without breaking their journey could try. The journey out is about 20<em>km</em> from Portmagee, or about 3 hours for an average, competent group. Therefore, the level of fitness required across the party should not be underestimated. The Skelligs are thought to be, from certain perspectives, the single most committing paddle in Ireland. Three launching options present themselves: 1.  Portmagee is the normal departure point. The journey is a bit longer, but the put-in or take-out is always dependable. Launching is a bit awkward, being over weedy flats, but manageable. 2.  A return journey in only 5 hours is possible from a small beach called Keel in Saint Finan’s Bay at V390-685. This though, is less dependable, as it surfs. It saves half an hour’s paddle, each way, not inconsiderable if the journey has to be done both ways. 3.  Also in Saint Finan’s Bay, and 2<em>km</em> closer again, is Boat Cove at V376-686, reached from the road by a 500m track down to a pier and slipway in a small harbour, known locally as Glen Pier. Ferries go from Glen Pier to Skellig. The problem with launching from anywhere but Portmagee is that, in anything but calm conditions, Saint Finan’s Bay is an inherently hazardous place. There are cliffs for many kilometres either side of the beach and harbour, and the beach is liable to surf. Portmagee offers a calm put-in or take-out at all times, on a main road. Saint Finan’s Bay must therefore be of interest only to those on passage, on holiday in the immediate area, or in exceptionally calm weather. The difference in the journey for those fit enough for the task does not outweigh the logistics involved in finding the right conditions. This applies to going and, particularly, coming back hours later. Breaking the journey There is the possibility of reducing the overall commitment level in terms of non-stop kilometres to be travelled. At V345-679, Puffin Island may be landed on, leaving a 13<em>km</em> journey ‘only’. Puffin may be reached from Portmagee at about 7/8<em>km</em> to the NE, or at 4.5<em>km</em> from Keel to the E. Routing via Puffin has the further advantage that it, then Lemon Rocks, then Little Skellig, then Great Skellig, all form one long straight line. Beware, the line is not dead straight, but is very usable. Also, this route crosses the tidal flow at right angles making navigation simpler. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between Skellig and the coast</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">5:00 after Cobh HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">1:10 before Cobh HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Local HW is an hour before Cobh HW. Landing The landing is on the NE tip of the island, looking across to the Little Skellig. It is a small pier with narrow, steep steps, up which the kayak must awkwardly be carried. These steps areb extremely steep and narrow, but nowadays they do at least have a handrail. Rope work and teamwork may be necessary, especially at LW. The bottom step gets just covered at LWN. So, landing is the more difficult or even impossible around LWS. Arriving while the tour boats are present (1030 to 1500 hrs. approximately) may greatly increase these problems.  They block access to the landing steps when they’re alongside the quay. They are though in and out fairly quickly – collecting/delivering, but even so one might have to wait 20 mins or more to land Two other landings may be possible should conditions dictate, though the universal opinion is that the main quay at the NE is really the only practical landing, except in emergency. There is a sheltered bay in the SW, where a landing may be forced under the new lighthouse at V246-604, onto a steeply shelving ramp, but which goes nowhere. There is a much better landing onto disused steps at V247-607 in a deep bay, called Blue Cove, on the NW side. It seems these steps are usable only at HW, so some planning is required. This does though entail a very long and awkward carry with full kayaks up steep and uneven steps to find anywhere to leave them.  There are carved steps and a disused pathway up onto the main parts of the island. The present condition of the path is unknown. It is reported that Dúchas intend to improve this path to provide some flexibility. In any event, a waystop is fairly dependable here at HW (HW Cobh   0100). Camping Parties day-tripping should leave the mainland early to maximise their day. Overnighting is strongly discouraged in the high season, April – October. The island is under the joint control of Dúchas and the Commissioners of Irish Lights, from whom permission may be sought to overnight. Apply well in advance. Dúchas are refurbishing the Skellig environment generally, as well as excavating archaeologically. There is nowhere for a tent, and no question of a bivouac anywhere but on the NE pier (the landing spot) itself. The whole question of access policy with regard to the island is very fluid, and nothing should be taken for granted. Arrive well equipped and well victualled, just in case. The reaction of the authorities to your arrival may be influenced by how you, your gear, your attitude and your competence come across.  The island is “open” only between about 1000 and 1600. Outside of these hours you won’t be allowed off the quay, even if you’re tolerated there. Lighthouse The lighthouse was commissioned in 1826 and automated in 1987. The light character is 3 white flashes every 10 seconds. SPA Peregrine, Chough, Storm Petrel, Leach’s Petrel. Birds In the darkest hours of night, the Kittiwake finally go quiet in time for the Manx Shearwater to set up their incomparable cacophony, their hysterical shrieking, their blood curdling Aag     aah       <strong><em>mem</em></strong>    non Aag     aah       <strong><em>mem</em></strong>    non Aag     <strong><em>aah</em></strong>      mem    non Aag     <strong><em>aah</em></strong>      mem    non The birds come ashore only for a couple of hours each night during the breeding season. They even spend their winter out in mid  ocean. They call (to use the most neutral term possible) so that their young can identify them and answer back. Where they breed, they breed in huge colonies. To say there are Puffin on the Great Skellig is an understatement. Nowhere else may the tourist see these crazy birds in Halloween masks in such numbers. They can be seen at close quarters and are easily photographed. Much film is wasted until the visitor slowly realises how really close one may get to these wee creatures. There are also large numbers of Kittiwake and many Storm Petrel.</p>\n","costalZone":"**The South Coast**"}