{"name":"**Hare Island**","nameHtml":"<p><strong>Hare Island</strong></p>\n","safeName":"Hare-Island","coordinates":{"irishGrid":{"sheet":"W","eastings":"007","northings":"277"},"fullIrishGrid":{"sheet":"","eastings":"100700","northings":"27700"},"tmcGrid":{"sheet":"","eastings":"500671.084","northings":"527772.022"},"geo":{"lat":"51.49384331","long":-9.43051535}},"cursor":42182,"description":"<p><strong>Hare Island</strong> W007-277          Sheet 88 This inhabited low-lying island is the biggest in central Roaringwater Bay. It is ‘T’ shaped, with waists both W and S of the junction. The main residential area and fishing port, noted for its quaint bridge, is on the N side of the W waist. The ferry comes in at the extreme E point from Cunnamore Pier at W012-288 on the mainland opposite. Note the steps cut into the solid rock long before the modern pier was constructed. There is a famous restaurant on the island, the waiting list for which is legendary. Noted for its food being obtained on the island, the restaurant is known as ‘Island Cottage’, phone 028 38102. Locals say ”Heir Island” and O’Driscoll’s Island is also used, after a powerful local clan. Landing There are landing points at either side of each waist, the best being on either side of the S waist. Of these, the E side probably just wins out, as the island is generally more attractive at its E end. Generally, the W end is more rugged where landings to camp may perhaps be forced for privacy. The W side of the S waist is a good waystop, as there is fine shelter for picnicking behind a stone wall. There are two islets on the N side, but the sounds are narrow, and the more easterly dries at springs. Tides Tides run strongly around both sides of the island, flooding southeast and ebbing northwest, and achieving 2kn in springs off the western side, downstream of Anima Rock, halfway across to Calf Island. There are two islets on the northern side, but the sounds are narrow and the more easterly dries at springs.</p>\n","costalZone":"**The South Coast**"}