{"name":"**Haulbowline Island**","nameHtml":"<p><strong>Haulbowline Island</strong></p>\n","safeName":"Haulbowline-Island","coordinates":{"irishGrid":{"sheet":"W","eastings":"789","northings":"655"},"fullIrishGrid":{"sheet":"","eastings":"178900","northings":"65500"},"tmcGrid":{"sheet":"","eastings":"578854.912","northings":"565563.563"},"geo":{"lat":"51.84189342","long":-8.30686317}},"cursor":34004,"description":"<p><strong>Haulbowline Island</strong> W789-655          Sheet 87 A small island located just S of Cobh town in Cork Harbour. As the name suggests the island has naval associations and the island is totally dominated by buildings of the Naval Service on its western side, the National Maritime College and University College Cork Marine Research Centre. . Many of these buildings date from the 1700-1800’s when Cork Harbour was a significant port of the British Navy. The oldest buildings face Great Island and a Martello Tower at W789-655 dominates the island’s highest point. The E end is spoilt by the decaying remains of Irish Steel, a major steel manufacturing company which for many years ran its operation here, but became bankrupt a few years ago, and operations ceased 2001. The extreme E side is reclaimed polder on which the slag and spoil from this industrial site was dumped. The Naval Basin is also on the E side of the island and kayakers can enter to view the ships of the Irish Naval Service. Landing Landing is not encouraged but is possible at several slipways on the southern side and in the Naval Basin. Ferries run from Cobh to piers on the northern side for Naval personnel. Small boats should be wary of these when passing along the northern edge. The NW corner of the island juts out into the main shipping channel between Cork city docks and the ferry port at Ringaskiddy, so kayakers rounding this point should be careful at all times. Tides The main river channel from Cork City and the ferry port at Ringaskiddy flows through a narrow passage between Haulbowline and White Point on Great Island just NW. The tidal flow achieves 2<em>kn</em> at this point. The main tidal flow splits at Haulbowline with the much lesser flow running along the southern side of the island. Future Ambitious plans for cleaning up and developing the whole island to a standard to rival Dublin’s Irish Financial Services Centre were announced 2006.  If these come to pass, the island will have apartments, hotels, offices, marinas, everything the well appointred Irish island really needs.</p>\n","costalZone":"**The South Coast**"}