{"name":"**Helvick Island**","nameHtml":"<p><strong>Helvick Island</strong></p>\n","safeName":"Helvick-Island","coordinates":{"irishGrid":{"sheet":"X","eastings":"319","northings":"893"},"fullIrishGrid":{"sheet":"","eastings":"231900","northings":"89300"},"tmcGrid":{"sheet":"","eastings":"631843.624","northings":"589358.205"},"geo":{"lat":"52.05527042","long":-7.53567778}},"cursor":30974,"description":"<p><strong>Helvick Island</strong> X319-893          Sheet 82 Shown on the OS as “The Gainers” which is actually an offshore underwater feature to WNW, this unpretentious group of fragmented rocks is really an extension of Helvick Head itself. It is known locally as “The Island” or even to some as “Goat Island”. The grass-topped inner island is the largest and is reachable on foot at LW springs. The outer rocks are pleasant to explore for their gaps, passages and small cliffs. The inner gap is a welcome escape route on passage and is usually navigable. Land in or about the gap itself onto sheltered rocks. Landing and Embarkation Land in or about the gap itself onto sheltered rocks. Embark from the ‘new’ pier at Helvick at X313-892 – <em>Cé Heilbhic</em> where there is easy parking and launching beside the RNLI station inside the harbour. Toilets and water are available. <strong>Round of Mine Head</strong> Helvick is also the popular launching or landing spot at the E end of the round of Mine Head – <em>Mionn Árd</em>. Launch at the W end of this trip at a sheltered beach, either at Ardmore itself or nearer at X205-798. The journey may be broken at any of the many sandy beaches and coves, subject to conditions on the day. At a small rock Carrignanean X290-834, there is an interesting expedition for anyone who wants to land on the rocks on the S facing side of the small headland. You can scramble up a small gulley and grass slope and visit an important megalithic court cairn tomb. The scrambling takes a bit of effort but is worth the effort. The tomb at Ballynamona is a court cairn and is the only example of its kind in the SE. This type is usually found N of a line between Clew Bay in the W and Dundalk in the E. It would have been constructed by a tribal group and an immense amount of social organisation was required in its building. There would have been many burials in the grave. The bodies were burnt and the cremated bones were placed in the burial chambers, sometimes with pottery, beads, stone, bone, and tools for use in the next life. Ballynamona was excavated in May 1938 by a team lead by T.G.E. Powell, as part of relief of unemployment programme of excavations administered by the OPW in collaboration with the National Museum. Because it had been plundered for fencing material it proved impossible for the excavators to estimate its original size. The chamber deposits had been destroyed by treasure seekers. However, some small fragments of highly decorated pottery were found, as were numerous natural flint flakes, some of which showed traces of human working. A small stone disc was also found. It is made of a fine-grained piece of Old Red sandstone. Similar larger discs are known from gallery graves in Brittany, Scotland, Wales and Co. Wicklow. We do not know the beliefs of the builders of the tomb but there is evidence that they were sun worshippers, at least in some parts of Ireland. But whatever their beliefs they were compelling, as similar structures are found all over Europe and in part of Africa and Asia. Although the Ballynamona Court Cairn is neither spectacular nor large its importance cannot be overlooked. It is known to date from 2000 B.C. during the late Neolithic or early Bronze Age. It is clear evidence of the early settlement of Old Parish by a developed, agricultural society. Other evidence of settlement in Co. Waterford from this period are the nearest known megalithic tombs at Gaulstown, Mattewstown and Ballynageeragh in or around the Tramore area, and an important find of an uncommonly fine, polished stone implement at Aglish, Co. Waterford, presently in the National Museum. While this grave was still in use the Late Stone Age was drawing to a close. The Early Bronze Age, in which implements of bronze and copper were manufactured, saw the arrival in Ireland of prospectors and metal workers, who found Co. Waterford rich in the necessary metal deposits. At Bonmahon, copper was mined and there is some evidence that a foundry or factory of bronze implements existed on the edge of Knockmon bog, west of Dungarvan. Mine Head is the highest lighthouse in Ireland, but the kayak on passage will not see it from immediately below because it is set back from the cliff edge. The only escape on the 15<em>km</em> passage is at Ballymacart Cove at X253-810, perhaps too close to the Ardmore end to be practical. Too close maybe to the other end is a beautiful beach known locally as <em>Faill na Staicín</em> at X298-877. <strong>County Cork</strong> <strong>Tidal Overview – Cork SE</strong> Tides are generally weak between Cork Harbour in the W and Knockadoon Head, 30<em>km</em> to the ENE. However, there are significant races off the headlands and in the sounds between the islands (Ballycotton Sound and Capel Sound), where 2<em>kn</em> is achieved. Slack water is thought by local paddlers to be at much the same time as LW/HW Cork. In Youghal Bay, southerly winds raise a heavy sea, and the tidal streams are rotary and very complex, running strongly over the bar, which is in mid  bay directly S of the river entrance, so caution should be exercised.</p>\n","costalZone":"**The South Coast**"}