{"name":"**Hook Penninsula**","nameHtml":"<p><strong>Hook Penninsula</strong></p>\n","safeName":"Hook-Penninsula","coordinates":{"irishGrid":{"sheet":"X","eastings":"733","northings":"973"},"fullIrishGrid":{"sheet":"","eastings":"273300","northings":"97300"},"tmcGrid":{"sheet":"","eastings":"673234.602","northings":"597356.399"},"geo":{"lat":"52.12322973","long":-6.9305066}},"cursor":26535,"description":"<p><strong>Hook Penninsula</strong> X733-973          Sheet 76 Hook Head is a popular kayaking and scuba diving area based on the main town Fethard.  A very attractive area, there is almost always sheltered sea-going hereabouts, almost regardless of wind direction.  Beloved of divers, there is always calm water somewhere for the training of beginners. Out at the Head there are arches and blowholes, caves and wrecks, and clear shallow water mostly.  The extensive sand beaches at Duncannon and Fethard contrast with the rocky cliffs by the Head itself.  Across Waterford Harbour lies the beautiful fishing and tourist village of Dunmore East, to which excursions may be made, landing at the pier, which was the first ever built by Nimmo. Early History The early history of the Hook mirrors the early history of Ireland generally.  The rocks locally are all sedimentary, limestones from 510,000,000 BP at the tip, then sandstones mudstones and siltstones progressively northwards.  Below Wood Village one can see the four post-ice age strata, a wave cut platform of former shoreline cut in folded siltstones, fossil raised beach, overlying mass of earth called “head”, and on top material called “till”, debris deposited by melting ice sheets 10,000 BP.  Ptolemy’s map of Ireland 100+AD recognised the Barrow River (called “<em>Birgos</em>”) and appears to recognise Baginbun Head as a promontory fort known to the locals as <em>Dún Domhnaill</em>.  There were 45 ring forts once, built 600 – 900 AD, with 13 surviving.  These are now accepted as “one off” farmsteads and not specifically military.  Almost all placenames are Viking.  Bannow Island is where the Normans landed in 1169, invited in by Dermot McMurrough, the ultimate traitor.  In quick time they captured Wexford town.  In 1170 Richard leGros with +100 men landed at Baginbun Head, on its sheltered beach, with its defendable promontory, which he then defended successfully in battle against the men of Waterford.  Shortly after, Richard deClare (Strongbow) landed at Passage East and together they beat the depleted Waterford defences and took the town.  All this is considered good news by modern interpretation, but then the English followed in 1172 (not so good).  The lighthouse on the Head itself was the first ever in Ireland, possibly in these islands, and it is the only Irish secular mediaeval building still serving its original function.  Guided tours are available all summer.  In 1,400+ Slade Castle was constructed. Modern History The story of Duncannon Fort reflects more recent Irish history.  When Irish Ireland was soundly defeated at Kinsale in 1603, the island of Ireland was severely under-populated at about 750,000.  The “settlement” of Ireland then began, and the island became subject to immigration fromEngland and Scotland.  Protestant / Catholic tensions across Europe were thus imported onto the island of Ireland.  In 1641 there was civil war in England between Parliament and King, and revolution and slaughter was everywhere, including in Ireland, including the Hook.  Scots and Northern Irish Protestants (“Royalists”) backed the king, while the indigenous Irish, as well as those Normans and <em>ye olde Englishe</em> who had gone native over the centuries they had been here (“Confederates”) saw the chance for independence.  Duncannon Fort played a huge role locally, and its Royalists were besieged time and again.  In 1644 it even changed sides – in English terms – to Parliamentarian, but this meant nothing from the local perspective.  In 1645 it was forced to surrender to the Confederates.  But then Cromwell arrived in Ireland in 1649 and put manners on them all.  The “Plantation of Ireland”, as Irish history terms the settlement of its land by these outsiders, then began in earnest.  The Planters were received with the affection and enthusiasm with which aboriginals worldwide traditionally always have and always will greet similar expansionary ambitions. After the battle of the Boyne in1691, both combatant kings departed Ireland from Duncannon.  James skulked, but William went in style.  The Hook wasn’t centrally involved in 1798, but nevertheless the worst anti-Protestant atrocity of the entire affair was perpetrated at Scullabulogue near Tintern Abbey when 100 elderly prisoners were burned in a barn.  Fethard Dock was the scene of the only naval action of that rebellion, suffering the sinking of its ships and the destruction of its one warehouse.  Duncannon Fort became less relevant by the century, and became finally and formally non-military in 1986.  It is now a museum, art gallery, and restaurant, all well repaying a visit. Tides locally are complicated Local HW / LW at Dunmore East and Slade and the outer parts of the estuary are at Cobh +0015, though obviously this is progressively later the further up.  In fact HW is Cobh +0100 at Waterford itself, is Cobh +0040 at New Ross, and Cobh +0110 at St. Mullins S724-385, which is about as far up as the salt water goes and the limit of navigability in the river Barrow for sea-going craft. The E side of the immediate Hook area has no significant tidal movement, though there seems always to be clapotis off Baginbun Head S803-030. In the wide S parts of the estuary of Waterford Harbour on the W side of the Hook:</p>\n<ul>\n<li>The flood in the main channel of the wide part of the Harbour runs from Cobh -0425 to +0045 and ebbs from Cobh +0045 to -0425.It generally achieves 0.75 on the ingoing flood and 1.5kn on the outgoing ebb.  The ebb in southerlies therefore gives highly sporting deep water surfing, particularly from Credaun Head S718-036 up to Duncannon, but mind the shipping.  These are busy waters.</li>\n<li>The ingoing flood, as far as Credaun Head, is strong along the W side, during which there may be slack or even a weak outgoing flow on the E side.</li>\n<li>Squeezing past Credaun Head itself, the floood reaches 2.5kn or 3.0kn.</li>\n<li>The outgoing ebb, between Duncannon and Hook Head, sets mainly along the E side, and gets very strong along the W shore of the Hook.</li>\n<li>The tail end of the outgoing ebb eddies at Credaun Head, as far as Portally Head 6<em>km</em> SW.</li>\n</ul>\n<p>Further up the rivers, the flood and ebb start a little later.  At St. Mullins the ebb starts at Cobh +0200.  For trip planning it is important to gain every last advantage of the tidal flow, especially in wintertime when daylight is limited. Outside, beyond the mouth of the estuary, the main E going stream floods from Cobh -0120 to +0450.  Close inshore the E going flood and W going ebb start an hour or so earlier at about HW Cobh -0200 and +0400. At Hook Head itself, the “Tower Race” sets up on the ebb.  It starts at the point of the headland and extends seaward for 2 / 3<em>km</em>.  Its workings are very complicated, perhaps especially when the estuary is emptying into an oncoming ebb, with wind over.  The combined tides set up a rotary eddy system, so the resulting direction of the run off at the Head varies enormously.  These very powerful hydraulics should be avoided by small boats in adverse conditions. <em>Oileáin 2013</em> sets it out in tabular format : <strong>Waterford Harbour</strong></p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Off Waterford Harbour entrance</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">1:20 before Cobh HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">4:50 after Cobh HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>At the Head itself, the west-going stream starts an hour earlier at 3:50 after Cobh HW. <strong>The Tower Race</strong> The Tower Race starts just south of the headland and extends westward for 2 / 3km on the ebb.  Its workings are very complicated, perhaps especially when the estuary is emptying into an oncoming ebb, with wind over.  The combined tides set up a rotary eddy system, so the resulting direction of the run off at the Head varies enormously.  These very powerful hydraulics should be avoided by small boats in adverse conditions.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"270\"><strong>Tower Race (probable times)</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">Start</td>\n\n<td width=\"192\">4:20 after Cobh HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">Finish</td>\n\n<td width=\"192\">4:55 before next Cobh HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>In the wide southern parts of the estuary of Waterford Harbour on the western side of the Hook:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Off Creadan Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"66\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"170\">4:25 before Cobh HW</td>\n\n<td width=\"66\">0.75kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"170\">0:45 after Cobh HW</td>\n\n<td width=\"66\">1.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Camping There is an official legal campsite at Ocean Island Caravan &amp; Camping S790-058, about 400m N of Fethard village.  It welcomes visitors, but is primarily family based.  Campervanning is popular down by the Hook itself, and <em>camping sauvage</em> is possible on the E and W sides of the Head, discreetly.  There are also quiet but exposed spots above Baginbun Beach S800-033 and above Petit’s Bay S795-031. <strong>Hook Embarkation Points</strong> <strong>Grange</strong></p>\n","costalZone":"**The South Coast**"}