{"name":"**Illaunimmil**","nameHtml":"<p><strong>Illaunimmil</strong></p>\n","safeName":"Illaunimmil","coordinates":{"irishGrid":{"sheet":"Q","eastings":"605","northings":"221"},"fullIrishGrid":{"sheet":"","eastings":"60500","northings":"122100"},"tmcGrid":{"sheet":"","eastings":"460480.716","northings":"622151.711"},"geo":{"lat":"52.33321706","long":-10.04720841}},"cursor":70391,"description":"<p><strong>Illaunimmil</strong> Q605-221          Sheet 71 Second largest member of the group, 1.5<em>km</em> WNW of Illauntannig. The island is large and quite attractive and has a number of interesting features to explore.  The island is flat and grassy on top and is grazed by sheep periodically.  There are cliffs all around.  A holding pen is located at the E end. There are great views all round both of the island group and the mountains of the Dingle peninsula. There are two fine examples of caves with blow holes on the S side, whose exit points on the island top may catch the unwary walker. The cave foot is a long way down in both examples.  Landings onto their attendant storm beaches were not possible in April 2010 but would merit exploration when conditions allow. There are two sea arches located at the E end of the island. The more N one, just on the sheltered (E facing) side of the NE tip, hosts a storm beach, at a cave, which is really a huge collapsed blowhole.  Many Rock Dove nest in the arch overhead.  A stake with tethered rope for landings (from larger boats) is located here. The more SE one leads into an inner lagoon and cave area that is not accessible at LWS, but may be so at other stages of the tide. It is very picturesque. Landing There is a good landing available on the N side of the SW corner of Illaunimmil where a small NE facing bay forms at times of LWS between the island and an outlying islet – Listooskert  Q602-221.  The landing is onto a storm beach.  The outying islet itself has an attractive layered geology. The passage that separates the islet from Illaunimmil is not navigable at LWS but almost certainly so at other stages of the tide, and the landing is always somewhat protected given reasonable weather conditions. The island summit can be reached by a number of gullies or rock shelves that back the storm beach. The island is grazed by Brent Geese and possibly Barnacle Geese over the winter months.  Peregrine, Raven, Rock Dove, Shag and Black Guillemot were present in April 2010.</p>\n","costalZone":"**The South Coast**"}