{"name":"**Illaunglass (West)**","nameHtml":"<p><strong>Illaunglass (West)</strong></p>\n","safeName":"Illaunglass-(West)","coordinates":{"irishGrid":{"sheet":"V","eastings":"802","northings":"358"},"fullIrishGrid":{"sheet":"","eastings":"80200","northings":"35800"},"tmcGrid":{"sheet":"","eastings":"480175.593","northings":"535870.182"},"geo":{"lat":"51.56263984","long":-9.72830922}},"cursor":45637,"description":"<p><strong>Illaunglass (West)</strong> V802-358          Sheet 88 Small craggy island located just off beautiful newly refurbished Dooneen Pier. There is no slipway at the pier but launching is possible off either of two sets of steps. An easier launching site is at the nearby quay and slipway at Kilcrohane V825-371. The island is best accessed at the NW corner onto steep rocky foreshore. The island is heavily vegetated and quite sheer on all sides and holds little interest for kayakers. A narrow passage separates the island from the mainland. The coastal scenery is quite attractive in the locality. No camping and no water. <strong>Bantry Bay</strong> It is a feature of many of the smaller inner-Bantry Bay islands that surround Whiddy is that landing often isn’t difficult, but further progress inland can be very much so, mostly because of wraparound raised mud cliffs, but also for sheer overgrowth, and often for both. Embarkation The handiest put in point for Whiddy and its satellites is undoubtedly at the slipway V983-482, on the road W out of Bantry town, just by the graveyard.  There is good parking and easy launching at a slipway and gravel beach.  Note in particular that the ferry pier in Bantry 1<em>km</em> E can be very busy, though it does have toilets and water. History of the area A major pilchard fishery flourished until late in the 1700s. It is estimated that over 3,000 were engaged in that industry at its height. Just as when the Donegal herring fishery collapsed suddenly at much the same time, the devastation to the local economy was horrendous.  Unlike pilchards, most other fishing is seasonal, and relatively small time. The major modern historical event in the history of Bantry was the arrival in the bay in 1798 of a French invasion fleet of 15,000 men organised by Wolfe Tone.  However, like a previous French effort a century earlier, this invasion took place in December, which was bad timing. The weather turned into a full blown storm from the NE. Some of the French vessels managed to enter the bay and anchor but the weather deteriorated further. The French cut their anchor cables and headed to sea. Had their invasion succeeded, maybe Corkmen might be speaking French to this day? The redoubt at Reenavanny on Whiddy Island was built 1806/1807 for 100 – 150 men and 8 – 12 guns, to oppose a Napoleonic threat.  That Napoleon’s naval capabilities had been utterly destroyed at Traflgar in 1805 didn’t stop the work.  No gun was ever fired in anger from any Irish Martello tower or battery of this kind built at that time for that purpose. From then on Bantry Bay was the main western base for the British Royal Navy, never more so than during the years leading up to the First World War. During the war it was not unusual to see up to forty British warships at anchor in the Bay. No wonder there are fifty two pubs in Bantry. In September 1918 the US Navy Air Wing established a seaplane base here, at the WSW end of Whiddy Island and it patrolled the area around Fastnet. Five planes were based in Whiddy. The first sinking of a German submarine by an aircraft happened off the mouth of Bantry Bay. With the end of the war the station closed in January 1919. In 1938 the ports of Ireland including Swilly, Cobh, Berehaven and Bantry Bay were handed back to the State. The sight of dozens of warships in the bay ceased and the economy of the towns and villages around the bay spiralled downwards. The Whiddy Island Disaster Whiddy is the site of a large oil terminal constructed in the WSW in 1967 by <a href=\"http://en.wikipedia.org/wiki/Gulf_Oil\">Gulf Oil</a>.  On Monday, <a href=\"http://en.wikipedia.org/wiki/January_8\">January 8</a>, <a href=\"http://en.wikipedia.org/wiki/1979\">1979</a> a French oil tanker, the <em>Betelgeuse</em>, was unloading a cargo of <a href=\"http://en.wikipedia.org/wiki/Crude_oil\">crude oil</a> at the oil terminal when it exploded. The blast and subsequent fire killed 50 people. The facility was subsequently transferred to the Irish government in 1986 after which it has since been used to hold the Irish strategic oil reserve. During the 1960s, developments in the pattern of oil transportation indicated that it would soon become most economic to move oil between the Middle East and Europe using ultra large crude carrier vessels (ULCCVs). These vessels were so large that they would not be able to enter most of the older ports on the Atlantic Ocean, North Sea or English Channel coasts.  Accordingly, it was judged appropriate to build a new oil terminal in Europe capable of handling the largest vessels that were planned. The intention was that oil coming from the Middle East would be off-loaded at this terminal and then stored for transshipment to European refineries using smaller vessels. The closure of the Suez Canal in 1967 as a result of the Six-Day War reinforced the economic viability of this scheme. Oil shipments had to come round the Cape of Good Hope, thus making redundant the vessel size constraints previously imposed by the canal. In 1966, Gulf Oil identified Whiddy Island as being the most suitable site in Europe for the new terminal, because it offered a long, sheltered deep-water anchorage, well away from any major population centres and shipping lanes. The terminal was operational by 1969. The offshore facility was comprised of an island type berth (known colloquially as “the jetty”) 488m in length, approximately 396m from the shore of the island. The jetty was capable of accommodating vessels of up to 500,000 metric tons of deadweight (DWT), although no such vessels existed at that time. The terminal was very successful for the first five years of operation, but then events began to move against it. The Suez Canal reopened and the economics of ULCCVs began to appear less satisfactory. The late 1970s saw a levelling-off in demand for oil as the result of both economic recession and a rise in the price of oil. All these circumstances caused a fall in the utilisation of the terminal to a level below that which had been planned for. Thus, by the late 1970s, Gulf Oil was struggling to maintain the viability of the terminal. The company had been forced to undertake a number of cost saving measures. Late on 6 January 1979, the <em>Betelgeuse</em> commenced discharging its 114,000 tonnes of crude oil, which was expected to take about 36 hours. Early on Monday, 8 January, a rumbling or cracking noise was heard from the vessel, followed shortly by a huge explosion within its hull. The force of the explosion was seen to blow men from the jetty into the sea. Local residents reported seeing the <em>Betelgeuse</em> engulfed in a ball of fire a few moments later. A series of further explosions followed, breaking the vessel in half. Much of the oil cargo still on board ignited and this generated temperatures estimated to exceed 1,000 °C. The concrete jetty crumbled and firefighters were unable to get near the vessel. The firefighters concentrated their efforts on preventing the fire from spreading to the tanks of the storage farm and on containing the oil spillage. Local families living on the island fled for their lives. The <em>Betelgeuse</em> sank at her moorings in 30m of water, which largely extinguished the main body of the fire. In spite of this, rescue workers were not able to approach the wreck (some of which was still above water) for two weeks due to clouds of toxic and inflammable gas surrounding it. After two weeks, it was possible to start recovering bodies from the wreck and pumping off the remains of the oil cargo that was still on board. The Irish government appointed a tribunal to investigate the incident, which took a year to hear evidence and prepare a 480 page report. That seemed extravagant at the time, but more recent Irish legal experiences make it seem a model of efficiency.  The report indicated three main factors that had contributed to the incident:</p>\n<ul>\n<li>The poor condition of the <em>Betelgeuse</em> which had been worked hard and was at the end of its service life,</li>\n<li>Incorrect unloading sequences and ballasting, and</li>\n<li>Inadequate and poorly maintained fire fighting and rescue systems both on the vessel and on the jetty.</li>\n</ul>\n<p>All the crew on board the ship at the time of the incident (41 in total) are believed to have died, although not all the bodies were found. In addition, one visitor to the ship (an officer’s wife) and eight terminal workers were killed. During the salvage operation, the life of a diver was lost. In 1986, Gulf surrendered its lease on the site to the Irish government.  The government used the terminal to hold its strategic oil reserve. Initially, oil movement to and from the terminal was carried out by road. In 1990, at the time of the first Gulf War, an improvised repair was carried out to the jetty to allow an oil tanker to offload at the terminal on a one-off basis. In 1996 an unloading buoy was installed and this has been used since that time. A memorial sculpture, incorporating the ship’s bell which was recovered from the wreck, has been erected in the hillside graveyard close by the embarkation point, overlooking the harbour. The bodies of two unidentified casualties from the incident are interred nearby.</p>\n","costalZone":"**The South Coast**"}