{"name":"**Inishnabro – _Inis na Bró_**","nameHtml":"<p><strong>Inishnabro – <em>Inis na Bró</em></strong></p>\n","safeName":"Inishnabro-–-_Inis-na-Bró_","coordinates":{"irishGrid":{"sheet":"V","eastings":"212","northings":"925"},"fullIrishGrid":{"sheet":"","eastings":"21200","northings":"92500"},"tmcGrid":{"sheet":"","eastings":"421189.454","northings":"592557.971"},"geo":{"lat":"52.0560954","long":-10.60755464}},"cursor":67255,"description":"<p><strong>Inishnabro – <em>Inis na Bró</em></strong> V212-925          Sheet 70 Landing Landing is midway on the south-eastern side, in a tiny cove. The entrance to the cove is under a tall narrow arch, into a sheltered pool, open to the sky. The landing is onto boulders, and very much subject to surge and scend, especially in SW winds. The cove runs SW/NE and is unmissable when travelling from the SW, but is hard to see going the other way. The cove is distinctly the tallest along this side, opposite Inishvickillane – <em>Inis Mhicileáin.</em> It is situated just E of the only shallow bay along. Here there are the remains of a stone wall overhead, just visible when close. Scramble up the gully behind. The tall arched entrance is narrow but the pool is wider. Kayakers with laden boats have found this landing very difficult with any swell running. Inishvickillane – <em>Inis Mhicileáin,</em> is more reliable altogether for those in the outer regions of the Blaskets. The island looks like it is covered with heather, but this is actually solid Sea Pink on the S side. There are magnificent cliffs on the N. The island is distinctly saddled when seen from N or S. There is a fantastic array of buttresses on the E end. The cliffs of the N side are huge and impressive. There was always a small community living here and four people are recorded as having lived here in 1851 after the great famine.  Certainly there are the remains of a promontory fort at the W end, a clochan, and evidence of cultivation.  One version is that the island was intensively cultivated with corn, which was even ground on the island.  Another is that Inishnabro was known for its booleying, the summer grazing of cattle from the Great Island.  Booleying certainly was a common practice at the time. Tides A tide race ebbs southeast at the northeastern corner. Tides run strongly in the sound between Inishnabro and Great Blasket and the wind can be funnelled. The flow in the sound between Inishnabro and Inishvickillane always flows weakly westwards, being an eddy of the main flow north/south in either direction. Therefore, there is often a lump in the narrow western end of the sound where tides collide.</p>\n","costalZone":"**The South Coast**"}