{"name":"**Inishfarnard**","nameHtml":"<p><strong>Inishfarnard</strong></p>\n","safeName":"Inishfarnard","coordinates":{"irishGrid":{"sheet":"V","eastings":"600","northings":"527"},"fullIrishGrid":{"sheet":"","eastings":"60000","northings":"52700"},"tmcGrid":{"sheet":"","eastings":"459980.272","northings":"552766.445"},"geo":{"lat":"51.70978491","long":-10.02617437}},"cursor":54132,"description":"<p><strong>Inishfarnard</strong> V600-527          Sheet 84 Splendid big lump of a formerly inhabited island, with a fish farm off its SE side. The whole island is attractive to visit, with a distinct ridge, sheep, and abandoned houses and fields. There are many nice cliffs on the N side. The cave/arch in the small bay at V599-526 is worth a visit especially in good evening light, as sunshine lights up the WNW orientated entrance. The entrance arch at HW is a lovely feature, but a committing passage, being very prone to swell. It leads into a long narrow cavern, which then opens into a blow hole.  There is just about enough room to turn a kayak at HW.  This feature when viewed from above seems nearly to bisect the SW facing tip of Inishfarnard from the main body of the island, – “Inishfarnard Beg” in the making ? Landing and Camping</p>\n<ul>\n<li>The main landing for boats is not so convenient for kayaks, as it is a deep-water landing. It is in a cove inside the fish farm on the SE side, at V609-529.</li>\n<li>Better altogether for kayaks is onto a choice of storm beaches, the best of which is at V600-527, in a WSW facing cut on the N side, looking onto Bridaun. There is splendid camping 100m from the beach. Good fishing hereabouts also.</li>\n<li>Landing is possible at various tide levels on the ENE facing side of the waist at V602-526. This is however less convenient, as large blocks make life awkward, though not at HW.</li>\n<li>Another recommended spot for landing is near the E end of the N side in a NW facing cut, onto a storm beach at V607-531, where excellent camping is available after a small scramble.</li>\n</ul>\n<p>Water There must have been a good supply of water at one time. The population was once 24. A search for water on Inishfarnard found quite a bit of seepage water accumulating at the cliff edge directly S of the second most W ruined house. Certainly there is enough for determined campers prepared to dig out a pool. A newly constructed altar, at least that is what its purpose seems, is now in place amongst the houses in the W village. It is small and discrete. It may be Islamic.   It may be linked to a ceremonial plaque outlining the family history of some of the previous islanders and their links to faraway Butte, Montana. The plaque is fixed to large boulder close to most E houses on way up from main landing. Shags, Raven, Chough and Snipe all breed.</p>\n","costalZone":"**The South Coast**"}