{"name":"**Inishvickillane – _Inis Mhicileáin_**","nameHtml":"<p><strong>Inishvickillane – <em>Inis Mhicileáin</em></strong></p>\n","safeName":"Inishvickillane-–-_Inis-Mhicileáin_","coordinates":{"irishGrid":{"sheet":"V","eastings":"207","northings":"916"},"fullIrishGrid":{"sheet":"","eastings":"20700","northings":"91600"},"tmcGrid":{"sheet":"","eastings":"420689.564","northings":"591658.153"},"geo":{"lat":"52.04785402","long":-10.61436427}},"cursor":67632,"description":"<p><strong>Inishvickillane – <em>Inis Mhicileáin</em></strong> V207-916          Sheet 70 The most southerly of the group, this is a very attractive island. On a high plateau lie a holiday home, outhouses, a herd of purebred native Irish Red Deer, and a helipad. The island was owned until June 2006 by a colourful, cultured, popular yet controversial Dublin character. He merited police protection as a retired public figure and valued his privacy. It remains to be seen what access issues will arise in his wake.  The house is designed to fit discreetly into the hillside, and is built of local stone and timber. The whole is an example of how these things might be done right. When the owner is present, presumably mostly in August, kayakers should keep below the HW mark. Below the house lies a cove at the NE corner of the island. Once there was a teleferique system here for uploading material. It is no longer operational, and has been left as an unsightly mess. Landing The landing is on the western end of the N side, opposite Inishnabro, just inside the narrows, onto a sheltered semicircular stony beach. This is the most dependable of all outlying landings. The always W-making current in the channel is weak, so the landing is only out of bounds in the severest of relatively rare easterlies. There is a retractable pontoon-landing device at steps on the point just N of the landing beach. The now disused path up from the beach is getting overgrown since the pontoon was installed at the nearby point, but is still manageable. The island is much talked of in ‘Twenty Years A-Growing’ as a place inhabited by fairies. The outhouse is where O’Sullivan had his rabbits stolen in the dead of night in November 1914 by passing sailors, who left a tin of tobacco in payment. Paddlers may find ‘Mickey the Pillar’ at the western end of the S side at V207-908, and Mickey can also be seen below the ‘Hollow of the Eagles’, the flat stretch of the plateau to the SW. Mickey is a pillar of rock, the top of which looks like a man sitting wearing a wide brimmed hat. Moon Cave is nearby. Circumnavigation is recommended for the spectacular rock scenery. There was a small community always throughout the 19<sup>th</sup> century, of up to eight persons.</p>\n","costalZone":"**The South Coast**"}