{"name":"**Kedge Island**","nameHtml":"<p><strong>Kedge Island</strong></p>\n","safeName":"Kedge-Island","coordinates":{"irishGrid":{"sheet":"W","eastings":"066","northings":"243"},"fullIrishGrid":{"sheet":"","eastings":"106600","northings":"24300"},"tmcGrid":{"sheet":"","eastings":"506569.793","northings":"524372.779"},"geo":{"lat":"51.4642985","long":-9.34469048}},"cursor":38351,"description":"<p><strong>Kedge Island</strong> W066-243          Sheet 88 A rugged island lying about 3<em>km</em> E of the southern entrance to Baltimore Harbour, there is no easy landing, but there is a sheltered (from westerlies) inlet in the NW with reported rich flora and fauna (seals).  The arch at the SE doesn’t go.  Roost for many seagulls and seabirds.  Mighty cliffs all round. The arch in the mainland headland immediately N does go for the brave in good conditions.  The narrow sound between island and mainland has a couple of rocks mid-channel and the flow speeds up through the gaps, cutting rough with wind over, so is is worth watching. Launch from nearest point Trafraska W054-254, a sheltered inlet E of Baltimore and 1.5km NW. <strong>West Cork</strong> <strong>Roaringwater Bay to the Beara Peninsula</strong> <strong>County Cork</strong> <strong>Roaringwater Bay</strong> Roaringwater Bay, in the extreme SW of Ireland, is excessively named. In fact, its many islands guarantee sheltered water in almost all conditions. Its user  friendly aspect makes it a most popular area for watersports and boating. The area generally tends to be very popular in summer, because there is always somewhere to hide in Roaringwater Bay. From Sherkin and Cape Clear Islands in the S to Mizen Head in the W, it is more accurately called Long Island Bay. Roaringwater Bay proper is tucked into the sheltered NE corner. A feature of virtually all the islands, caused by their sandstone geology, is ‘waisting’. Waists are narrow points where the islands are almost cut in two, and sometimes three, by the sea. Indeed, they may soon be. These waists are heavily relied on in the text for locational descriptions. -Beaches or landing points, and other places, are often located by reference to the waist. This waisting is not always obvious from a casual glance at the half  inch OS map, but the modern OS 1:50,000, sheet 88 does much better. Embarkation The many islands of the bay are reached from the pretty towns of Baltimore to the SE or Schull to the NW. Each town boasts every possible convenience to the holidaymaker. Here, as elsewhere in the region, the standard of pub and restaurant food is superb. Hostels and accommodation of all kind abound. Vehicles may conveniently be left in either location. Both towns are famous for their sailing schools, Baltimore having the edge perhaps. Baltimore has a regular year-round ferry to Sherkin and Cape Clear Islands. There is a ferry to Cape Clear Island in summer from Schull. Technically the nearest launch for Cape Clear is Colla Pier V917-293, a pleasant spot, a refuge in campervannable terms from Schull. Tides The big picture is that the flood flows E from Mizen Head through the islands of the bay, and outside Cape Clear Island. Among the islands of the bay, the flood generally turns S and then E where circumstances suggest. In this way, the flood runs E along both the N and S sides of the islands, and generally S through sounds that run N/S. The reverse is also true, the ebb flowing generally W and N through the sounds. This is particularly true of Gascanane Sound, between Sherkin and Cape Clear. Important and predictable exceptions occur. The flood streams N through the sound between Long Island and Castle Island and ebbs S. This allows the large enclosed water area of Schull Harbour to the N to be filled and emptied. In the same way, the large enclosed water area of Baltimore Harbour fills from both sides, N and S. In the sound between Sherkin and the mainland, the flood is N and the ebb is S.</p>\n","costalZone":"**The South Coast**"}