{"name":"**Little Saltee Island**","nameHtml":"<p><strong>Little Saltee Island</strong></p>\n","safeName":"Little-Saltee-Island","coordinates":{"irishGrid":{"sheet":"X","eastings":"966","northings":"996"},"fullIrishGrid":{"sheet":"","eastings":"296600","northings":"99600"},"tmcGrid":{"sheet":"","eastings":"696529.441","northings":"599655.89"},"geo":{"lat":"52.14031776","long":-6.58976231}},"cursor":25766,"description":"<p><strong>Little Saltee Island</strong> X966-996          Sheet 77 This island is less frequented than its better-known and more interesting neighbour. Historically, 3 people or so lived on Little Saltee until the mid-19th Century, when rumour insists it was connected to the mainland. Little Saltee was farmed until World War 2. The farm speciality was early-season new potatoes, but corn and other vegetables were also grown. 12 people were needed at harvest time. A thresher was brought over, in parts, in small boats. The island was abandoned and overgrown until recently. Since 1999, the owners now farm pedigree Kerry cows, fallow deer,  and since 2003 Soay sheep, from the Scottish island of same name, just S of Skye, well known to climbers. The main house and some of its outbuildings have been made habitable. The courtyard has been tidied. There is a fine ruin of a two-storey barn and interesting remains of corn stands in the yard immediately W of the main building. There are the remains of an old well within the courtyard but it did not hold water in April 2003 and appeared long disused. Landing A flagpole above the main landing on the NW side at X966-996 presumably indicates when the family is in residence. Landing is possible among boulders below the house, normally reasonably sheltered by offshore boulders and rocks. One may also land elsewhere less dependably. Try the SW side on any of three storm beaches facing the Great Saltee. These are very much easier on lower tide levels. Camping The most suitable level ground for camping is in the area just W of the main house. Bracken and bluebells dominate the island and there are few grassy areas along the flatter western side. The vegetation is broken, lumpy and heavily grazed. The most pleasant areas are on the southern edge overlooking the storm beaches and the sound to Great Saltee. Do ask permission if the owners are in residence.</p>\n","costalZone":"**The South Coast**"}