{"name":"**Nohoval Cove**","nameHtml":"<p><strong>Nohoval Cove</strong></p>\n","safeName":"Nohoval-Cove","coordinates":{"irishGrid":{"sheet":"W","eastings":"733","northings":"513,"},"fullIrishGrid":{"sheet":"","eastings":"173300","northings":"51300"},"tmcGrid":{"sheet":"","eastings":"573256.062","northings":"551366.701"},"geo":{"lat":"51.71403617","long":-8.38702007}},"cursor":35261,"description":"<p><strong>Nohoval Cove</strong> W733-513, 4<em>km</em> WSW provides some interesting paddling and rock hopping. There is a rudimentary slip at the back of the bay with a surge across it at HW, though usually well sheltered by off lying rocks. There some caves and stacks with spectacular cliffs. There are no camping signs on the ruins to the W side of the slip, though camping may be possible in the cliffs high up on the E side of the landing. Parking is along the side of the access road. <strong>Oyster Haven</strong> <strong>– Ballinclashnet Creek.</strong>  4.5km WSW, embark from a beach and pier W 694-490 at the end of the road on the E side of the E branch of Oyster Haven, outside the coastguard station.  Alternatively launch from a sheltered beach W697-501 beside an Oyster Haven Adventure Centre.  Both spots are inside obvious mooring buoys. There is adequate parking at both spots. Further N, the road runs parallel to Ballinclashnet Creek and landing is possible on some of the shingle bars that stretch out perpendicular to the road. It is possible to navigate to within 300<em>m</em> of Ballinclashnet village at HW. There are no landings or access to the shore from the W side of Ballinclashnet Creek. <strong>Oyster Haven</strong> <strong>– Murray’s Creek.</strong> It is possible to navigate Murray’s Creek, the W branch of Oyster Haven, to Belgooley, though there is no easy access until you are N of the road bridge at W663-522. The best worst access may be had opposite Belgooley GAA pitch. The E bank will provide the most direct and quickest access, but there is some vegetation.</p>\n","costalZone":"**The South Coast**"}