{"name":"**Old Head of Kinsale**","nameHtml":"<p><strong>Old Head of Kinsale</strong></p>\n","safeName":"Old-Head-of-Kinsale","coordinates":{"irishGrid":{"sheet":"W","eastings":"625","northings":"406"},"fullIrishGrid":{"sheet":"","eastings":"162500","northings":"40600"},"tmcGrid":{"sheet":"","eastings":"562458.278","northings":"540669.092"},"geo":{"lat":"51.61725587","long":-8.54212284}},"cursor":36201,"description":"<p><strong>Old Head of Kinsale</strong> W625-406          Sheet 87 This mighty headland extends 7<em>km</em> out to sea, W of Cork Harbour. Magnificent and rocky, it boasts a golf course over almost the entirety of its outer parts. This is said to be among the finest golf courses in the world.  Public access through the golf course and the lighthouse at the tip was disputed. It was claimed, unsuccessfully, that a traditional right of way existed historically. There was a rock-climbing crag at the head itself, now therefore disused. The grid reference given is for a narrow neck halfway out, to the E and W of which are Holeopen Bay, E and W respectively. Through this narrow section, S of which lies the golf course, run three caves. One (narrow but deep) is kayak friendly and should in most conditions allow passing kayaks to avoid the rounding of the headland itself. One (broad but bouldery) might also do so at HW. A third allowed researchers a glimpse of light and might require cool nerves. The caves are immediately inside a prominent sea stack on the W side, and under the golf course flagpoles on the E side. Cliffy and gorgeous, do not readily pass by without a visit. Embarkation Put in on the E side at either the muddy beach just NW of a pier close to the Speckled Door pub at W619-434, or,  which may offer a quieter alternative, at a small beach W620-438 about 400<em>m</em> W of Blackrock point. The beach is well protected by offlying skerries and has a shallow slope. On the W side, Whitestrand may offer a slightly calmer launching  / landing place than Garretstown beach. It is a sandy beach backed by an hotel at W610-430. From any such option, the shuttle is only about 2<em>km</em>, easily walkable. Tides Expect clapotis on the windward/uptide side. Major eddies set up at the head – the flow is always to the south on both sides close in. These collide with the mainstream at the head, so expect a race off the head itself and up to 2km downstream. It is reported that when winds are calm enough or from other than the southern quadrant, the mainstream race stays off the tip itself, somewhat out to sea, so that kayaks may scrape past on the inside.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Old Head of Kinsale</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">4:20 before Cobh HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">2:05 after Cobh HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The flows may change earlier. There is a strong rip close to the rocks at the western side of Garrettstown beach. Garrettstown Surf School and is a good source of local information. SPA Peregrine, Chough. <strong>Glandore Harbour</strong> Tides are very weak inside this S Cork inlet. There are two islands inside the harbour itself.</p>\n","costalZone":"**The South Coast**"}