{"name":"**Ormond’s Island**","nameHtml":"<p><strong>Ormond’s Island</strong></p>\n","safeName":"Ormond’s-Island","coordinates":{"irishGrid":{"sheet":"V","eastings":"795","northings":"652"},"fullIrishGrid":{"sheet":"","eastings":"79500","northings":"65200"},"tmcGrid":{"sheet":"","eastings":"479476.122","northings":"565263.838"},"geo":{"lat":"51.82660121","long":-9.74854429}},"cursor":55440,"description":"<p><strong>Ormond’s Island</strong> V795-652          Sheet 84 Very pleasant waisted drumlin like island, lying close to the shore.  Launch at Coornagillagh Quay V801649 or at LW by a causeway at SE corner.  The island consists of two small hills with large meadows edged with furze. Rocky foreshore on N/W sides, but less so on S edge. Small boulder clay cliffs at NW and SW corners add interest for the walker.   The more W meadow is much wetter underfoot and contains a mixture of wild semi-natural areas of marsh, blackthorn and gorse. Landings are possible around much of the island but probably the most attractive area is at mid S side under the ruined farmhouse, where also camping is best. Two ruins exist.  One is in the waisted area in the middle, and is shown on 0S map.  It is set in an attractive copse of silver birch, and was once a fine two storied farmhouse. The second marks a landing spot at the E end.  The island is grazed and although no spring was found, a piped water supply exists at gate at SE corner. <strong>Kenmare River Islands</strong> The Dunkerron Islands and the Greenane Islands are a double group situated about 6<em>km</em> W of the lovely Kenmare, on the N side of the main navigational channel up the bay, called the Kenmare River. Both sets of islands are overgrown, almost to the point of impenetrability, and certainly they are largley ungrazed and unmanaged.  That said, the Greenanes are much the more attractive to the passing recreational user for three reasons,</p>\n<ul>\n<li>that the interiors have at least some grass or open spaces, for camping or anything else,</li>\n<li>the foreshores are stonier and definitely the less muddy, and especially at HW,</li>\n<li>the Greenanes have nice narrow creeks and inlets to explore by boat.</li>\n</ul>\n<p>In combination, arriving and loitering on the Dunkerrons can cause a heavy penalty escaping again through the extensive glutinous mudflats that appear. Further, the more SW of the Greenanes are the more open and attractive. Embarkation The whole area is best accessed from a lovely stone built pier just off the main Kenmare Sneem road at V858-698, called locally Templenoe Pier, shown on the OS as Assroe or “Eas Rua” in Irish.  This translates as “red waterfall”, the name being apt.  The water in the stream flowing in here is very rusty, flowing down from red sandstone hills.  Oddly, the rock hereabouts is limestone, but the hills above are sandstone  This is a popular pier, always on the go with swimmers, holiday makers, anglers and dinghy sailors.  There are other piers locally, but public access is less viable.  Both island groups are described here anti-clockwise from Templenoe pier.</p>\n","costalZone":"**The South Coast**"}