{"name":"**Piratical Baltimore**","nameHtml":"<p><strong>Piratical Baltimore</strong></p>\n","safeName":"Piratical-Baltimore","coordinates":{"irishGrid":{"sheet":"W","eastings":"028","northings":"257"},"fullIrishGrid":{"sheet":"","eastings":"102800","northings":"25700"},"tmcGrid":{"sheet":"","eastings":"502770.613","northings":"525772.464"},"geo":{"lat":"51.47623794","long":-9.39973777}},"cursor":38949,"description":"<p><strong>Piratical Baltimore</strong> W028-257          Sheet 88 The ancient native Irish were comprehensively crushed in the military sense in 1601 with the battle of Kinsale.  The pacification of the countryside meant the land was ripe for settlement by the victors. Farming would follow the fighting, in a common pattern, here as elsewhere. Pretty seaside Baltimore was among the earliest of villages ‘planted’ with residents of English, Irish and Danish origins. Mostly they fished. On 20<sup>th</sup> June 1631, the village had 26 huts in concentric circles, stone fireplaces, but the rest was made of straw. In a pirate raid unequalled before or after, Baltimore had 235 less residents at sundown than at dawn. The 235 were taken by Barbary corsairs out of Algiers in a dawn raid. With a local pilot and a fair skinned Dutch commander, these oriental pillagers came ashore, burnt out the entire village and took away the villagers. There were two ships and 280 fighting men among the corsairs, of whom 230 went ashore. They set the roofs afire with tar torches and created lots of noise to confuse – 17<sup>th</sup> century ‘shock &amp; awe’. They took everyone, from the elderly to the youngest babies, who would become maids and then ‘whatever’. Two elderly and therefore uneconomic adults were sent back from the ships before they sailed. 23 men were taken and the rest were women and children. Fair skinned Celtic women were then as now greatly prized in North Africa (as they are in Ireland) and commanded high prices. The slaves were treated well on the whole and only the wealthy were abused so that their entreaties home for ransom might be the more urgent. Such piracy was then commonplace, even commonly carried out by the British and other European states. One William Gunther ran a populist campaign that managed to shock Westminster with the scale of the Baltimore raid and keep the candle burning. Only one captive ever made it home, Joan Broadbrook, not entirely a happy occurrence.  Male “liberated” captives in such circumstances have typically fared well enough, while “returned” females have always been shunned, throughout history, worldwide.  Statistically, 10% of all Algerians are fair skinned..</p>\n","costalZone":"**The South Coast**"}