{"name":"**Puffin Island**","nameHtml":"<p><strong>Puffin Island</strong></p>\n","safeName":"Puffin-Island","coordinates":{"irishGrid":{"sheet":"V","eastings":"345","northings":"682"},"fullIrishGrid":{"sheet":"","eastings":"34500","northings":"68200"},"tmcGrid":{"sheet":"","eastings":"434486.213","northings":"568263.026"},"geo":{"lat":"51.84202899","long":-10.40215085}},"cursor":61555,"description":"<p><strong>Puffin Island</strong> V345-682          Sheet 83 A big, high, chunky island at the NW tip of Saint Finan’s Bay, about 5<em>km</em> S of the entrance to Portmagee Channel. The cliffs on all sides are huge, except on the E, but where it is difficult to find a flat grassy bit to camp on. The island is almost split N/S midway along. Deep inlets N&amp;S appear to cut the island, at least from some angles, but actually it is possible to descend easily enough to where a wide but steep grassy ramp gives a connection between the two.  The summit portions of the W end require scrambling and a cool head.  Puffin, rabbits and sea-pink abound. This is a lovely, wild, pleasant, ‘must’ of an island. Landing Deep-water landings may be had in a number of places but nowhere better than in a sheltered, SE-facing, bouldery cove just S of the narrowest part of Puffin Sound. Tether to ropes left there by local scuba divers and fishermen for lunch stops. There is also an iron ring or similar evidence of other larger vessels having landed in the same spot at some time in the past. There is good clear water at all times in a well-filtered pool to one side, under a waterfall. An easy ramp gives access to the interior. SPA Peregrine, Chough, Storm Petrel. <strong>Oats Island</strong> V 346-679         Sheet 83 This is a small rocky islet lying very close to Puffin Island just S of its NE corner. Landing is onto sloping rock platforms on the W side. Scramble to top over large boulders onto grass and sea pinks covered ridge on steep E side. The summit had a single pair of breeding Oystercatcher and Great Black-backed Gulls in June 2008. Good views all round and especially of the boulder strewn landing area on Puffin Island.  No water or camping. The narrow cut that separates Oats Island from Puffin Island is not navigable at lower waters.</p>\n","costalZone":"**The South Coast**"}