{"name":"**Reenard Point to Rossbeigh**","nameHtml":"<p><strong>Reenard Point to Rossbeigh</strong></p>\n","safeName":"Reenard-Point-to-Rossbeigh","coordinates":{"irishGrid":{"sheet":"V","eastings":"434","northings":"776"},"fullIrishGrid":{"sheet":"","eastings":"43400","northings":"77600"},"tmcGrid":{"sheet":"","eastings":"443384.283","northings":"577661.118"},"geo":{"lat":"51.92900862","long":-10.27738776}},"cursor":64135,"description":"<p><strong>Reenard Point to Rossbeigh</strong> V434-776 to V645-910, Sheets 83 / 70 / 78 This trip describes the S side of Dingle Bay, from Reenard Point at V434-776, outside Cahersiveen, to Rossbeigh Beach at V645-910, a distance of about 32<em>km</em>. It is a trip of two distinct sections. The first is more remote, with a mountain ridge separating road from sea, with the mountain dropping to the sea in sheer cliff faces. There are two deep inlets on this part, both with sheltered piers. The second section has numerous stopoff places, and where steep earth and rock banks rise to the main road which parallels the shore, high overhead. Reenard Point at V433-776 is the easiest embarkation place for car access, being close to the main road. A summer ferry runs from here to Valencia. There is a superb seafood pub on the pier. Alternatively, the beach at White Strand (NE of Church Island at V436-793) can be used. Admire in passing, the extensive beach on NE Beginish. Rounding Doulus Head at V404-804, next along are Cooncrome (pronounced Coosecrown) Harbour at V444-816 and Coonanna Harbour at V480-842. Both are wide, deep harbours with pier and beach but no other facilities. The onward trip is just as committing with the next landing about 10<em>km</em> away at Kells Bay at V555-880. Kells Bay is a wide, deep inlet, with a sheltered pier – a noted beach and holiday spot. On the way, look for a stream falling clear to the water, where the cliffs form a bottleneck into which you must go to get under the waterfall. Also on the way, you come to Gull Rocks at V520-873, which are really little islands – sheer, high and close to the cliff-lined land. There is a sense of isolation around them. Finish at Rossbeigh (or Rossbehy) beach and sand dunes. This is a noted family beach, in parts like a typical machair, with hotel and holiday village. There is even a small sweet shop and chip shop, open during summer. The council maintain public toilets, water, and rubbish collection. They charged €7 per tent per night in 2002. Pitch where you like, except in the football field or tennis courts. Rossbeigh can have decent surf, and the dunes have been mapped for orienteering events. This area has been and remains <em>the</em> meeting ground for all Irish paddlers and surfers for the Christmas/New Year break. The long sand spit of Rossbeigh Point that extends N from Glenbeigh was breached at its N end by coastal erosion c.2009 leaving a substantial island lying offshore. The island consisted of extensive intertidal sandy beaches and sand dunes covered in Marram grass. Tides flowed strongly off both the N/S ends entering and leaving Glenbeigh and Cromane Harbours. The breach made between the point and the island was considerably eroded since Jan 2011 and the shape of the island was changing from year to year.  The breach is now more or less closed as of January 2013 and Rossbeigh Island as it was known for a few years has been once again subsumed into the mainland. There is ample parking at the S end of Rossbeigh Beach. However, there is a height barrier restriction that will not allow access for vans or campers which will have to park on roadside or at the local pub across the road.  The carry at times of HW is reasonable. Rossbeigh beach surfs frequently so an approach from within Glenbeigh or Cromane Harbours may be considered. <strong>The Dingle Peninsula</strong> <strong><em>Corca Dhuibhne</em></strong> <strong>Coastal Section</strong> <strong>Dingle Town to Slea Head</strong> <em>Baile an Daingin go Ceann Sléibhe</em> Q445-010 to V317-967   Sheet 70 Dingle town is a major fishing and tourist town, at the head of a sheltered bay. Embark at the harbour (the pier is by Nimmo) V441-009 where there is good parking.  Parking and launching are “paying”.  There is also a small car park at V453-997, halfway out the harbour on the E side, more suitable for small groups or  dolphin watching.  ‘Fungie’, the local friendly dolphin, is an experience not to be missed. However, you must also work your way around the many tour boats trying to spot him. Parking is very restricted.  Camping may be possible here or near the old tower. There is a path into town along the shoreline. Only the mouth of Dingle Harbour is narrow, and once inside the bay opens wide.  The beach SE of the mouth dumps, unfortunately. The trip to Slea Head is 16<em>km</em>. Hug the cliff line, and in calm water explore the many arches, caves, coves, and stacks.  This stretch is without landings, unless a detour is made into Ventry Harbour – <em>Cuan Fionntrá,</em> halfway along.  There is good parking and easy access at the pier on the SW side, 1.5<em>km</em> in, at the S end of a sandy beach.  It may get congested in summer. Fish cages. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"308\"><strong>Entrance to Dingle Harbour</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"227\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"227\">1:00 before Cobh LW (local LW)</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"227\">1:00 before Cobh HW (local HW)</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p><strong>Blasket Islands – <em>Na Blascaodaí</em></strong> Sheet 70 This group of islands, the most westerly, not only in Ireland but in continental Europe, is surely the finest in the country. There is a regular ferry to the Great Blasket only. There is little in the way of anchorages for bigger boats at the outliers, which are also rugged and exposed. Therefore, sea kayakers are privileged to have the finest way to explore the group as a whole. The Blaskets are a showpiece of Irish sea kayaking. That said, among the outliers, only Beginish and Inishvickillane have landings that are in any way dependable. Good conditions are needed elsewhere to avoid having to swim ashore, or worse. Expect to have to work for any landing. The commitment of the group should be consistent. The islands are uninhabited. Great Blasket was abandoned in 1954. Earlier in the century, 176 people lived there. There was a community here in 1588 when the Armada was about the place.  Between 1800 and Irish political independence from Great Britain in 1921, there was always about 150, including on Inis Mhicileain into the 20<sup>th</sup> century.  Inis Tuaisceart, Beiginis and Inis Mhicileain (up to 8) were occupied from time to time, and even Inisnabro had 4 in 1851 after the famine. The islands did not thrive with independence.  There was never the money for a pier.  The breakwater erected by charity money on the main island in earlier times never really gave enough shelter, so that except in very fair weather, only very small boats could land.  That meant that the island was cut off for long periods when other such islands would not have been.  Lack of access to mainland schools, hospitals, churches and shops wore the people down.  Then the turf ran out in the 1930s and even keeping warm in winter wasn’t guaranteed. There was always a single house on Inishvickillane. The Great Blasket now only has summer homes and there is one on Inishvickillane. There is an interpretive centre for the islands on the mainland at Dún Chaoin. Embarkation There are several places from which to embark, none of which are easy. Q314-002        Dún Chaoin Pier, from which the ferry operates, is the logical embarkation place, being sheltered. It has good parking, less than private camping, no water, but the pier is reached by a most unpleasant, steep carry. Launching is off a very steep slipway, or to one side in calm conditions. Group co-operation is often necessary. Q312-005        There is a small bouldery beach at the end of the laneway past the interpretive centre, which may be suitable for small groups in settled conditions. Q316-033        Clogher beach has a car park above but can surf with any swell from the W. V313-981        Coumeenoole or Slea Head beach lies almost 1.5<em>km</em> N of Slea Head itself, tucked inside Dunmore Head (V302-980). It gives a shorter trip. It often surfs, yet has merit for embarkation. With N winds, or when calm, it is very much the preferred option. The carry is better than the pier at Dún Chaoin, and the parking is excellent. Tides Tides in the Blasket Sound – <em>An Bealach</em> and elsewhere through the islands, flood north and ebb south, twisting with the channels. An exception is the channel between Inishnabro and Inishvickillane<em>,</em> in which the flow is always west. The tide races in the sounds, including Blasket Sound, have a fierce reputation.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Blaskets</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">4:30 after Cobh HW</td>\n\n<td width=\"57\">2-3kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">1:50 before Cobh HW</td>\n\n<td width=\"57\">1-3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Local HW is about an hour before Cobh. The stream timings are affected by strong winds. In particular, in sustained southerlies the flood runs longer and stronger. The speed of the tidal streams in the main channels varies, but is generally 1 – 3kn. In the narrower channels, in springs, the stream can reach up to 4kn, except between Inishnabro and Inishvickillane, where it is always weak. In Blasket Sound, the north-making flood rushes past Dunmore Head <em>– An Dún Mór</em> and eddies clockwise around <em>Dún Chaoin</em> Bay. Outward bound, small boats could do worse than follow the example of the ferry, which follows the coast southwest almost to Dunmore Head before crossing. In wind, this may get your boat above the bumpier parts of the tidal race, for a much smoother passage. On the south-making ebb tide, try a more northerly route, taking shelter from Beginish. Beware of reported local magnetic anomalies. Bibliography Recommended reading must start with ‘Twenty Years A-Growing’ by Maurice O’Sullivan, translated from the Irish (<em>Fiche Blíain ag Fás</em>), For a more complete list, add the following: ‘The Islandman’ (<em>An tOileánach</em>) by Tomás O’Criomhtháin ‘Peig’ by Peig Sayers ‘An Old Woman’s Reflections’ by Peig Sayers ‘The Western Island – The Great Blasket’ by Robin Flower ‘ The Blaskets, People and Literature’ by Muiris Mac Conghail ‘Méini – The Blasket Nurse’ by Leslie Matson ‘Letters from the Great Blasket’ by Eibhlís ní Shúilleabháin ‘Island Cross Talk’ by Tomás Ó’Crohán ‘A Pity Youth does not Last’ by Micheál O’Guiheen ‘The Blasket Islands – Next Parish America’ by Joan Stagles ‘Island Home – The Blasket Heritage’ by George Thomson ‘Blasket Memories’ edited by Pádraig Tyers ‘Hungry for Home’ by Cole Morton ‘Blaskets – a Kerry Island Library’ by Muiris MacConghail SPA Peregrine, Chough, Storm Petrel, Leach’s Petrel, Barnacle Goose, Greenland White-fronted Goose, Common &amp; Arctic Tern. The ‘outer four’ Blaskets, Tearaght, Inishtooskert, Inishnabro and Inishvickillane, boast internationally important numbers of breeding Storm Petrel and Manx Shearwater. The Spanish Armada The long awaited Spanish Armada sailed through the English Channel in August 1588, but no really decisive battle was fought. The Spanish knew they couldn’t achieve their main aims, and decided to sail home anti-clockwise around Scotland and Ireland. The English left them to it. The weather and the Atlantic would surely do what they had failed to ? They turned left at Fair Isle and left again near Rockall. Sailing South from so far North very few of the sailors had ever experienced, the great fleet broke up and it was each ship for itself. Some ran for land out of hunger and thirst, some got home, and some tried and failed. It is thought that 26 Spanish Armada ships were wrecked on the Irish coasts in 1588, from the Blaskets in the SW around to Dunluce Head in the NE. The Blaskets is a tale of good and bad fortune. Vice Admiral Recalde knew the tiny gap between Great Blasket and the reefs / islands to the NE. He had seen this coast before in an expedition in 1580 to put Italian soldiers ashore in Smerwick. He went through first on 14.9.1588 in <em>San Juan</em> followed immediately behind by the frightened but trusting Captain Aramburu in the <em>San Juan Bautista.</em> This has long been regarded as an act of truly superb seamanship, proving the failure of the armada was related to many factors including maybe the quality of its ships, but distinctly not the men who sailed them. The two ships swapped anchors, sent men ashore for water, and then they waited. On 21.9.1588, a big storm came up, in the middle of which appeared the <em>Santa Maria de la Rosa</em> from the NE. Her anchor held only as long as the tide was flooding N (the wind was from the N, and helped to hold her), but once the tide changed, the wind and tide had her, so she slipped away, and was lost with all hands in less than 2 hours. Then yet another <em>San Juan Bautista</em> appeared and another small ship. Both were considered spent, were scuttled, and their crews taken aboard the two <em>San Juans</em>. All made it safely back to Spain. A major contributory factor for the number of ships of the armada wrecked off the Irish coast was the loss to most of them of their main anchors off Calais the month before. The English drifted fire-ships down onto the fleet as it lay anchored, a tried and trusted attack offensive strategy of the day, devastating in the right circumstances. The Spanish were ready for this well known ploy, and slipped anchors to dodge them. Standard operating procedure intended they sail a <em>km</em> or so to one side, and then slip back to retrieve their previous anchorage. However, they all got in each other’s way, and the tides were strong. In their clumsy manoeuvring, a lot of them lost ground they couldn’t make back up. Very few made it back to their main anchor again. The English thought the (expensive) ploy had failed badly, but in fact, it accounted for dozens of Spanish ships, only it took time. Embayed off Scotland or Ireland with only reserve anchors, many ships were lost that would otherwise have made it, as with the <em>Santa Maria de la Rosa</em>. There were other factors. The ships themselves were mostly too weak for the rigours they experienced. They just weren’t up to the North Atlantic in late Autumn. Battle damage added to the problem, as did the stress on their timbers from firing huge cannons they were never designed for. There was no easy way to calculate longitude in those days, only dead reckoning really, and sometimes going over a week without a sun fix, many were caught out. The maps of the day were inadequate and the sailors mostly just didn’t know Scotland or Ireland. The new Wagenhaer’s Chart was too small a scale, and the older Ortelius showed western Ireland as a straight line coast. Many a ship at dawn was delighted to spy land, but later found itself embayed. Unable to sail to windward, the end was nigh. Usually they anchored at that point but many were short on anchors. In Scotland if they got ashore they were looked after. Many got safe passage home. Even if the ship returning them had to put into an English port for repairs or for any reason, the English gave them safe passage. The Armada threat was past, and the English were chivalrous. Things were different in Ireland. All of Recalde’s sailors who went ashore for various reasons were put to death. Worse, far worse, would happen elsewhere. Irish peasants had never seen anything as wealthy as the miserable Spanish sailors they came across on beaches and headlands up and down the west coast. Their natural instincts guided their reactions. Typically they stripped the sailors naked and robbed them of everything. Then by all accounts, other peasants were quite hospitable to them, once they were equally miserable looking. The English on the other hand had a game plan. Ireland had a new Governor, Lord Fitzwilliam, just three weeks into the job when the first Armada sailors swam ashore in September 1588. He feared that they would make alliances of convenience with local rebel clansmen. That never happened but he never stopped fearing it might. Typically the sailors were challenged and surrendered. Once in captivity they were rigorously interrogated. The wealthy few whose families might ransom them were saved but the rest were put to death, mostly by hanging.</p>\n","costalZone":"**The South Coast**"}