{"name":"**River Barrow**","nameHtml":"<p><strong>River Barrow</strong></p>\n","safeName":"River-Barrow","coordinates":{"irishGrid":{"sheet":"S","eastings":"724","northings":"386"},"fullIrishGrid":{"sheet":"","eastings":"272400","northings":"138600"},"tmcGrid":{"sheet":"","eastings":"672334.687","northings":"638647.334"},"geo":{"lat":"52.49442836","long":-6.93477557}},"cursor":29119,"description":"<p><strong>River Barrow</strong> S724-386          Sheets 68 / 76 Put in at St. Mullins (gridref) about Cobh +0100 which is maybe 60 minutes before the beginning of the ebbing tide, which is Cobh +0200.  That way you get ther entire of the ebb all the way, and the upper parts of the river are in deepwater mode, which is way more attractive to the average passing small boatman.  If the river is in flood there is always an ebb flow in an estuary, so start even earlier to gain even more tidal advantage.  A trip of this kind requires a shuttle, so maybe plan to leave even more time, say 90 minutes, against human weakness. The river changes subtly as you move along  – starting in a forested river valley with steep sides.  It is necessary to keep up at least 10<em>km</em> over the ground, and the get out spots are few and far between (mud, ooze, goo), so the party needs to be of unified purpose. The river begins to flatten out into a meandering flow around where the Nore joins in, about 4<em>km</em> above New Ross. The first obvious stop is at New Ross Boat Club S717-278, just NNW of the bridge, on river right, where normally the gate is locked, but for access for genuine club trips, e-mail in advance<a href=\"mailto:marina@newrosstc.ie\">marina@newrosstc.ie</a> Marina Manager, New Ross Town Council. Lunch. Then inspect the MV Dunbrody on river left, still in New Ross, a replica “famine ship” built in the 1990s to commemorate the ships of the 1840s in which so many Irish travelled to the new world when things collapsed locally. The Suir joins in a further 17<em>km</em> downriver and the bigger commercial shipping picks up, necessitating greater concentration.  Something may appear at speed from in front or behind, or from the side at Passage East, but then Duncannon lies ahead. Finish.  43<em>km</em> overall.</p>\n","costalZone":"**The South Coast**"}