{"name":"**Roancarrigmore**","nameHtml":"<p><strong>Roancarrigmore</strong></p>\n","safeName":"Roancarrigmore","coordinates":{"irishGrid":{"sheet":"V","eastings":"792","northings":"459"},"fullIrishGrid":{"sheet":"","eastings":"79200","northings":"45900"},"tmcGrid":{"sheet":"","eastings":"479175.955","northings":"545967.995"},"geo":{"lat":"51.65315968","long":-9.74619897}},"cursor":49249,"description":"<p><strong>Roancarrigmore</strong> V792-459          Sheet 84 This is a low-lying lighthouse island, located 2<em>km</em> E of Lonehort Point on Bear Island, dominated by its large and impressive lighthouse buildings complex.  Views all round are superb because of the island’s position. It is well worth the visit. Embarkation Set out from a very private little pier with a gravel beach beside, 2<em>km</em> to the N at V793-477.  The pier is itself a lovely place.  It is poorly signposted off the main road and care is needed, to avoid frustrating to-ing and fro-ing.  The road from the N is a cul-de-sac, despite Sheet 84. Landing The traditional landing is onto a pier with steps on its N flank, which can be difficult for kayakers in that the steps are narrow and very prone to Atlantic swell. In calm conditions a landing is also possible onto rock shelves either side of the main pier, but at about HW, it is probably best into a narrow cut just NE. Here a narrow gap allows access into a small pool and a relatively easy landing. Lighthouse Complex The exposure of the lighthouse compound to the elements becomes apparent almost immediately as one takes in the height of the protective wall running along the S and SW flank. Within the SW orientated enclosure, there is the feel of a walled garden, there are stands of Tree Mallow and other marine plants, and remnants of some old gardens can be seen.   A walkway leads to the helipad and beyond that the SW wall. Fauna The island has a good breeding population of gulls, while small numbers of Curlew, Oystercatcher, Turnstone and Common Seal can be found during the winter months. Camping Camping is possible in the main enclosure, although perhaps not in the breeding season – March through July, as this is the main area.  No water found. Film Roancarrig More and Beg are included in the film set for the Neal Jordan’s latest  spectacular film “<em>Ondine</em>”, about a mermaid who falls in love with Colin Farrell, filmed in late summer 2008.</p>\n","costalZone":"**The South Coast**"}