{"name":"**Roancarrigbeg**","nameHtml":"<p><strong>Roancarrigbeg</strong></p>\n","safeName":"Roancarrigbeg","coordinates":{"irishGrid":{"sheet":"V","eastings":"788","northings":"465"},"fullIrishGrid":{"sheet":"","eastings":"78800","northings":"46500"},"tmcGrid":{"sheet":"","eastings":"478776.05","northings":"546567.866"},"geo":{"lat":"51.65846364","long":-9.75218355}},"cursor":49592,"description":"<p><strong>Roancarrigbeg</strong> V788-465          Sheet 84 This small low-lying rocky islet is surrounded by outlying reefs and shoals.  It lies 0.5<em>km</em> NNW of Roancarrigmore and, as of July 2008, was dominated by the remains of a wreck, which, when viewed from a distance, gives this otherwise flat rock an interesting perspective. Ghost Ship Stranger than any Neal Jordan film about any mermaid on a rock is the true story of the 27 year old Spanish fishing vessel <em>Nuestra Senora de Gardotza</em>, the wreck that now deteriorates year by year on this rock.  Having died in heavy seas on 30<sup>th</sup> January 1990, the wreck was at first nothing more than an eyesore, until it became famous 10 years later in December 2000. Another Spanish fishing vessel, called the <em>Zorro Zaurre</em>, got into difficulties after the vessel sprang a leak with 13 crew on board, 140 miles S of Mizen Head on November 30<sup>th</sup> 2000. All the crew were airlifted by the RAF to Cornwall. The crew described the ship as being swamped and said they believed it was within an hour of going under. The vessel was abandoned to sink. It didn’t, at least not immediately. Over a week later, on December 8<sup>th</sup> the Irish naval ship <em>L.E. Orla</em> was asked to follow up a report that a slight diesel slick and fish boxes had been seen in Bantry Bay, to the E of Castletownbere. A Naval Service diving team identified the sunken wreck as the <em>Zorro Zaurre</em>, which which had ended up underwater, a mere 400 metres from the <em>Nuestra Senora de Gardotza</em>. Imagine the shock when it transpired the two were sister ships, same owner, same manufacturer, same hometown in Spain a thousand miles away.  The <em>Zorro Zaurre</em> had travelled 160 unguided and unplanned miles, barely floating and in her death throes, to lie forever in a foreign land immediately beside her sister the <em>Nuestra Senora de Gardotza</em>. Neal Jordan – follow that ! Landing Land fairly dependably in the NE onto a sheltered stony beach in a lagoon. This is accessed through an obvious break in the shoals but this may not be possible if swell is running high. Timing of a landing into this lagoon is probably best at or about HW. The lagoon is a pleasant surprise, and on a good day, a great place for a swim<strong>.</strong></p>\n","costalZone":"**The South Coast**"}