{"name":"runs towards Deepwater Quay at Cobh.\n\n**Great Island**","nameHtml":"<p>runs towards Deepwater Quay at Cobh.</p>\n<p><strong>Great Island</strong></p>\n","safeName":"runs-towards-Deepwater-Quay-at-Cobh.Great-Island","coordinates":{"irishGrid":{"sheet":"W","eastings":"805","northings":"665"},"fullIrishGrid":{"sheet":"","eastings":"180500","northings":"66500"},"tmcGrid":{"sheet":"","eastings":"580454.577","northings":"566563.338"},"geo":{"lat":"51.85093877","long":-8.28370522}},"cursor":33345,"description":"<p>runs towards Deepwater Quay at Cobh.</p>\n<p><strong>Great Island</strong> W805-665          Sheet 87 / Sheet 81 This island is unique amongst Irish islands in having a large town, Cobh. The island is located in the centre of Cork Harbour and is dominated on its southern flank by the town of Cobh. It is joined to Fota Island in the NE by a short bridge at Belvelly at W791-708. Access has improved in recent years with the introduction of a passenger and vehicle ferry between Carrigaloe and Passage West at W772-675, thereby shortening road travel time to Cork City. The island has a long history of human settlement dating back to the Phoenicians, but owes much of its development to its fine natural harbour. Its naval importance and its use as a port for transatlantic liners has left the town with a long nautical association. Much of the town’s fine architecture dates from the early 1800’s. Historic attractions include a fine cathedral, Cobh Heritage Centre and Old Church Graveyard, where many of the victims of the Lusitania are buried. The town’s long association with the White Star Line’s Titanic and Mauritania has been re-kindled recently with the opening of the Titanic Rooms bar and restaurant in what was the old White Star Line Shipping Offices. Great Island is 7<em>km</em> long by 4<em>km</em> wide. The geology is Old Red Sandstone overlaid with Limestone in the valleys. The northern shorelines are estuarine, and the island is separated from the mainland at its western and eastern flanks by two river gorges. A full circumnavigation is an interesting day’s paddling, bringing the kayaker through urban, industrial, estuarine, agricultural and scenic landscapes. Circumnavigation Embarkation for a circumnavigation is recommended from White Point at W786-658 or alternatively at any of several slipways in Cobh, perhaps the best of which is under the town clock directly opposite Eddie English’s Sail Training Centre at W805-665. It is recommended to follow a clockwise route around. The entire distance is about 27<em>km</em>, or 5 hours paddling, but allow for stops. Tides Tidal flows in the river gorges (W and E sides) run to 3<em>kn</em> in springs but these can be utilised to advantage in the timing of one’s passage. The critical factors in a circumnavigation are (a) to pass close enough to HW where the tides meet, which is under Belvelly Bridge W791-707, and (b) to clear Rosslague Point at W800-703 just to its E before the ebb exposes the mudflats. A trip in spring/autumn/winter is best from a natural history point of view as both Lough Mahon to the NW and the North Channel have large numbers of ducks and waders to provide interest. The western river passage is a busy shipping lane to Ringaskiddy Port and Cork City. Care is required passing the old dockyard at Rushbrooke and IFI fertiliser jetties at Marino Point at W772-694. The Ro/Ro ferry service at Carrigaloe-Passage West also moves surprisingly quickly. Camping Camping is possible and quite pleasant from Ashgrove at W860-696 at the NE point, to East Ferry, to Morlogue Point at W852-672 at the SE point. Water is not available but the area is pleasantly wooded and there are several grassy fields that are quite remote. The eastern river passage down to East Ferry is quite scenic and one has a choice of two hostelries for lunch. The Morlogue Inn at W853-683 is situated on the Great Island side about halfway down and Murphy’s Bar is on the mainland opposite. Once around Morlogue Point at W852-672, passage is westward towards Cobh. A Birdwatch Ireland nature reserve is located at Cuskinny Bay at W818-673. The Spit Bank Lighthouse at W812-658 marks the edge of the Spit Bank and is worth a detour. The tidal flow is weaker on the Spit Bank and gives better views of Cobh than the main channel, being that bit out and thereby gaining perspective. Spike Island at W805-645 and Haulbowline Island at W789-655 dominate the views to the S.</p>\n","costalZone":"**The South Coast**"}