{"name":"**Saint Finan’s Bay to Portmagee**","nameHtml":"<p><strong>Saint Finan’s Bay to Portmagee</strong></p>\n","safeName":"Saint-Finan’s-Bay-to-Portmagee","coordinates":{"irishGrid":{"sheet":"V","eastings":"376","northings":"686"},"fullIrishGrid":{"sheet":"","eastings":"37600","northings":"68600"},"tmcGrid":{"sheet":"","eastings":"437585.51","northings":"568662.963"},"geo":{"lat":"51.84653068","long":-10.35739904}},"cursor":62024,"description":"<p><strong>Saint Finan’s Bay to Portmagee</strong> V376-686 to V373-730, Sheet 83 This 9<em>km</em> coastal paddle can be twice that if pottering, especially if one includes a circuit of Puffin Island. Not to do so is to miss out on ‘a magnificent piece of savage marine architecture, with dizzy cliffs carved and eroded by the Atlantic breakers and set at crazy angles by the mighty forces of past geological movements’ – ‘In the Kingdom of Kerry’ by R.Hayward, 1945. Ideally, calm conditions should prevail, to allow paddlers inside the many rocks and islands dotting this stretch. Vertical cliffs in excess of 100m contribute to the sense of exposure and commitment. Embark at the pier 3<em>km</em> inside Puffin Sound, known locally as Glen Pier at V376-686, where there are some fishing boats and scuba-diver traffic. This has two slipways and lots of parking space, but is exposed to the W. It is also the nearest access point for a paddle to the Skelligs. Before landing, look for a long narrow inlet almost opposite the slipway, which leads to a long low arch with a few openings to the sky – though this wee adventure needs HW. From Puffin northwards, there is only the ‘savage grandeur of the rock-bound, storm besculptured coast’. The islands – Horse, Long, Short and Black Rocks, guard the entrance to the main Portmagee Channel. Opposite them are a number of deep inlets where landings can be made onto gravel or stones. Much easier landings are to be had onto gravel beaches just inside the headland delimiting the channel proper. Approaching the Portmagee Channel, avoid the fishing boats, and in summer, the numerous Skellig ferries. Land at Portmagee at V373-730.</p>\n","costalZone":"**The South Coast**"}