{"name":"**Samphire Island**","nameHtml":"<p><strong>Samphire Island</strong></p>\n","safeName":"Samphire-Island","coordinates":{"irishGrid":{"sheet":"Q","eastings":"729","northings":"147"},"fullIrishGrid":{"sheet":"","eastings":"72900","northings":"114700"},"tmcGrid":{"sheet":"","eastings":"472877.949","northings":"614753.233"},"geo":{"lat":"52.26976218","long":-9.86261776}},"cursor":70932,"description":"<p><strong>Samphire Island</strong> Q729-147          Sheet 71 Situated just off Fenit, a beautiful fishing village 12<em>km</em> W of Tralee.  Fenit lies outside the mouth of where the harbour at Blennerville gives way to Tralee Bay outside.  Launch from the town beach Q727-154 – Sheet 71, just at the beginning of the bridge to the island.  Parking, water and toilets are available at the beach, as is a lovely cafe.  All the usual small town facilities are available in Fenit.  A major local attraction is Fenit Island (local name) or Fenit Within (OSI name), a beautiful walk N of the town, very popular.  The underlying rock is limestone. Samphire Island has been developed beyond all recognition.  Originally a small high rock, it is now joined to the mainland to the N at Fenit village by an 800m bridge.  A modern working fishing and manufacturing facility has been built on the island.  There is also a marina for pleasure yachts, the RNLI station which launches from the marina, the fishing club and much else.  The Sailing Club is on the mainland end of the bridge. Hazard Beware paddling under the bridge.  Tides run strongly.  The worst bit though is that an integral part of the structure of the bridge is a horizontal spar running between all the uprights above LW but at less than HW.  No more dangerous a contraption may be imagined.  At two thirds tide height it works as a classic sieve, a concept feared by kayakers the world over.  Even at other stages of the tide, it is still dangerous, being festooned with nets, fishing hooks, and detritus of all kinds.  Keep away. Approaching the island at road level on foot, one is struck by the statue on the top of the rock.  This is Saint Brendan the Navigator 484 – 578, who features at various points around the coast, but who was a native of Fenit.  He is best known for being the first European to go to and return from America. His parents were in an early wave of newly converted Christians in Ireland and he was ordained as a priest in 512 at age 28.  He became a bishop and was hyperactive in setting up abbies and monasteries in Ireland and abroad.  His missioning was mainly but not exclusively to the N, such as St. Kilda and the Orkneys, but he also worked in Brittany and Normandy.  In his travels he also visited the Faroes, Iceland, and Newfoundland.  Fenit is still proud of its local boy made good. The rock that is the original Samphire Island is a theme park on a small scale, with imitation wedge tombs and beehive huts.  Well worth the visit.  The modern working port area impresses for the scale of what is being manufactured.</p>\n","costalZone":"**The South Coast**"}