{"name":"**Scariff Island**","nameHtml":"<p><strong>Scariff Island</strong></p>\n","safeName":"Scariff-Island","coordinates":{"irishGrid":{"sheet":"V","eastings":"454","northings":"560"},"fullIrishGrid":{"sheet":"","eastings":"45400","northings":"56000"},"tmcGrid":{"sheet":"","eastings":"445383.587","northings":"556065.645"},"geo":{"lat":"51.73558937","long":-10.23869605}},"cursor":58743,"description":"<p><strong>Scariff Island</strong> V454-560          Sheet 84 This is a huge, 252m high, exposed, mountainous lump of a truly offshore island; it was once inhabited by monks. There is an old oratory, very high up, roughly in the middle. There are the remains of a more recent inhabitation lower down, all on the SE side. Local lore says that the children of the settlement got measles and died, ending the human colonisation of the island. The undergrowth is mostly quite long, and despite there being no obvious grazing, gorse has not conquered all. Wellingtons are suitable for general exploration of the long grass and ferns of the island, even on the finest days. Reports of good spring water could not be confirmed even though old wells were found. There is the appearance of a path down along sloping ground to a cove midway along the S side of the island, called Lamb’s Cove. There is a wall down to the head of the cove. This may perhaps have been to facilitate fishing. The Farbregagh (literally – imitation man) at the N tip is a huge sea arch. Landing Access is by a relatively sheltered, deep-water landing in a small cove in the NE corner, called Coosaneeve. Here, the monks cut a stairs of splendid steps in the solid rock (as monks did). These are wondrous to behold. They go all the way down to LW, and are hard to see until very close in, so perseverance is recommended. Local information suggests that the water in the cove is calmer on a dropping tide, but the logic for this is obscure. Tides Tides run more strongly in the sound between Scariff and Deenish than they do inside Deenish. On the flood, the tides reunite off the northern tip of Deenish causing turbulence locally. They run north with the flood and south with the ebb into and out of Kenmare Bay.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between Scariff and Deenish</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">5:05 after Cobh HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n<tr>\n\n<p>&lt;td</p>\n","costalZone":"**The South Coast**"}