{"name":"**Sherkin Island**","nameHtml":"<p><strong>Sherkin Island</strong></p>\n","safeName":"Sherkin-Island","coordinates":{"irishGrid":{"sheet":"W","eastings":"028","northings":"257"},"fullIrishGrid":{"sheet":"","eastings":"102800","northings":"25700"},"tmcGrid":{"sheet":"","eastings":"502770.613","northings":"525772.464"},"geo":{"lat":"51.47623794","long":-9.39973777}},"cursor":39309,"description":"<p><strong>Sherkin Island</strong> W028-257          Sheet 88 Population 90. Embarkation and Landing The pier in Baltimore Harbour is the embarkation place for the island. During busy periods the strand 0.5km southwest on the edge of town W043-260 can be less fussy, and the parking is fine.  The main pier on Sherkin is on the E side of the island just below the abbey, all clearly visible from Baltimore. There is a water tap on the pier. The strand on the S side of the pier is a very sheltered, stony beach. Camping Prominent, ivy-clad O’Driscoll Castle stands 300m N of the pier. Below the castle is a very steep slipway, and above the castle is the hotel. The best camping is above the slipway. It is best to ask in the hotel. There is another water tap just outside the hotel and below ‘The Jolly Roger’ pub. Circumnavigation The Globe Rocks, awash at LW, are just N of the pier. The sound at the NW of the island between it and Spanish Island is called ‘The Sound’. Dock Pier is just W of the N entrance to The Sound, in a safe, well-sheltered ENE-facing cove at W023-273. Along the whole N side of the island, beware of the Cape Clear Island ferry, as the depth is shallow and the boats are very frequent in summer. Many yachts will also be encountered, many of which are being driven by beginners, and further care is needed in that regard. The very sheltered Kinish Harbour on the NW side, which mostly dries, has a mighty current, perhaps 2kn, at the entrance at W017-259. Beware of Carrogoona Rocks just E of the entrance. It is only a 150m carry to Cow Strand at W014-253 from the quay at the SW side of the harbour. W of the entrance to Kinish Harbour is the Sherkin Island Marine Station. The landing point at W010-259 involves a lot of weaving in between offshore rocks but the landing itself is quite sheltered. The Marine Station, in addition to its research activities, privately publishes works on bird life and natural sciences, particularly aquatic flora and fauna. Especially recommended is their ‘Ireland’s Marine Life, A World of Beauty’, a stunning collection of underwater pictures taken locally in Roaringwater Bay. The price at time of writing was €20.00, plus postage. Contact them on 028 20187 or by e-mail at SherkinMarine@eircom.net. Cow Strand is the more southerly and smaller of two strands in the large curved bay on the W part of the N side of the island. It is a bit public in summer but a great spot nonetheless. Silver Strand at W012-255 is just to the N of Cow Strand. It is probably the best beach on the island and camping is to be had in the cliffs at the S end. Above both beaches, an islander collects modest camping fees. Both beaches slope gently and attract big swells, getting dangerous when the wind is SW to NW. 3-400m S of Cow Strand is Priest’s Bay at W012-247, which is very secluded. SW of Priest’s Bay is the nice, crescent-shaped, sheltered Trabaun Strand at W010-245. On an anticlockwise trip around, the coast from here to the well-named Horseshoe Harbour at W027-254 is more or less inaccessible all the way. An exception may be Tracrua at W003-240, a narrow inlet just S of Sherkin Point. Horseshoe Harbour lies just W of the sound to the E of the island, very near everything and very secluded. The rocky landing is in at the back. Tides Baltimore Harbour fills from both the northwest and from the south. These flood streams meet near Lousy Rocks in the middle of the harbour. The tidal stream floods east on both the northern and southern sides of Sherkin Island. After that, the combined stream heads east and then northeast into Church Strand Bay, northeast of the town. The ebb is the reverse.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"308\"><strong>Entrances to Baltimore Harbour</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"227\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"227\">5:45 after Cobh HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"227\">0:25 before Cobh HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Gascanane Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SE</td>\n\n<td width=\"170\">5:20 after Cobh HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NW</td>\n\n<td width=\"170\">0:55 before Cobh HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The stretch of water around Cape Clear and Sherkin is not to be underestimated. In many places, especially Gascanane Sound, the tide runs fiercely, causing dangerous eddies and overfalls, especially near Carrigmore Rocks in the middle. The steep-to rock on the Sherkin side of the sound is Illaunbrock.</p>\n","costalZone":"**The South Coast**"}