{"name":"**Spike Island**","nameHtml":"<p><strong>Spike Island</strong></p>\n","safeName":"Spike-Island","coordinates":{"irishGrid":{"sheet":"W","eastings":"805","northings":"645"},"fullIrishGrid":{"sheet":"","eastings":"180500","northings":"64500"},"tmcGrid":{"sheet":"","eastings":"580454.574","northings":"564563.777"},"geo":{"lat":"51.83296449","long":-8.2835923}},"cursor":34496,"description":"<p><strong>Spike Island</strong> W805-645          Sheet 87 / Sheet 81 This island is located very close to the centre of Cork Harbour and the distinctive flat-topped fort dominating the island was until recently a civilian prison. The island is a good rest/lunch area for kayakers touring the harbour area. Most of the rest of the island apart from the extensive fort is grassland with some copses of Scots Pine along the N and W sides. The E and S sides are steeper with scrub and furze dominating the vegetation. Landings are possible at most points of the island but probably best at the NE corner at W807-649 near a very large limestone warehouse. A ferry service for Military and Prison staff runs from Cobh to the island pier at the NW corner at W800-648. The island’s history is largely military because of its strategic position and the importance of Cork Harbour in British Naval history. The island commands the approaches to the outer and inner harbour and formed a triangle of defence with the twin forts of Camden at W809-618 and Carlisle at W819-624, located on either side of the narrowest part of the entrance to the harbour. Spike Island has a distinctive flat-topped appearance due to the presence of its large sunken fort. The fort has witnessed various uses by both the British and Irish governments ranging from Internment Centres to Military Prisons and Military Training Areas. The island was also used occasionally as a Quarantine Zone for imported livestock.  Current plans for the intensified use of the island include a prison, but with a land bridge, as the ferry cost was a major factor shutting the prison in the past. On the N side facing Cobh, there are many old military style houses and storage areas. Most of these buildings are now in an advanced state of disrepair. The foreshore is predominantly shingle and stony beaches and the area between Ringaskiddy Point at W794-647 and the western shore dries out to expose large areas of muddy estuary. However, the route is navigable by kayak at all stages of the tide. Tides The Spit Bank lies off the island’s northern shore and is marked at its NE edge by the Spit Bank lighthouse at W812-658. Tidal flow on the bank is less than in the main harbour channels and may be useful to kayakers travelling up or down river against the flow. Landing Traditionally, landings have not been encouraged. The military had sentries posted at all points to deny access. However, this practice has been relaxed in recent years and kayakers remaining away from the main fort area have not been challenged. <strong>Cork SW</strong> Tidal Overview Off the coast from Cork Harbour to the Fastnet, the tidal streams achieve 1.0 – 1.5kn in springs and eddy strongly at the headlands.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Cork to Fastnet</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"66\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">4:20 before Cobh HW</td>\n\n<td width=\"66\">1-1.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">1:50 after Cobh HW</td>\n\n<td width=\"66\">1-1.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Be aware that the tide inshore, particularly at headlands is often seen to change an hour or more earlier than the times above. <strong>Access</strong> Heading west from Cork Harbour the coastline is dominated by cliffs of sediments with the only real shelter provided by the river mouths of The Slick at Oysterhaven, the Bandon at Kinsale and the Argideen at Coolmain Bay.  Otherwise landings are few enough and road access to a landing a rarity.  As a result of this limited access to the coast, there is inevitably a small settlement at each of these coves. Islands too are few, so coves and bays and islands are presented here in the order in which they appear to the westbound traveller.</p>\n","costalZone":"**The South Coast**"}