{"name":"**The Great Blasket – _An Blascaod Mór_**","nameHtml":"<p><strong>The Great Blasket – <em>An Blascaod Mór</em></strong></p>\n","safeName":"The-Great-Blasket-–-_An-Blascaod-Mór_","coordinates":{"irishGrid":{"sheet":"V","eastings":"280","northings":"977"},"fullIrishGrid":{"sheet":"","eastings":"28000","northings":"97700"},"tmcGrid":{"sheet":"","eastings":"427987.918","northings":"597756.912"},"geo":{"lat":"52.104934","long":-10.51113933}},"cursor":66815,"description":"<p><strong>The Great Blasket – <em>An Blascaod Mór</em></strong> V280-977          Sheet 70 Landing and Camping Also known as <em>An tOilean Tiar</em>.  The main slip/pier is  at V280-977 below the village, difficult to make out until close. The pier is somewhat sheltered, but some surge is always present. Water is from a tap high up at the SE end of the village, convenient to the pier, but a longer walk from the beach White Strand –<em>An Trá Bán</em> at V277-980.  Theisland is a National Park.  Camping is banned and landing even for day trips is barely tolerated.  Certainly it is unwise to land in high season at the main pier, and worse to camp in its vicinity. On a day trip, the <em>An Trá Bán</em> at V277-980 beach is much the easier, near a ramp, and small groups might chance camping above. There is a splendid cafe for daytime snacking. Rock climbing has been opened up on the island, with a cliff just SW of Gurraun Point at V283-977 (the most E point of the island). Splendid walking tracks run high along both sides of the ridge of the island, like a necklace, giving an excellent circuit. On circumnavigation, tides run strongly at the three corners. The lee side of the island is often subject to fierce downblasts of kattabatic wind. Tides run strongly in Black Sound between Inishnabro and Great Blasket, where the wind can be funnelled and strengthened. The narrow gap off the northern tip is subject to sudden unexpected surges or boomers as big sets pass. Through this gap go circumnavigators or venturers to the outlying islands. The passage is between a rock off the main island and a small islet at V272-985, being the innermost in a string of such rocks. In an autumn gale in 1588, one of the largest ships of the escaping Spanish Armada entered Blasket Sound and ran safely through this gap. Thus they performed one of history’s most remarkable pieces of seamanship. Two other Armada ships were wrecked locally. Mice Great Blasket offers mice with long legs and big mouths. Local lore puts this down to the mice arriving with the Vikings 1,100 years ago, in bales of hay, and what with the sides of the island being steep. Others like to think of Darwinian adaptability, the island being relatively inaccessible to their predators. Either way, they do weigh more and have larger hind-feet. Seals Ireland’s second largest haul out of atlantic grey seal occurs here each autumn on <em>An Trá Bán</em>. Several hundred seal come here to pup between September and December. The only bigger colony is on Inishkea North in County Mayo.</p>\n","costalZone":"**The South Coast**"}