{"name":"**The Cow**","nameHtml":"<p><strong>The Cow</strong></p>\n","safeName":"The-Cow","coordinates":{"irishGrid":{"sheet":"V","eastings":"425","northings":"397"},"fullIrishGrid":{"sheet":"","eastings":"42500","northings":"39700"},"tmcGrid":{"sheet":"","eastings":"442483.989","northings":"539769.015"},"geo":{"lat":"51.58839967","long":-10.27330314}},"cursor":52432,"description":"<p><strong>The Cow</strong> V425-397        Sheet 84 The 66<em>m</em> high Cow, lying halfway between Dursey Head and the Bull, is an inhospitable place. Sheer walls surround it. Landing by kayak has always seemed impossible for all practical purposes and was never attempted, though some did look, until achieved in 2011.  Lesser Black-backed Gull abound. A mighty sea arch lies off its SE side, and the passage through is challenging. All along the S side lies a thin offshore rock called Gull Rock, which provides shelter for a rest on passage. A difficult landing was forced on the N side of the NE tip.  Securing the boats was awkward.  The climb above is manageable.  Remember to mark your route up and in particular the point where cliff meets flat top, as getting this wrong on the way back down could make things tricky. <strong>Irish Seak Kayaking in the 1980s</strong> Canoeing in general and sea kayaking in particular was in existence in the 1970s and even before that. On 4<sup>th</sup> January 1977 the ICU acknowledged sea kayaking as a distinct discipline within the sport of canoeing, and they hosted the first ever dedicated sea kayaking weekend course that May, led by Colin Mortlock of Nordkapp fame.  The Irish Sea was crossed that July by Joe Halpin, Pat Blount and Aidan Kelly.  Ireland was “rounded” the following summer by Franco Ferrero et al, then “solo” in 1979 by Tom Daly.   Nevertheless it was only with the new decade that the first semblance of a sport emerged with sufficient numbers that people started getting together to do their thing, however informally.  The Nordkapp was “the” boat, and hard times generated many locally constructed clones. The legends are endless but they weren’t all hard as nails, poorly equipped or untrained, but it is true that they couldn’t read the rulebook until after they had first written it, and the gear was nowhere near as posh as it is today.   North Mon and UCC in Cork fed the first viable stream of paddlers into the system.  Tiglin first, but later other outdoor centres, led the way.  “Fleets” of kayaks started appearing. Formal instruction for the masses accelerated at the end of the decade with Stephen Hannon and Humphrey Murphy.  A glance at “First Known Kayak Landings” shows they were getting out to and landing many remote rocky places like Tuskar, Fastnet and the Hull.  Some of them are still at it.  Timmy Flavin et all landed and summited the Cow in 2012, a First Known Kayak Landing.   Jamie Young et al rounded Cape Horn in 1989.  Karen Weekes and Suzanne Kennedy rounded Ireland in 1990, unsupported.  1989 saw Ireland’s first symposium, camping on Clare Island, organised by word of mouth.  Everyone was amazed when so many turned up because noone knew there were 17 boats in the country.  Symposiums became regular annual events after that and Ursula McPherson kickstarted the Irish Sea Kayaking Association at one in Gartan in 1991.  The rest is history.    </p>\n","costalZone":"**The South Coast**"}