{"name":"**The Stags of Toe Head**","nameHtml":"<p><strong>The Stags of Toe Head</strong></p>\n","safeName":"The-Stags-of-Toe-Head","coordinates":{"irishGrid":{"sheet":"W","eastings":"150","northings":"246"},"fullIrishGrid":{"sheet":"","eastings":"115000","northings":"24600"},"tmcGrid":{"sheet":"","eastings":"514968.033","northings":"524672.721"},"geo":{"lat":"51.46831794","long":-9.22392238}},"cursor":37704,"description":"<p><strong>The Stags of Toe Head</strong> W150-246          Sheet 89 These rocks are 1.5<em>km</em> or so directly off Toe Head. They present one amorphous blob from the N, but from the E or W side they present their true character, which is three tall parallel reefs separated by creeks. The centre creek dries at low tides, giving the better chance of a landing as there are baylets on either side, to be chosen according to wind direction. There is no water; this is just a very exposed waystop. Nesting auks and gulls. Note especially the flag marker SW of the rocks, marking the ‘other end’ of the wreck of the ‘Kowloon Bridge’, reputedly the largest shipwreck in the world. Marvel at its size as the distance to the flag is considerable. Tides Tides run strongly in Stag Sound, between the Stags and Toe Head. A sustained westerly wind will extend the flood and weaken the ebb. Expect confused seas with wind over tide.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Stag Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">4:35 before Cobh HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">1:50 after Cobh HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Local HW/LW are about half an hour before Cork. Lough Hyne Lough Hyne, almost an inland salt-water lake, is Ireland’s first Marine Reserve. The lough is a pretty place, surrounded by hills covered by deciduous forests. Launch at a slipway on the northern shore. Commercial kayak businesses need a permit to operate on it. The Heritage centre in Skibbereen has a great video and touch tank to do with the lough and well worth a visit to learn about it. Good car parking.  No camping allowed. The interest of the lough to scientists lies in its deep, tidal, salt water in a controlled environment. Academics from universities all over Europe come to research the marine life to be found in the lough and its rapids. For instance, the lough boasts the biggest scallops found anywhere. It is much loved by divers, as depths of 45m can be had with good visibility close to the shore in a sheltered environment, although any disturbance of the silty bottom soon puts an end to the visibility. The necessary authorisation/permit may be had locally. The lough is famous for its night paddles, as there is excellent phosphorescence in the sheltered water. Tides The narrow entrance is known as The Rapids. The Lough fills for 4 hours and empties for the remaining 8 hours.  Typical of such a formation, the outgoing stream continues long after the tide outside has started to rise; the same happens in reverse although it is less pronounced.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"251\"><strong>Lough Hyne Rapids</strong></td>\n\n<td width=\"57\"></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">In</td>\n\n<td width=\"173\">3:20 before Cobh HW</td>\n\n<td width=\"57\">6kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">Out</td>\n\n<td width=\"173\">1:15 after Cobh HW</td>\n\n<td width=\"57\">6kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Local HW is about 20 minutes before Cobh. The inward flow is deeper and over a longer area than the outgoing.  Therefore though the speed is similar the outgoing is much the more turbulent. Beware playing on the outgoing flow because the bottom and walls are covered in mussels which are very sharp and downright dangerous. Standing waves worthy of the interest of surfers form on outgoing spring tides near LW.  The ingoing stream also makes for a good (deeper, safer) rush of water, also worthy of play.</p>\n","costalZone":"**The South Coast**"}