{"name":"**The Bull Rock**","nameHtml":"<p><strong>The Bull Rock</strong></p>\n","safeName":"The-Bull-Rock","coordinates":{"irishGrid":{"sheet":"V","eastings":"406","northings":"402"},"fullIrishGrid":{"sheet":"","eastings":"40600","northings":"40200"},"tmcGrid":{"sheet":"","eastings":"440584.427","northings":"540268.886"},"geo":{"lat":"51.59235574","long":-10.30092129}},"cursor":51818,"description":"<p><strong>The Bull Rock</strong> V406-402          Sheet 84 The Bull lies 4<em>km</em> WNW of Dursey Head, the headland at the outer tip of Dursey Island, itself 6<em>km</em> in length. This remote rock appears from Dursey direction as a mighty pyramid with a lighthouse complex on top. A landing on it by kayak is one of the top dozen or so obvious Irish challenges. A huge tunnel running E/W splits the Bull. The sides of the tunnel are even and smooth as glass. Navigation of the tunnel is undemanding.  A landing may be forced on the S side of the W entrance, though it leads nowhere. A number of offlying rocks, Gull Rock being the main one 100<em>m</em> W, form pleasant channels outside the W entrance, with wonderful scenery all round. The Bull is a significant breeding Gannetry, bigger than Saltee, second only to Little Skellig. Landing Landing is difficult. There is the standard platform with steps on the S side, at the foot of prominent steps leading vertically up to the lighthouse. However, at LW, the bottom step is a bit high off the water, and rock ledges on either side are subject to much movement of surge and scend. Unless very calm, the platform is wet, and boats should be tethered higher up, where there is generous space. Worst of all though, the spot is vulnerable to a strong sideways current, being entirely exposed. Any mistake will be severely punished. The SE corner of the rock is but a few seconds away, after which a swimmer will be in a full-blooded tide race. There is a severe landing spot on the S side of the E entrance to the tunnel, just tucked inside the SE corner. This is a gloomy spot, and there is nowhere easy to park a boat once off the water. Conditions on the day may demand this landing be used, if subject less water movement. The vertical band of 18 or so brass rungs up the sheer wall looks very off-putting, but in fact, there is a platform at the top with a path leading up to the lighthouse complex. Another set of vertical brass rungs set into the NE face, formerly reported as leading to a set of steps where one could continue towards the buildings, have in 2011 been cut away. Access can be gained to the area by shimmying up a grass ramp and climbing up the retaining wall on which the buildings are built. The manoeuvre is for people with climbing experience and a steady head, as one is forced out close to the drop over the tunnel. The only paddler known to have managed this move made it a tad safer by carrying a towrope by which she protected herself.  Kayakers landing on these “big rocks” are mostly cross-pollinated climbers, know they are taking risks, and most will consider taking a few slings and a bit of rope with them.   Tides Tides flow strongly past Dursey Head. On the ebb, a distinct line of smooth/rough water stretches unbroken all the way to the Calf, with the run off extending well out towards the Cow. Lea Rock lies just a cable or so off Dursey Head and considerable turbulence may be expected here. The ebb seems to run from the Head towards the Cow, or a bit north. The flood is the reverse. The flows are very strong off the corners of the outer islands.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between Dursey Head and The Bull</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">3:50 before Cobh HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">2:35 after Cobh HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Embarkation Launch from Dursey Sound or White Strand Quay, as described previously in the Dursey Island section. SPA Storm Petrel.</p>\n","costalZone":"**The South Coast**"}