{"name":"**Tramore to Dungarvan**","nameHtml":"<p><strong>Tramore to Dungarvan</strong></p>\n","safeName":"Tramore-to-Dungarvan","coordinates":{"irishGrid":{"sheet":"S","eastings":"060","northings":"007"},"fullIrishGrid":{"sheet":"","eastings":"206000","northings":"100700"},"tmcGrid":{"sheet":"","eastings":"605949.162","northings":"600755.781"},"geo":{"lat":"52.12425195","long":-7.29716295}},"cursor":29544,"description":"<p><strong>Tramore to Dungarvan</strong> S060-007 to W265-930               Sheet 76/82 Tramore town, beach and dune system is rightly known widely for many reasons.  The dune system with its back strand is a wonderful natural area, the beach is a surfer’s paradise, and the town has every amusement known to the holiday maker.  Use the pier in Tramore S576-004 for exploring the islands and coast west of Tramore. There is parking for a few cars on the pier and a good slipway. More parking is available a bit up the road. West of Tramore to at least Stradbally lies a particularly interesting stretch of coast that is very varied and interesting, comprising sea cliffs, groups of stacks, caves, arches and storm beaches that provide much visual interest. There is much to explore, and the geology is notable.  The rock is mostly red sandstone or conglomerate, and the coast has a history of mining for copper in the 1800’s, the “Copper Coast”. Some of the ventilation shafts are visible from the sea. The islands for the most part are steep and precipitous sea stacks with landings only onto rock shelves. The challenge is to summit and many require a party with some rock climbing experience.  The shore as far as Dungarvan is dealt with here cove by cove and island by island, always heading westwards.  The term “sheltered” may not always include for southerlies straight onshore, and common sense should be employed. Caher Beach     X548-983          Sheet 76 A truly stunning place with magnificent views, particularly westwards to Sheep Island.  The beach is stony, there is good parking and sheltered enough launching. The Beach here is more commonly known locally as Garrarus. Access to the beach has been blocked recently due to subsidence and is unlikely to be re-opened in the short term.</p>\n","costalZone":"**The South Coast**"}