{"name":"**Whiddy Island**","nameHtml":"<p><strong>Whiddy Island</strong></p>\n","safeName":"Whiddy-Island","coordinates":{"irishGrid":{"sheet":"V","eastings":"969","northings":"495"},"fullIrishGrid":{"sheet":"","eastings":"96900","northings":"49500"},"tmcGrid":{"sheet":"","eastings":"496872.17","northings":"549567.257"},"geo":{"lat":"51.68902785","long":-9.49160948}},"cursor":47189,"description":"<p><strong>Whiddy Island</strong> V969-495          Sheet 85 Step back in time when you land.  Whiddy exists in 1920s style, except for the oil storage facility in the WSW end.  With the otherwise exception of a lovely pub (with tennis court) the Bank House at the ferry quayside, the roads and fields are straight from a period film.  There is only one really nice swimming place, on a beach to the NE at V968-507, but no road goes there.  The scale of the mussel fishing on the E side has to be seen to be believed.  There seems to be a couple of batteries and forts, redoubts even, also up the NE, but any access seems private.  Even the public roads have occasional gates, presumably for convenience driving cattle.  There is the impression that if one got to know its ways, Whiddy would open up to the tourist, but all in all the day-tripper isn’t accommodated the way he might be used to on similar sized islands elsewhere. A bicycle is a worthwhile asset exploring the island on a day-trip.  All the roads are cul-de-sacs so walking would be wearisome eventually.  The oil storage is a “must see” with more than a dozen big containers housing the nation’s strategic oil reserves, that constantly vent and groan.  The big ships don’t come ashore anymore, so the jetty 300m off the WSW point is redundant and looks like a scene from a post apocalypse movie.  The S shore is prettiest, especially around the Kilmore Lakes.  Goats. The island is about 6<em>km</em> long and 2.5<em>km</em> wide. As late as 1880 it had a resident population of around 450, mainly engaged in fishing and small-scale farming. It currently has a permanent resident population of around 20 people, although there are many visitors in the tourist season. The island is linked to the mainland by the Ocean Star ferry, which runs return trips several times a day, and in summer, cruises around the island are also available. Landing Thre main landing spot is at the ferry quayside at Trawnahaha V969-495, on beaches either side.  In 2008 there was an artificial beach on the E side, courtesy of Conoco Oil, where a new slipway was put in to take the car ferry that services the oil storage facility.  Chance the mussels or chowder at the Bank House, splendid each. Circumnavigation Tides flow strongly between the island and Bantry.  Going clockwaise probably utilises the prevailing conditions best.  Much of the exploring en-route will be on the off shore satellites.  Going ashore is possible pretty much at will except for some parts of the long NW facing side.  Cusroe V966-485 is a nice sheltered spit.  There is a slip at V945-488 opposite the industrial scale pier V943-487, below a quick launch building similar to an RNLI station, only bigger, that probably houses an emergency fire fighting ship.  The jetty at V942-494 is to be looked at but kept away from, for fear it would fall on you.  The oil demesne extends over a third the way up the outward shore, and the first realistic stop might be at the stony cove V957-499 or V962-505.  However these coves, like any W facing cove hereabouts, catch the oil spillages, and are dirty underfoot.  Much nicer is the clean NE facing gravel beach at V968-507.  Rounding the corner brings the mariner into surely the greatest raft of mussel farms in the country.  These appear at first to be an obstacle but it is heartening to see the local yachts sail at breakneck speed through the gaps and channels between them.  Altogether the expedition is about 14<em>km</em>.</p>\n","costalZone":"**The South Coast**"}