{"name":"**Achillbeg Island**","nameHtml":"<p><strong>Achillbeg Island</strong></p>\n","safeName":"Achillbeg-Island","coordinates":{"irishGrid":{"sheet":"L","eastings":"720","northings":"924"},"fullIrishGrid":{"sheet":"","eastings":"72000","northings":"292400"},"tmcGrid":{"sheet":"","eastings":"471978.442","northings":"792415.098"},"geo":{"lat":"53.86537467","long":-9.9464599}},"cursor":115601,"description":"<p><strong>Achillbeg Island</strong> L720-924           Sheet 30 Thought by many to be among the finest of formerly inhabited islands off Ireland, a worthy rival to the Blaskets and the Inishkeas. Attractive. A fertile valley links two ice rounded hills to N and S, schist to the N and sandstone to the S. There is a row of cottages on the N slope of the valley and a disused schoolhouse on the S side. Of the 326 total acreage, there are 80 arable acres and 200 acres grazing. Geological evidence suggests the island was once joined to the mainland to the NE.  Sociological evidence suggests it was joined to Achill to the NW until much more recent times.  Ancient maps show similar townland and other place names shared with Achill and the mainland. More intriguingly, an old fort <em>Dún na gCurrach</em> (Dun Gurrough) L708-931 (with nearby <em>Dún Beag</em>) at the NW tip surely guarded the SE end of what must have been a narrow strip of land providing a NW passage between the two islands before the sea broke through. In the mid 1800s there was said to have been 200 people on the island, but the population was never more than 117 in the 1900s. There were 104 in 1900, and this was down to 67 in 1936 when the remaining people resisted evacuation and resettlement on Achill. Specifically in 1959, there were 8 pupils in the school, all brothers and sisters. The last 38 people all left during the 1960s. The island missed the worst of the blight that gave the Great famine of 1847. Edward Nangle hte missionary visited but did not proselytise here.  There was once poor turf in the NW but by 1880 or so all turf was brought in from Saula through Achill Sound, back breaking and dangerous work. Formerly Irish speaking, the island was entirely bilingual by 1900. The crossing of Achill Sound to the E of the island and Blind Sound to the N are often treacherous as both are exposed. Rabbits, plentiful on the mainland nearby, never made it here, though hares and foxes were plentiful. Rats invaded twice in living memory but the islanders trapped them and prevented a colony forming.  Badgers established themselves just before the islanders left. Stoats and hedgehogs were very occasionally seen, and mice only towards the very end. <em>Dún Chill Mór</em> a forked headland on the W side, is a triple fort with the outer, E, section at L709-926. The two inner citadels are on the two branches at L707-926 and L707-927. <em>Dún Chill Mór</em> (Dun Kilmore) is said to be the most elaborate promontory fort of the W Coast. It was started in the early Iron Age, and was inhabited by many cultures over a long period up to early Christian times. It is somewhat dilapidated through incessant Atlantic assault. Find it by walking W along the N side of the waist, past a storm beach and under a cliff, until the forked headland is identified. There are some remarkably attractive (70m) rock climbing cliffs at L714-922, though N-facing. Note also the early summer Mediterranean Heath (<em>Erica</em>). Landing The best landing is at a lovely sheltered sandy beach midway on the E side L720-924 called locally <em>Trabóderig</em> (the strand of the red cow). Landing is also possible on the NE side, but less easily. There is a new pier and steps 500m to the S of the main landing beach at L722-920 which provides deep water access to Achillbeg always, but is of little interest to very small craft. Camping. A “No camping” sign appeared at the main E facing beach in 2010.  It is understood though that kayakers in small numbers who enquire locally will be facilitated. There are also some storm beaches on the outside (W) of the island for those who favour the oceanic feel to their camping. Tides See below for tidal information for the southern entrance to Achill Sound. When there is sufficient depth of water in springs, Blind Sound between Achillbeg and Achill fills east when Achill Sound is flooding north and empties west.</p>\n","costalZone":"**The Mid-West**"}