{"name":"after Galway HW</td>\n\n<td width=\"57\">4kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n**Kilbaha to Loop Head**","nameHtml":"<p>after Galway HW</td></p>\n<td width=\"57\">4kn</td>\n\n<p></tr></p>\n<p></tbody></p>\n<p></table></p>\n<p><strong>Kilbaha to Loop Head</strong></p>\n","safeName":"after-Galway-HWtdtd-width=574kntdtrtbodytableKilbaha-to-Loop-Head","coordinates":{"irishGrid":{"sheet":"Q","eastings":"738","northings":"480"},"fullIrishGrid":{"sheet":"","eastings":"73800","northings":"148000"},"tmcGrid":{"sheet":"","eastings":"473777.862","northings":"648046.11"},"geo":{"lat":"52.56905991","long":-9.86200028}},"cursor":76561,"description":"<p>after Galway HW</td></p>\n<td width=\"57\">4kn</td>\n\n<p></tr></p>\n<p></tbody></p>\n<p></table></p>\n<p><strong>Kilbaha to Loop Head</strong> Q738-480 to Q686-471               Sheet 63 6<em>km</em> of unremitting cliffs. Kilbaha is a wild place, pretty, and remote. Best to approach by road from the N, the Bridges of Ross side. The coastal road along the estuary from Carrigaholt is often blocked at Rinevella Bay (Q823-497) by storm damage. The bay is closed out in stormy conditions, so the road is sometimes blocked with shingle or bigger. Note how Kilbaha Pier is constructed without any mortar at all. There are two pubs and basic facilities. The Lighthouse pub does excellent bar food. A paddle to Ross Bay or the Bridges means a short road walk back, allowing a mighty paddle with no logistics or shuttle. Kilbaha has slipway access with shelter from off-lying reefs sloping into the bay. A little hut with caves underneath marks the SW extent of Kilbaha Bay. The outermost 6<em>km</em> of the Shannon Estuary has the character of the coast outside it. Tides now play a significant role as wind from the S can cause unpleasant sea states. Along the striking cliffs towards the head are many narrow caves, including one cavern whose narrow entrance causes light to refract upwards through the water. Halfway between Loop Head and Kilbaha is Dunmore Head at Q718-466 where a sheltered break may be had inside. Dunmore Head is almost cut off, and is locally called Horse Island. There is a wonderful cave running N/S through the headland. There is a very steep storm beach just E of Loop Head where landing is possible in good conditions. SPA Peregrine, Chough.</p>\n","costalZone":"**The Mid-West**"}