{"name":"**Aughinish Island**","nameHtml":"<p><strong>Aughinish Island</strong></p>\n","safeName":"Aughinish-Island","coordinates":{"irishGrid":{"sheet":"M","eastings":"274","northings":"132"},"fullIrishGrid":{"sheet":"","eastings":"127400","northings":"213200"},"tmcGrid":{"sheet":"","eastings":"527366.409","northings":"713231.767"},"geo":{"lat":"53.16461334","long":-9.08621637}},"cursor":81951,"description":"<p><strong>Aughinish Island</strong> M274-132          Sheet 51 Uniquely in Ireland, Aughinish Island is separated by sea from the rest of its own county [Clare], while being joined by road to a different county [Galway]. Apparently, Aughinish was only ever completely cut off from the mainland for about 50 years. Of old, it was joined to County Clare at New Quay to the S. Then a destructive tidal wave, caused by an earthquake off Lisbon, Portugal on 1<sup>st</sup> November 1755, swept into the area with such force it broke that connection. The Lisbon earthquake is said to have been the most focussed destructive seismic event in recorded history, measured at 9.0 on the Richter scale and lasting seven full minutes (San Francisco 1906 was 7.8 and lasted 30 seconds).  For a time Aughinish remained an unattached island. But then the military constructed the Martello Tower (1804 – 1810) in fear of Napoleonic invasion. For access, they built a road across a causeway at M295-133 from the E, in County Galway. That <em>tsunami</em> also flattened Correnroe Castle to the SE at the head of Correnroe Bay. Thus is explained the puzzling position of an ancient ruined church on the SW, opposite the Clare coast.  The same event caused major destruction at Barley Cove in west Cork, leaving the extensive dune system behind now apparent. Circumnavigation This provides kayakers with an opportunity for a short but interesting circumnavigation without logistical problems. Aughinish Point at M274-132 is at the W tip of the island. For best conditions, the circuit is best done clockwise if launching on the ebb, or anticlockwise on the flood. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"251\"><strong>New Quay</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">E</td>\n\n<td width=\"173\">5:00 before Galway HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">W</td>\n\n<td width=\"173\">1:00 after Galway HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Avoid the southern side for the main part of the ebb, especially in a westerly as a truly awesome tide race is set up here in such conditions. It extends over the entire mouth of the bay and stretches from New Quay Pier to Aughinish Point and beyond. On the northern side of the island, the tides are not generally strong. However, a shallow bar extends from Deer Island ESE to a point northeast of Aughinish Island Martello Tower, where some rough water may be encountered. Until 1992, there was an old cannon, with emplacements, on top of the Martello Tower, but these are now gone. The top used to be reached with difficulty by climbing, but the tower is now a private residence. This is one of only three such towers built on the W coast. The others are at M241-117 Finavarra Point a few _km_s to the WSW, commanding the entrance to Ballyvaughan Bay, which still sports its gun, and at Rossaveal L956-238. The S side of the island was the scene of a tragic drowning on 29th June 1969, when 9 children, all from New Quay (except one from Kinvara), died when a boat overturned on its maiden sea trials. At the pier at New Quay, which was built by Nimmo, is Linnane’s Bar, renowned seafood bar and restaurant. <strong>County Galway</strong> The coast of S Galway consists of low-lying, deeply indented farmland on the N edge of the Burren area.</p>\n","costalZone":"**The Mid-West**"}