{"name":"**Ballyvaughan Harbour**","nameHtml":"<p><strong>Ballyvaughan Harbour</strong></p>\n","safeName":"Ballyvaughan-Harbour","coordinates":{"irishGrid":{"sheet":"M","eastings":"230","northings":"090"},"fullIrishGrid":{"sheet":"","eastings":"123000","northings":"209000"},"tmcGrid":{"sheet":"","eastings":"522967.346","northings":"709032.695"},"geo":{"lat":"53.12626493","long":-9.15097979}},"cursor":81087,"description":"<p><strong>Ballyvaughan Harbour</strong> M230-090          Sheet 51 The sea inside Ballyvaughan Harbour is very shallow and care is needed not to ground at LW, even in kayaks. In particular, spits of land enclose the Harbour, keeping it distinguished from Ballyvaughan Bay immediately outside to the North. The Harbour is enclosed from NW by ‘The Rine’, an attractive grassy spit that juts out NE from the shore W of the village, the tip of which is at M222-097, and from NE by Green Island M236-093, a breeding spot for mute Swan, the end of a rough marshy area jutting out from Bishops Quarter to the NE of the village.  The Rine is an attractive tourist walk and families often get cut off at HW.  Green Island is less attractive and generates less problems, if any. Gall Island M234-086 lies inside Rine and Green, a mere 200m off the new pier in Ballyvaughan M232-085 and shelters it.  With a huge LW footprint it was formerly a noted seaweed provider.  The harvest was formed into rafts and floated towards the collection point, beside the shed to its E. The shed is just off the main road at M238-084 and was the commercial hub of the enterprise.  It is now unused. Seaweed lost its commercial value in the early 1980s when an iodine factory at Maam Cross in Connemara closed. Camping at the village is very public, on grass in front of the Rent an Irish Cottages, or just W of the old quay M028-085. It may be possible elsewhere with permission. A better choice by far, is Bishop’s Quarter beach 1.5km NE at M245-095.  It is possible except at lowest waters to paddle inside Green Island all the way to Bishop’s Quarter. Ballyvaughan is a very pretty village, with all supplies. It is probably best known with tourists for the seafood in Monks Bar at the (old) W pier, and cakes and delicacies in the Tea Rooms nearby. There is also the commercial Aillwee Cave, 3<em>km</em> to the S inland.</p>\n","costalZone":"**The Mid-West**"}