{"name":"**Bartragh Island**","nameHtml":"<p><strong>Bartragh Island</strong></p>\n","safeName":"Bartragh-Island","coordinates":{"irishGrid":{"sheet":"G","eastings":"218","northings":"311"},"fullIrishGrid":{"sheet":"","eastings":"121800","northings":"331100"},"tmcGrid":{"sheet":"","eastings":"521768.13","northings":"831106.553"},"geo":{"lat":"54.22286423","long":-9.19965877}},"cursor":127748,"description":"<p><strong>Bartragh Island</strong> G218-311          Sheet 24 In all respects save one, Bartragh Island is a standard rivermouth dune system. The system stretches across the bay, is broken in the middle (through which the River Moy drains), shows standard surfing beaches to seaward, dunes all the way, and more sheltered backwaters to landward. On the E lies the town of Enniscrone, and on the W lies Killala.  In between is Bartragh Island. The one non-standard item is that the sea has broken through at Killala as well as at Enniscrone. Both piers, at Killala and at Enniscrone, are by Nimmo. The island itself is unremarkable. It runs 4<em>km</em> ESE/WNW. The backwaters are clean and pleasant because unusually they wash through, and sea-trout are apparent. There is always a channel between the island and the mainland. Stands of Sycamore try to survive in the dunes. Sheep abound. The highest area is at the W end. Two wrecks punctuate the view of unbroken sand and surf to seaward. Greenshank. Embarkation The easiest approach may be from Killala itself, at the pier down by the Coastguard Station. From here has been dredged a permanent channel, quite shallow at LWS but always navigable. It is muddy and unpleasant, a reminder of what the whole backwater would be like were the island not washed through twice a day. The widest part of the backwaters of the island, just outside the Killala channel, is called Killala Pool. The slip at Killala does not reach all the way down to the lowest LWs, and a carry over gooey mud to one side is sometimes called for. Hard by the launching spot is the local fishing co-operative fish shop, very good value and quality fresh and frozen seafood. The W side of the island may also be conveniently reached from a popular strand to the N at Ross G219-320, by the Killala Bar. <strong>The North-West</strong> <strong>Sligo to Malin</strong> <strong>County Sligo</strong> <strong>Sligo Bay</strong> Sheet 16 Sligo town has commercial and fishing boats trading from its harbour. Sligo Bay is really in two parts, an outer bay called Sligo Bay and an inner bay called Sligo Harbour. The two are separated by a narrow entrance, between Coney Island and Rosses Point, about 7<em>km</em> WNW of Sligo Town. The islands next described lie in the general area of this narrow entrance separating Sligo Bay from Sligo Harbour. SPA SPA designation attaches to nearby Ballysadare Bay to the S, (Whooper Swan, Golden Plover, and Bar-tailed Godwit), Sligo Harbour (Great Northern Diver, Whooper Swan, Golden Plover, and Bar-tailed Godwit), and Lissadell Strand in Drumcliff Bay to the N (Barnacle Goose, Whooper Swan, Golden Plover, and Bar-tailed Godwit). Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Outer Sligo Bay</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In (east)</td>\n\n<td width=\"180\">4:50 before Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out(west)</td>\n\n<td width=\"180\">1:15 after Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>A part of the flood branches off into Drumcliff Bay to the northeast and the main flood continues ESE all the way to Sligo Town. Closer to Sligo Harbour the flow rate increases, peaking about 1km inside Sligo Harbour, north of Oyster Island, at up to 6kn in springs. The flood divides at the Metal Man, mid-harbour entrance. The main flood flows east through the shipping channel north of Oyster Island and on towards Sligo. A strong secondary flow passes between Oyster and Coney and circulates anti-clockwise around the deep pit just south of the western point of Oyster. The ebb reverses all this. There are significant danger areas hereabouts. With wind over tide, which usually means the ebb, quite a sea state is generated in the main channel north of Oyster Island and also between Oyster and Coney Islands, in the region of the Metal Man. There is a submerged spit curving out from the northern end of Coney Island at about G615-399 to Black Rock at G598-401. This is partially exposed at LW. In any sort of sea, there are big breaks here and on the sandbanks on its northern side. Embarkation For all the islands, launch from the slipway just W of the RNLI station at G631-397. There is good parking above the RNLI Station. The pier and slipway are used by local fishermen and for boats accessing the cruiser yachts moored in the bay in summer.</p>\n","costalZone":"**The Mid-West**"}