{"name":"**Bills Rocks**","nameHtml":"<p><strong>Bills Rocks</strong></p>\n","safeName":"Bills-Rocks","coordinates":{"irishGrid":{"sheet":"L","eastings":"551","northings":"938"},"fullIrishGrid":{"sheet":"","eastings":"55100","northings":"293800"},"tmcGrid":{"sheet":"","eastings":"455081.967","northings":"793814.874"},"geo":{"lat":"53.87350445","long":-10.20382036}},"cursor":116284,"description":"<p><strong>Bills Rocks</strong> L551-938           Sheet 30 The Bills Rocks lie 11<em>km</em> due S of Keem Strand (F562-043) on Achill Island. Keem is pronounced ‘Kim’ locally. This is the nearest launching point for a trip to the Bills. Larger groups might prefer Gubalennaun Beg quay at F623-036 (locally “Purteen”) where there is easy parking and no surf. This option adds 1<em>km</em> to each leg of the trip. The Bills comprise three large, steep-sided, grass-covered rocks. The largest rock has a grass covering of approximately half a soccer pitch. The ground is relatively level and could be camped upon, but it is completely exposed and it would probably be foolhardy unless you were sure of settled weather. Landing It is possible to land on the largest rock, which is the most northerly. On the southern side is a long, sloping cliff to the top. The gradient here is approximately 50º and while it might be easy for a rock climber, it could be quite challenging in canoeing gear or wet weather. The landing should only be attempted in calm weather and is best at LW, when there is an obvious ledge approximately 2m above water level, which can be accessed by a large, ‘easy to climb’ crack. It would be prudent to have a light kayak for this endeavour. There is probably only enough room for three kayaks on the ledge, which limits the size of the landing party. Kayaks can be left on the ledge and tied to the rock face using rock-climbing chocks. From the ledge, a large fissure runs diagonally from bottom left to top right and the top of the rock face. There are obvious handholds along the crack and it would probably be graded a ‘diff’ in old rock climbing parlance. If you have the skills, the climb is worth it. At the top, you really feel exposed, miles from anywhere on a rock in the sea. It is an airy feeling. There are great views back up to Achill while to the SE, the exposed western coasts of Clare Island, Inishturk and Inishbofin are visible. The trip is a brilliant day paddle. It is worth circumnavigating the rocks. There is a beautiful arch to the W.</p>\n","costalZone":"**The Mid-West**"}