{"name":"**Black Rock**","nameHtml":"<p><strong>Black Rock</strong></p>\n","safeName":"Black-Rock","coordinates":{"irishGrid":{"sheet":"F","eastings":"483","northings":"156"},"fullIrishGrid":{"sheet":"","eastings":"48300","northings":"315600"},"tmcGrid":{"sheet":"","eastings":"448283.518","northings":"815610.096"},"geo":{"lat":"54.06725442","long":-10.31795617}},"cursor":120035,"description":"<p><strong>Black Rock</strong> F483-156           Sheet 22 The rock is known to locals as <em>Tór Mór</em>, and to Irish Lights as Black Rock. Like Eagle Island, Black Rock is a prominent lighthouse rock on which landing is impossible in most conditions. This, along with the fact that it is over 11<em>km</em> offshore and steep-sided, makes it essential that any visit is undertaken in (very) settled weather. Black Rock rates as one of the classic sea kayaking destinations in Ireland. It is a most dramatic and beautiful place to visit if kayakers get the right conditions in late April-May. Landing A landing is possible near the steep, carved steps on the SE side of the rock, with very low swell conditions and an unladen (or someone else’s, plastic) boat. There are 3/4 options from mid to high tide but only one at lower tides, about 20m from the sea-arch. There is a jetty at the E end, but there is often too much movement there. In the  right conditions (very settled!) the easiest landing is by the  jetty, where convenient rock platforms, especially at LW  allow “seal” type landings in addition to to the  jetty itself. The jetty is only place where kayaks can be easily managed. All other landings are very “physical” in terms of making boats secure and require a fit crew to lift and haul kayaks clear.  All steps and approaches from all 4 possible landing points are steep and in some cases in poor condition. All landings are very steep, in deep water, with any waves giving a lot of vertical movement. This gives a real risk of a bad bang if the boat hits any rocky outcrops while dropping with the waves. So, even in the calmest conditions, landing cannot be assumed and it is recommended to keep lunch handy to eat on the water before the long, open disappointed crossing home. After a successful landing, the boats must be hauled up the steep rock and tied to the iron stakes near the steps, which were probably chiselled into the rocks in the 19<sup>th</sup> Century. The walk to the top is steep. Launching is, as always, much easier. Always ask Irish Lights for permission for landing at a lighthouse. There is rough camping, but this is not advised, as lighthouse keepers have been known to wait months to be taken off after their stint of duty here. Bill Long states that it is reputed to be the ‘most difficult of the lighthouse rocks on which to land; totally inaccessible at times, either by boat or by helicopter’. No water. On a day trip, embark from Fallmore at F614-183 or Portglash beach at F612-202, for a 12<em>km</em> journey on a bearing of about 250<sup>o</sup>. If based on the Inishkeas, the distance is 8.5<em>km</em> at 235<sup>o</sup> from the western end of the sound between the N and S Islands at F556-218. Tides Departing from the Inishkeas, the only relevant tide is the main west coast tidal stream, which floods north from 3:20 before Galway HW until 3:05 after and the ebb in reverse. For a departure from the Inishkeas, a good strategy might be to leave at or after local LW, taking advantage of the last of the south-going stream, to arrive at slack and allowing a return after the start of the north-going stream. At least close in to the rock, tides run strongly, possibly 2kn. Paddlers report having to ferry glide to avoid being swept past. On Black Rock itself, the light character is FL WR 12s 86m 22/16M, i.e. flashing, white &amp; red sectors, every 12 seconds, height 86 metres, visibility 22 nautical miles in the white sector and 16 nautical miles in the red sector. It was, until recently, an acetylene gas light, one of the very few in Ireland or Britain. It was converted to acetylene from incandescent paraffin vapour in 1974 when it was automated. The acetylene system was decommissioned to a museum in Wexford in 1999 and replaced by solar power. In 1940, the S.S. Macville was attacked by a German bomber close to the Rock, shattering the lighthouse panes and damaging the roof. There are impressive, recently renovated dwellings of cut stone which was quarried from the rock. Amazingly, lighthouse keepers and their families lived here for 29 years until 1893. Then, dwellings for the families were built at Blacksod and the keepers would stay in shifts on the Rock in the years until the light was automated.</p>\n","costalZone":"**The Mid-West**"}