{"name":"**Caher Island – _Oileán na Cathrach_**","nameHtml":"<p><strong>Caher Island – <em>Oileán na Cathrach</em></strong></p>\n","safeName":"Caher-Island-–-_Oileán-na-Cathrach_","coordinates":{"irishGrid":{"sheet":"L","eastings":"665","northings":"759"},"fullIrishGrid":{"sheet":"","eastings":"66500","northings":"275900"},"tmcGrid":{"sheet":"","eastings":"466479.528","northings":"775918.707"},"geo":{"lat":"53.71584208","long":-10.02286692}},"cursor":109422,"description":"<p><strong>Caher Island – <em>Oileán na Cathrach</em></strong> L665-759           Sheet 37 A lovely island, and a must for the passage maker, Caher is 8<em>km</em> out from the shore and 11<em>km</em> SW of Roonah Quay. On the SE of the island is a brackish lake and on the NW high point is a well – St. Patrick’s Well. The island is uninhabited and ‘belongs’ to Inishturk, the people of which have the commonage grazing here. There is a fine 5<sup>th</sup> Century monastic ruin and crosses, close to the landing, which are used for the annual pilgrimage to and ‘pattern’ on the island. A pattern is an ancient rural Irish Catholic prayer tradition. A circular wall 1.5m high and 20m in diameter, now broken in places, forms a “cashel”. Inside is a wee oratory. The island is the alleged resting place of Saint Patrick. His bed is outside the oratory, a flat stone half covered in mud and grass. The ‘floating’ stone is still there in the oratory, and will always return to the island, even if stolen. There is also an ancient prayer/wishing bowl. Unfortunately, some holy stones seem to have gone missing in recent years.  The altar stone depicted in Oileáin behind the monies offerings platter was not there in 2008. And beware the thief, whose boat will sink. Some work has been done to re-create the Stations of the Cross and a new “old” one is now visible on the ground behind the E wall of church. The monks lived in terror of the Vikings from 800 or so to about 1,000. By 1,500 they had Algerine slavers to worry about. All the while they starved in winter. Their faith must have been enduring. Landing and Camping Land on the SE, or at Port Temple in a shallow bay below the ruins of the church, just NW of the eastern tip. There is another, in some ways better, landing on the SW side. It is difficult to find until very close, and consists of a narrow inlet, which turns to the right after a few metres. The land just opposite is probably the best for camping. The holy well is unsuitable for drinking water. Bird life Bonxie breeding. Lovely island.</p>\n","costalZone":"**The Mid-West**"}