{"name":"**Carrigaholt to Kilbaha**","nameHtml":"<p><strong>Carrigaholt to Kilbaha</strong></p>\n","safeName":"Carrigaholt-to-Kilbaha","coordinates":{"irishGrid":{"sheet":"Q","eastings":"849","northings":"511"},"fullIrishGrid":{"sheet":"","eastings":"84900","northings":"151100"},"tmcGrid":{"sheet":"","eastings":"484875.45","northings":"651145.373"},"geo":{"lat":"52.59936472","long":-9.69945012}},"cursor":76170,"description":"<p><strong>Carrigaholt to Kilbaha</strong> Q849-511 to Q738-480   Sheet 63 15<em>km</em> of varied coastline. The bay S of Carrigaholt is Kilcredaun and has an isolated stone beach below the Irish College visible above. The well-preserved Carrigaholt Castle is prominent on the point SE of Carrigaholt. There is a battery on top of Kilcredaun Point at Q850-494. Six such batteries were built towards the end of the Napoleonic Wars to guard the estuary against a French invasion. They were built in matching pairs. This one is matched by a similar construction on the Kerry side at the Cliffs of Dooneen at Q885-478. Upstream, the next two are at Scattery Island and Carrig Island. The last two are at Kilkerin Point and Tarbert Island, where the estuary is at its narrowest and most tortuous. Batteries were a more formidable proposition than Martello Towers. Martello Towers are a common feature on the E coast, but there are only two on the W coast. Both of these are in N Clare. Batteries were D  shaped or semicircular, and had much bigger armaments. These normally included 2 howitzers on the roof of the blockhouse and 6 guns along the outer perimeter. Typically, a battery also had a dry moat and a drawbridge. Scattery Island battery is in good condition although access to the roof is no longer possible. Kilkerin Point has been renovated in recent years. A school of porpoise and Bottlenose Dolphin are resident between this point and the Kerry coast for a number of years. They make full use of the sweeping tides to feed and frolic.  A credible eco-tourism industry has set up around these pods. Rinevella Bay has a pebble beach with a sunken bog and forest at its western extremity at Q817-493. Next, Rehy Hill at Q801-484 slopes gently into the water. Kilcloher Head at Q773-474 has a cave and marks the end of an impressive section of cliffs, including some long narrow caves and ‘The Opera House’ – undercut layers of rock sloping into the water.  Land at the pier, Nimmo’s prettiest according to some. Tides Tidal streams are strong at Kilcredaun Head at Q851-493 where the estuary suddenly narrows and turns southwest after its long westerly progression to the Atlantic. Locals say the ebbing spring tide reaches 4kn.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Kilcredaun Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NE</td>\n\n<td width=\"170\">5:20 before Galway HW</td>\n\n<td width=\"57\">4kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SW</td>\n\n<p><td width=\"170\">0:50</p>\n","costalZone":"**The Mid-West**"}