{"name":"**Chapel Island – _Oileán an Teampaill_**","nameHtml":"<p><strong>Chapel Island – <em>Oileán an Teampaill</em></strong></p>\n","safeName":"Chapel-Island-–-_Oileán-an-Teampaill_","coordinates":{"irishGrid":{"sheet":"L","eastings":"531","northings":"410"},"fullIrishGrid":{"sheet":"","eastings":"53100","northings":"241000"},"tmcGrid":{"sheet":"","eastings":"453082.285","northings":"741026.365"},"geo":{"lat":"53.39891603","long":-10.20928683}},"cursor":101320,"description":"<p><strong>Chapel Island – <em>Oileán an Teampaill</em></strong> L531-410           Sheet 44 Chapel is a lovely island with pleasant camping and a hint of fresh water in slightly brackish pools. The 12<sup>th</sup> Century chapel founded by Saint Caillin at L531-410 itself is interesting, and boasts a collection teapot. In early 2003 there were no Euro coins yet evident, but in 2005 there were a few, probably indicating that not many pass this way. There is a lovely attractive bothy at a tidal lagoon on the S side, found in 2005 to have been done up. Chapel Island and Duck Island are separated by a narrow channel, open at all stages of the tide. The channel is easier found from the N. It passes immediately under the chapel. Landing The main landing on Chapel Island is on the south-western side at L528-408, almost facing Illaunamid. A landing may sometimes be had under the chapel, probably better at LW. Birds In March 2003, the following species were seen. An asterisk after the name indicates that they were probably breeding. There were seen 50+ Purple Sandpiper which is a nationally important number. There were also 40+ Oystercatcher<em>, 30+ Ringed Plover</em>, 10 Redshank, 1 Merlin, 6 Shelduck<em>, Raven, Skylark, Black Guillemot, Shag, and 20+ Swallow</em>. In March 2003, there were 40+ Grey Seal. At the same time on Chapel, 3 male and 1 female Eider were seen, and on nearby Horse Island another male, suggesting breeding. This would, if proven, be the southernmost outpost of breeding Eider on Ireland’s W coast as of summer 2003. The official such record is Inishkeeragh, Mayo. Eider are expanding southwards year by year, and it is thought that Mink disturbance is the cause.</p>\n","costalZone":"**The Mid-West**"}