{"name":"**Clare Island**","nameHtml":"<p><strong>Clare Island</strong></p>\n","safeName":"Clare-Island","coordinates":{"irishGrid":{"sheet":"L","eastings":"715","northings":"852"},"fullIrishGrid":{"sheet":"","eastings":"71500","northings":"285200"},"tmcGrid":{"sheet":"","eastings":"471478.516","northings":"785216.662"},"geo":{"lat":"53.80060226","long":-9.95104805}},"cursor":109966,"description":"<p><strong>Clare Island</strong> L715-852           Sheet 30 14.1 sq.<em>km</em>. A beautiful, large, high, dramatic, inhabited island, dominating the mouth of Clew Bay. There is a regular ferry service <a href=\"http://www.clareislandferry.com/\">www.clareislandferry.com</a> from Roonah Quay at L744-808. Hire bikes or bring your own.  The population of the island is about 150 in winter, and double that in summer. There are several B&amp;Bs. Basic provisions are available and there are limited facilities – a pub, hotel, public phone and even a nurse. There is a new hostel <a href=\"http://www.goexplorehostel.ie/\">www.goexplorehostel.ie</a>, with bar and fish restaurant, the fish caught daily by the manager. There is a “no booze inwards” policy here as elsewhere, and any drinking must be done at the bar. The island is well worth a special visit. It is the highest of the truly offshore islands of Ireland. Knockmore at 462m gives spectacular views of the Mayo coast and falls almost sheer to the sea. Corncrake have not been heard since 1988 except for a single calling bird in 2002. Landing and Camping Land by the recently much extended and improved pier at L715-852 by the main harbour near the SE tip. The pier is just by an old, square castle, being one-time HQ of pirate-queen Granuaile who ruled the western seaboard. Camping is in the campsite in the field behind the beach. There is a small charge for this facility and it includes access to the toilets in the community centre just across the road. If utilising the camp site it makes more sense to land on the beach rather than the pier. L693-843        This is a significant landing on a gravel beach beside a broken pier. It is about halfway along the S coast at Portnakilly. It is not apparent until close and is situated below a conspicuous church and ruined 12<sup>th</sup> Century Abbey. This has been recently restored. It is early Cistercian, pre-Norman, pre-English and pre-Granuaile. There is a well-stocked Co  op shop, but it is a long way to the pub at the harbour. L703-877        Near the northern tip of the island, landing is also possible on the north-eastern side, about 1<em>km</em> SE of the tip, in a well-sheltered cove. Unfortunately this cove is not dependable as swell can make landing very difficult, but it is worth a look. The cove is about halfway between a prominent boulder beach and the disused but conspicuous lighthouse on the northern point of the island. Landing is onto a steep slip, or onto a sheltered breakwater. This landing is of interest on circumnavigation, or for its green road giving convenient access to the interior. Space for boats at the landing is limited.  Larger groups should consider leaving tethered boats floating on the water. Circumnavigation A circumnavigation is a memorable experience, but a serious undertaking. There are long sections without reliable landings, particularly from Portnakilly on the southern side, all the way through the SW and N to the landing spot on the NE. There is an inlet on the southern side of the island, 1<em>km</em> E of the south-western tip. Locally called Lackwee, it is exposed to the SW but otherwise sheltered.  There is always strong tidal effects at the N, E &amp; SW points. Rock Climbing The first rock climbing on the island was pioneered by Gerry Moss in 2013 at L665-843 about 5km from the pier along the south shore. Tides Tides flooding into Clew Bay flow east on the northern side of the island and northeast on the southern side.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>North of Clare Island</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"180\">5:30 before Galway HW</td>\n\n<td width=\"57\">0.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"180\">0:40 after Galway HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>South of Clare Island</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NE</td>\n\n<td width=\"180\">5:30 before Galway HW</td>\n\n<td width=\"57\">1.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SW</td>\n\n<td width=\"180\">0:40 after Galway HW</td>\n\n<td width=\"57\">0.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The ground on the southern side is shallow. Both passages, particularly the northern side, kick up when the ebb is against the prevailing westerlies. If on passage north, catching the flood combines well with the tides into and through Achill Sound, but care is needed on passage south. Flora and Fauna Robert Lloyd Praeger the greatest ever Irish naturalist, organised probably the greatest ever survey of a particular area ever conducted in Ireland. From 1909 to 1911, 100 scientists from all over Europe put Clare Island under the microscope. Once again (Praeger had gone this way on the less remote Lambay Island off Dublin a few years before), they found no new Galapagos, where species change and adapt in a remote environment over time. They did though recognise 9,000 organisms overall, including 109 animals and 11 plants new to science. Granuaile In the 16<sup>th</sup> century, Grace O’Malley – <em>Gránúaile</em> – sea-queen of western Ireland, was based here at Clare. Her castle dominates the landing at the pier in the quiet bay on the E side. The O’Malley motto was “invincible on land and on sea”. <em>Gránúaile</em> took that seriously. She tolled every ship that came her way, Irish or not. Famously, she sailed to London to visit the queen, Elizabeth. She was well received. She offered her “tolling” services to the British, in what sounds like a somewhat mercenary arrangement. She used and abused her femininity and particularly her husbands – she had three – to gain territory and advantage generally.</p>\n","costalZone":"**The Mid-West**"}