{"name":"**Clynagh Island _– An Cladhnach_**","nameHtml":"<p><strong>Clynagh Island <em>– An Cladhnach</em></strong></p>\n","safeName":"Clynagh-Island-_–-An-Cladhnach_","coordinates":{"irishGrid":{"sheet":"L","eastings":"941","northings":"342"},"fullIrishGrid":{"sheet":"","eastings":"94100","northings":"234200"},"tmcGrid":{"sheet":"","eastings":"494073.613","northings":"734227.487"},"geo":{"lat":"53.34765137","long":-9.59090993}},"cursor":88426,"description":"<p><strong>Clynagh Island <em>– An Cladhnach</em></strong> L941-342           Sheet 45 Large islet, formerly farmed, no farmhouse found.  Land as wished. Bog. Furze.  Deep turf. Water was found in a boggy stream flowing into the deep cut on the N side L940-340. Camping is possible on the E side of the cut. A path dissects the island E/W midway N/S.  It is roughest at the E end, to the point of impassibility. There are a couple of areas to be careful of in Camus Bay. Upper Camus Bay fills and empties through a very narrow neck at <em>Snámh Bó</em>, where there is a very strong fall on springs. This is at L935-360, near Dunmanus Island where roads come down to the shore on both sides. Local HW at the top of Camus Bay can be up to 3 hours after that on the mouth. Pillars mark the channel <em>Snámh Bó</em> down to <em>Béal an Daingean.</em> The fastest flow is between Clynagh Island – <em>Oileáin Cladhnach</em> and Camus Eighter <em>– Camus Iochtair</em> to the east. <em>Turas kayak i gConamara</em> <em>Lá deas gan mórán gaoithe a bhí ann, i Meitheamh, chuaigh muid amach siar ó thuaidh do Cheann Gholaim go dtí Carraig Iolra. Chuaigh muid i dtír ag spaisteoireacht. Bhí sé lán le faoileáin agus guillemots, neadracha agus éanacha óga.</em> <em>Dúleac na Foiriúin. Chuaigh muid uaidh sin siar go Carraig na Meacain, áit a bhí lán le cailleachaí dubha agus éanachaí óga agus neadracha. Bhí Dún Gudail agus Scéird Mhór le feiceáil siar uainn ach ní shin é ár dtreo inniu. Tréis greim le n-ithe, thug muid cuairt ar na Foiriúin agus ár n-aghaidh soir aríst i  dtreo Ceann Gholaim. Ar an mbealach ar ais dúinn dhúin sé isteach ina cheo ach bhí mapa agus compás againn agus bhí muid gar do Cheann Golaim nuair a ghlan sé arís.</em> <em>Chuaigh muid i dtír ar Cheann Gólaim agus fuair muid buideál plaisteach  a raibh nóta agus broisiúr ann , gasúir scoile a chur i bhfarraige éi Roddington, Newfoundland, (Talamh an Éisc). Chuir muid litir chucu ach ní bhfuair muid aon fhreagra. Chuaigh muid suas thar Fraochoileán Mór ar a raibh caiple, idir Crapach agus Fraochoileán Beag chomh fada le Inis Eirc. Champáil muid ar an taobh shiar theas don oileán. Oileán shuimiúil é seo. Tá an t-oileán tréigthe óna seascaidí ach tá bail mhaith ar na tithe fós agus díon ar roinnt acu.</em> <em>Larna mháireach bhí an la deas tirim ach bhí gaoithe láidir aniar aduath ann. Chuaigh muid suas ó thuaidhtaobh thoir do Inis Eirc agus idir Daighinis agus Foirinis. Bhí foscadh deas anseo againn agus Daighinis ag breathnú go hálainn. Ach bhí se ró luath le stopadh arís agus choinnigh muid orainn chomh fada leis an Oileán Iartharach áit a ndeacha muid i dtír le haghaidh an áit a fheiceál. Tá an t-oileán seo tréigthe óna caogaidí. Tá ballaí na dtithe fós ann. Bhí tobar ann ach tá sé fásta thimpeall air.</em> <em>Chuaigh muid uaidh seo siar idir Bior Beag agus Bior Mór go dtí Inis Muscraí, nó Spike mar a thugtar air freisin agus as seo go hOileán na Lachan an áit a ndeacha an St Oiliver ar na carraigreacha droch thrathnóna le báisteach agus gála. Cailleadh an criú. Is beagnach carraig uilig an t-oileán seo agus  tá poll uisce istigh ina lár agus chonaic mé cupla uair san samhradh é agus dath bándearg  a bhí ar an uisce. Chuaig muid uaidh seo go Maisean, ceann des na hoileáin is deise ar fud an chósta. Bhí scoil ar an oileán seo agus roinnt mhaith tithe agus talamh níos saibhre ná ar an mórthír. Bhí clocha maith ann le haghaidh tógál agus ceardaithe maith lena n-úsáid mar atá le feiceál sna tithe agus san gcéibh. Sé an trua go dtriomaíonn sé. Tá sean iarsmai ann agus cill bheag.</em> <em>Champáil muid anseo le haghaidh na hoíche agus tréis dinnéir bhí tine againn gar don trá, deoch fíon 7rl le n-ól agus cainnt agus comhrá agus ag baint sult as an saol go ndeachaigh muid a chodladh, thart ar meán oíche mar bhí lá eile romhainn amáireach. Tá sé mar cheann de rialacha ISKA gan do lorg a bheith fagtha i do dhiaidh agus sul a ndeachaigh muid chun farraige ar maidin ghlan muid suas áit na tine agus marach go raibh pictiúir againn di, ní bheadh fhios agat go raibh tine ariamh ann.</em> <em>Thug muid a n-aghaidh siar go hOileán Mhic Dara. Ní fhéadfadh muid dhul abhaile gan é a fheiceál. Oileán deas a bhfuil stair ag baint leis, seipéal cloch agus iarsmaí eile. Shiúil muid timpeall an oileáin siar go dtí an taobh thiar don oileán áit ar a  dtugtar maidhm (spout) an tairbh. Nuair a bhíonn an fharraige suaite agus an taoille ag an aoirde ceart briseann sé in airde san aer. Ar an mbealach ar ais dúinn chonaic muid húicéara ag teacht anoir agus in omós don nós atá ann leis na cianta, chrom sé na seolta ag dul thar an oileán.</em> <em>Ag an am seo bhí sé in am againn na seolta a chrochadh mar bhí píosa maith le dhul againn. Ag an am seo bhí an ghaoithe aniar aneas agus thug muid a n-aghaidh soir le cóir na gaoithe. Nuair a bhí muid imithe thar poinnte na hÁirde Móire níor airigh muid go raibh muid soir ó dheas do Inis Treabhair áit a ndeachaigh muid i dtír. Bhí greim le nithe againn agus comhrá le Patsy Lydon, fear a bhfuil fáilte i gcónaí aige romhainn agus am aige labhairt linn. D’fhág muid slán ag Patsy agus choinnigh muid orainn suas Dún Manus, go ceann scríbe Camus na Foirnéise.</em></p>\n","costalZone":"**The Mid-West**"}