{"name":"**Coney Island**","nameHtml":"<p><strong>Coney Island</strong></p>\n","safeName":"Coney-Island-22","coordinates":{"irishGrid":{"sheet":"R","eastings":"326","northings":"626"},"fullIrishGrid":{"sheet":"","eastings":"132600","northings":"162600"},"tmcGrid":{"sheet":"","eastings":"532565.131","northings":"662642.624"},"geo":{"lat":"52.71069433","long":-8.99796971}},"cursor":73598,"description":"<p><strong>Coney Island</strong> R326-626          Sheets 57/58 Second largest at about one and a quarter square kilometres of the larger islands locally, and perhaps most attractive, Coney is by far the tallest at 59m. On the summit are a trigonometrical station and a more attractive monument. The latter is said to have been erected by the then landowner to his son who was killed in the Boer War at the turn of the 19<sup>th</sup> century, probably fighting for the British. The monument is slightly squways. Local lore has it that in 2004 when President Bushe of the U.S.A. visited Ireland, there was a massive security operation around Shannon Airport, about 4<em>km</em> away. Irish soldiers making security checks interfered with it, in case it was hollow or the like, but didn’t do a good job putting it back together. Pity. The main landing spot is a jetty and slip at the W side. The slip reaches out as far as all but the lowest LWS. There are several houses all now boarded up. Farmers commute here by day on the tide from Crovraghan Pier. Cattle, sheep and horses are stocked. There are two old churches, both at the SE, and one graveyard is still in limited use. A network of boreens criss-cross the island. From the summit, the very best views of the estuary hereabouts are achieved, up to Ennis, down to Aughinish aluminium plant on the limerick side, and of course Shannon Airport to the E, planes taking off every few minutes. It seems out of place in so rural a setting. The passage between Coney and Inishmore dries out at just under half tide height.</p>\n","costalZone":"**The Mid-West**"}