{"name":"**Davillaun – _Damhoileán_**","nameHtml":"<p><strong>Davillaun – <em>Damhoileán</em></strong></p>\n","safeName":"Davillaun-–-_Damhoileán_","coordinates":{"irishGrid":{"sheet":"L","eastings":"586","northings":"663"},"fullIrishGrid":{"sheet":"","eastings":"58600","northings":"266300"},"tmcGrid":{"sheet":"","eastings":"458581.153","northings":"766320.843"},"geo":{"lat":"53.62757249","long":-10.13806975}},"cursor":107505,"description":"<p><strong>Davillaun – <em>Damhoileán</em></strong> L586-663           Sheet 37 Called locally Ox or Stag Island. Land in small cove on the southern side, about at the middle. The cove is SE facing and not obvious until close. Alternatively, there is a difficult landing onto rocks on the E side at half to full tide. Overgrazed by sheep to the point of barren-ness.  Good camping spots everywhere but some sheltered spots are marshy. No drinking water. Uninhabited. The island is exposed to any swell that is going and often throws up huge waves and breakers off the E and W sides. Interesting paddling, at the W end where a small channel separates the island from Ox Island. There are channels and inlets and arches and blowholes and caves on both sides of the W end, especially the N-facing side. Offlying Lecky Rocks L597-601 1<em>km</em> to the SE are an interesting pitstop, being halfway between Cleggan and Inishturk.  The easiest to land on will usually be the more W rock, which has a large footprint and is well fractured, providing a calm option under many conditions.  The highest rock is small and has a smooth periphery, landing being hard.</p>\n<h2>Ox Island</h2>\n<p>L581-663           Sheet 37 Just W of Davillaun and separated by a narrow channel, which may dry at LWS but is worth a look at HW for a series of low sea arches on the Davillaun side. The island is bigger than it appears from the sea and consists of a series of low ridges and hollows. Sheep grazed, making camping attractive. Landing is easiest onto low rock ledges at the SE corner near the channel. <strong>Mayo</strong> <strong>Killary Harbour to Killala</strong> <strong>County Mayo</strong></p>\n","costalZone":"**The Mid-West**"}