{"name":"**Doolin to Ballyvaughan**","nameHtml":"<p><strong>Doolin to Ballyvaughan</strong></p>\n","safeName":"Doolin-to-Ballyvaughan","coordinates":{"irishGrid":{"sheet":"R","eastings":"057","northings":"970"},"fullIrishGrid":{"sheet":"","eastings":"105700","northings":"197000"},"tmcGrid":{"sheet":"","eastings":"505671.049","northings":"697035.382"},"geo":{"lat":"53.0156954","long":-9.40581874}},"cursor":80398,"description":"<p><strong>Doolin to Ballyvaughan</strong> R057-970 to M228-083   Sheet 51 The famous Burren area is a geological phenomenon, being 1,000<em>km</em><sup>2</sup> of ‘karst’. This comprises exposed limestone rock pavements, crags, escarpments, sea cliffs, caves, and above all, flowers. <strong>Flora</strong> – the Burren is profuse with rare wild flowers. Some of these are not otherwise found N of southern latitudes, while others are not found S of northern latitudes – here, they are side by side. The Burren shelves or drops vertically into the sea from Doolin to Ballyvaughan, with landings few and far between. <strong>Climbing cliffs</strong> – halfway between Doolin and Fanore is the famous climbing sea-cliff of Ailladie at R092-034, developed since 1972. It is probably second only in popularity in Ireland to Dalkey Quarry in Dublin. The tallest smooth section is Mirror Wall, with the only apparent weakness being The Ramp [E1 5b] winding up from bottom left to top right, pioneered by Dermot Somers. The cleanest of the series of square-cut corners just S of Mirror Wall is <em>Pis Fliuch</em> [HVS 4C], a committing layback. It is very much amongst the best of Jimmy McKenzie’s many fine legacies to Irish climbing. Further S by about 100m or more, look for the prominent Great Balls of Fire [E1 5b], said to be Brian Walker’s best. It is the obvious fist-sized crack rising to two  thirds height from a ledge just above sea level; the escape is left and up. There are other cliffs, large and small, between Doolin and Ailladie, and there has been some climbing development on the more prominent sections. All other Clare climbing will always be second rate to Ailladie. <strong>Landings</strong> – there is a possible landing at a storm beach just a <em>km</em> N of Doolin, but it is of little logistical interest as there is no road access. There is a shallow bay with a steep slip about 4<em>km</em> S of Fanore beach, just where the road is closest to the high tide mark, but landing even here is troublesome under the best of conditions. A dolphin, <em>Fáinne,</em> arrived here in 1997 or so A dolphin, <em>Fáinne,</em> arrived here in 1997 or so and has remained ever since, though nowadays intermittently. 13.5<em>km</em> NE of Doolin and 4<em>km</em> or so S of Black Head, is the splendidly picturesque, dune-backed beach of Fanore at M137-085. The beach may dump even on a good day, but it is the nearest to a dependable landing on this stretch, so do not pass by without thought. Fanore has a public car park (height barrier) at the S end of the beach with water and excellent camping in a paying site at the N end of the beach. There is a lifeguard on duty most of the summer. The coast for kilometres on either side of Black Head is scenic, and of special interest to shore anglers. Lines of them grace the low but sheer black cliffs all summer long. At the head, with its huge automated lighthouse, there will always be swell, especially when the tide ebbs into the regular westerlies. Under normal summer conditions, full-blooded Atlantic conditions suddenly yield to the protected waters of Galway Bay. Travelling northwards, the views of the hills of North Clare from hereabouts are at their most stunning. 3<em>km</em> around Black Head, the tiny pier (marked Coolsiva Quay at M181-108) at Gleninagh, gives a landing onto a small sandy beach. This is a pleasant spot for swimming, and is usually a reliable landing. There is camping and water in nearby houses. Car access is awkward, especially for larger groups. Many of the ‘Wild Geese’ are said to have left from this pier in Sarsfield’s time, after the Treaty of Limerick in 1691. 4<em>km</em> WNW of Ballyvaughan is Gleninagh Castle. Landing is difficult hereabouts, but it is worth the trouble as the castle is well preserved and home to breeding Chough.</p>\n","costalZone":"**The Mid-West**"}