{"name":"**Doonbeg to Spanish Point**","nameHtml":"<p><strong>Doonbeg to Spanish Point</strong></p>\n","safeName":"Doonbeg-to-Spanish-Point","coordinates":{"irishGrid":{"sheet":"Q","eastings":"962","northings":"663"},"fullIrishGrid":{"sheet":"","eastings":"96200","northings":"166300"},"tmcGrid":{"sheet":"","eastings":"496173.032","northings":"666342.038"},"geo":{"lat":"52.73817763","long":-9.53753173}},"cursor":78448,"description":"<p><strong>Doonbeg to Spanish Point</strong> Q962-663 to R034-777   Sheet 57 The character of the coast all the way from Loop Head to Spanish Point is mostly steep, rugged, slate cliffs interspersed with sheltered bays, large and small. S of Doonbeg, the terrain is mostly suited to those who like to potter and explore in detail. This now gives way to exposed surf beaches. The coast 9<em>km</em> N of Doonbeg is mostly surf beach, including the famous Doughmore (White Strand on the OS 1:50,000 map). Doughmore is famous with surfers for its reliable surf and mean rip-tides. Do not lightly decide to land hereabouts. Rock has been placed at the toe of the dunes. Doughmore is famous with others for the golf played in the dune system behind the beach. Doonbeg Golf Course was developed controversially in the last few years. Golfers won out against conservationists. More recently, the golfers have applied to Clare County Council for permission to deposit 80,000 tons of rock and boulders at various points on Doughmore beach, to halt coastal erosion. Did they not realise that dunes are by definition impermanent? Was this not on the cards from the outset? This is one of the most beautiful remote and natural beaches in Ireland. While the land belongs to the golf course, the beach belongs to everyone. It is not the public’s fault if some of the greens were badly situated. The pier (by Nimmo) at Lurga Point, 2<em>km</em> WSW of the village of Quilty, has a NE facing slipway at Q996-742, sheltered by a reef.  There is access at all stages of the tide and parking is plentiful.  Lurga is a most convenient embarkation point for off-lying Mutton Island. There is a somewhat sheltered storm beach R020-761 just 1<em>km</em> S of Caherrush Point R020-768. Here are farms and generally a welcoming environment, with water and camping on request. In 2010 the local farmer is as pleasant and helpful as ever and has no difficulty with visitors as long as it is small numbers and they ask permissionto access or use the land. There is a great story about his father RIP who accomodated a fellow in a “skinny boat” many years ago. The curved beach immediately S of Spanish Point is a famed surf spot, absolutely to be avoided except in calm conditions. One can expect waves that often are higher than Lahinch itself, with the break line closer to the shore.</p>\n","costalZone":"**The Mid-West**"}