{"name":"**Dorinish Mor**","nameHtml":"<p><strong>Dorinish Mor</strong></p>\n","safeName":"Dorinish-Mor","coordinates":{"irishGrid":{"sheet":"L","eastings":"901","northings":"859"},"fullIrishGrid":{"sheet":"","eastings":"90100","northings":"285900"},"tmcGrid":{"sheet":"","eastings":"490074.609","northings":"785916.407"},"geo":{"lat":"53.81114702","long":-9.66913882}},"cursor":112720,"description":"<p><strong>Dorinish Mor</strong> L901-859           Sheet 30 Every inch of this magnificent island was tilled at one time.  Approaching from the sea to eastward, the ridges of the lazybeds are so prominent that this one factor bears in strongly.  Landing on the extreme SW corner at LW one is struck immediately by the distinctive “drumlinesque” twin summits and the cropped off W sides eroded glacial till slopes. These two islands are separated by a raised storm beach that catches all the flotsam that passes nearby.  Extensive spit to NE.  Land at a beautiful sandy beach in the SE of the N island Mor.  Larger in every way than Beg, Dorinish Mor has possibly the highest boulder clay cliff in the world. Here boasted the famous Beatles commune of the late 60s, post Woodstock era.  Promoted by John Lennon, he and Yoko Ono occasionally came 1970 – 1972, and there was even a visit from Princess Grace and Prince Ranier.  The commune was directed by the “King of the Hippies” Sid Rawle, who retains that title to today.  It all began with a summer camp in July August, but an overwinter was tried.  Banks surrounded every construction, anti-wind.  Mostly they lived in teepees but the king had a wooden structure.  At the height of its experience, tomatoes were growing under plastic, but the wind won out in the end.  There are also the remnants of three crofts just NE of the beach, with kitchen gardens still obvious. Lennon’s music came under various regional influences during his lifetime, mostly from the far east.  Why not from the west?  Imagine Matt Molloy on the zitar and John on the uileann pipes.  Maybe both would have benifitted? Fauna Sheep, no cattle, Merganser, Lapwing, lots of breeding Cormorant.</p>\n","costalZone":"**The Mid-West**"}