{"name":"**Duvillaun Mór**","nameHtml":"<p><strong>Duvillaun Mór</strong></p>\n","safeName":"Duvillaun-Mór","coordinates":{"irishGrid":{"sheet":"F","eastings":"579","northings":"157"},"fullIrishGrid":{"sheet":"","eastings":"57900","northings":"315700"},"tmcGrid":{"sheet":"","eastings":"457881.527","northings":"815710.06"},"geo":{"lat":"54.07088729","long":-10.17148284}},"cursor":120781,"description":"<p><strong>Duvillaun Mór</strong> F579-157           Sheet 22 Landing The current owner discourages landing.  There is an unreliable landing place on a somewhat sheltered sandy beach (bouldery at LW) on the southern shore at a point marked Gubnageeragh. The scramble up is awkward, but tired paddlers from Achill Head may take advantage. There is camping above the beach. Water is available in small lakes at the top of the island. Otherwise the much more reliable landing point in calm conditions is in a shallow bay on the NE side, almost facing Duvillaun Beg. Land onto flat rocks, in a sheltered cut, best just NW of a ruined dwelling. The island was abandoned in the early 20<sup>th</sup> Century. In the 1821 census, there were 19 people living on the island, and a community existed here up to at least 1917. The ecclesiastical remains on the brow of the hill at the western end are of a small Anchorite settlement being an eremitic establishment from the 6<sup>th</sup> to 10<sup>th</sup> Centuries. The square ruin is a killeen, a children’s’ graveyard. A carved flat stone on the summit depicts a Greek crucifixion on one side and a pre-Celtic cross (with a circle surrounding the cross) on the other. Well worth the visit. Unfortunately the most prominent feature of the top of the island these days, begun in 2007, is the “work in progress” of a modern house, unsightly in 2010, unless and until it is finshed. There is also a covered shed, and a forty-foot container. Overall, it is a mess. This epitomises the tragic mismanagment of our wild islands. The application for this development was granted planning permission to build on an SPA, so the Parks &amp; Wildlife service now have the massive headache of trying to limit the damage done. The N/W end is wild and dramatic, with small sea stacks and islets lying off the shore. The whole N and W sides are worthy of a slow passage.  Good cuts and stacks, and in particular two fine sea arches, merit exploration.  One horsehoe shaped sea arch near Drumacappul Island F570-160 has a very distinctive quartize keystone at its apex.  The other one cuts through Turduvillaun F566-160 and is a challenging passage. SPA Storm &amp; Leach’s Petrel, Barnacle Goose, Peregrine, Chough, Arctic &amp; Little Tern. Lapwing and Greater Black-backed Gull breed and there is a colony of black rabbits.</p>\n","costalZone":"**The Mid-West**"}