{"name":"**Dún Briste**","nameHtml":"<p><strong>Dún Briste</strong></p>\n","safeName":"Dún-Briste","coordinates":{"irishGrid":{"sheet":"G","eastings":"123","northings":"430"},"fullIrishGrid":{"sheet":"","eastings":"112300","northings":"343000"},"tmcGrid":{"sheet":"","eastings":"512270.254","northings":"843004.034"},"geo":{"lat":"54.32820223","long":-9.34874948}},"cursor":127174,"description":"<p><strong>Dún Briste</strong> G123-430          Sheet 23 Meaning “Broken Fort”, <em>Dún Briste</em> is well named. It consists of a sea stack broken away from the massive cliffs at Downpatrick Head. It is said there were people in residence when in 1393 it broke away. The rescue operation must have been something, though the gap will not have been as intimidating as now. The stack measures about 20m by 60m, and about 100m separates it from the mainland. Dún Briste rises absolutely vertically on all sides, and though it appears very sharp from the headland, it is more squat when seen from the side. The general area is well worth the visit. Parking may be had 1<em>km</em> from the headland. A pleasant walk leads up to the headland past the infamous <em>Poll na Seantoine</em>, a blow hole of huge proportions, dropping down into a cave system that opens up under the main cliff just inside <em>Dún Briste</em>. A plaque commemorates those locals who sided with the French when they landed nearby at Kilcummin just outside Killala in the invasion of 1798. The invasion force was at first successful, and took all before it, including Castlebar, capital of Mayo. Heading eastwards, it ran out of steam and was finally defeated in Roscommon a few weeks later. The French soldiers were treated as prisoners of war and sent home, but the local civilian insurgents were dealt with as unsuccessful civilian insurgents have typically been dealt with down the ages. Special enthusiasm was shown in dealing with the locals at the epicentre of the whole business who were thought to have sided with the enemy. Herded towards Downpatrick Head, they were forced over the edge into the blowhole and a gruesome death in the waves far below. A scientific party visited the summit by helicopter for a few short hours in 1980, the first human intrusion in almost 600 years.  At first they felt the buildings much older than 1393 and probably of mixed monastic / agricultural type.  After some study they thought they were in fact mediaeval, a longhouse of sorts, with some odd bolt-ons.  They would love to go back to make sure.  A quernstone was found on top of a perimeter wall.  Also of interest was a colony of wood lice which would have grown independently of the wood lice on the mainland for 600+ years. Fishing Locals fish from these cliffs in a special way, especially in the horseshoe bay just E of the headland. A long line is uncoiled and arranged to run free on the ground. A baited hook, a weight, and a big slab of timber several metres up the line is swung by hand in ever increasing arcs above the head. Finally the throw is made, and the business end finishes up floating way below. Huge Pollack are caught this way, and hauling them up is very hard work. Kayaking In calm conditions a launch may be had on rock shelves below the parking space at G125-424. Otherwise, the beach below (just N of) Ballycastle is fairly dependable G104-394. Dooclogh Pier G096-401 is the most dependable.  The paddling is thruly fantastic. A cave system links the W facing shore of Downpatrick Head, entering near the parking area, through the blowhole <em>Poll na Seantoin,e</em> and onwards to exit hard by <em>Dún Briste</em>. Narrow in places and shelved in others, the trip is a must, but timing is the key to the trickier passages.</p>\n","costalZone":"**The Mid-West**"}