{"name":"**Eagle Island**","nameHtml":"<p><strong>Eagle Island</strong></p>\n","safeName":"Eagle-Island","coordinates":{"irishGrid":{"sheet":"F","eastings":"641","northings":"392"},"fullIrishGrid":{"sheet":"","eastings":"64100","northings":"339200"},"tmcGrid":{"sheet":"","eastings":"464080.461","northings":"839204.887"},"geo":{"lat":"54.28353644","long":-10.08743934}},"cursor":124838,"description":"<p><strong>Eagle Island</strong> F641-392           Sheet 22 A prominent, rocky lighthouse island, on which landing without swimming is almost impossible in nearly all conditions. The sound immediately inside the island to its SE is always lumpy and best avoided in difficult conditions. Local paddlers report that the tide in the sound always runs NE, and that it is usually best to pass by further inside altogether, along the coast. As with all lighthouses, always ask Irish Lights for permission to land. There were two lighthouses, which form a transit, clearing obstacles nearby. The eastern light was discontinued in 1895, and the western light was automated in 1988. Its character is 3 white flashes every 10 seconds. The lights have a troublesome history. Storms wrecked the towers during construction and again afterwards. The keepers’ accommodation was washed away. A wave 68m high washed over the island in 1861. The tower filled with water and the keepers had to drill holes to open the door. The grassy top of the island feels sheltered, and appears to have once sustained the lighthouse personnel well enough. There is a substantial walled garden just above the northern landing steps. The lighthouse is powered by solar panels. Great Black-backed Gull abound in the long grass. Landing There are two landing spots. Each is at or alongside a small landing stage, each either side of the SE sound. Each is just outside the sound, one at the eastern tip, and the other at the southern tip, behind a stack. Steps are cut in the rock either side of these landing stages, where it is probably best to drag up heavy boats. Camping There is no water, but there is plenty of camping on the grassy plateau. However, an overnight stay runs a huge risk of stranding, should swell height increase, even a little. See Bill Long’s ‘Bright Light, White Water’ for descriptions of the huge seas which give this island it’s bad reputation. A short visit is recommended.</p>\n","costalZone":"**The Mid-West**"}