{"name":"**Erris Head Area**","nameHtml":"<p><strong>Erris Head Area</strong></p>\n","safeName":"Erris-Head-Area","coordinates":{"irishGrid":{"sheet":"F","eastings":"701","northings":"418"},"fullIrishGrid":{"sheet":"","eastings":"70100","northings":"341800"},"tmcGrid":{"sheet":"","eastings":"470079.226","northings":"841804.323"},"geo":{"lat":"54.30843844","long":-9.99650352}},"cursor":123517,"description":"<p><strong>Erris Head Area</strong> F701-418           Sheet 22 The ‘head’ of Erris Head is on a high grassy island Illandavuck separated from the Mullet peninsula by a narrow, dramatic channel at F699-416, which for kayaks is a useful escape from the Atlantic side. The channel is shallow and various outlying reefs and islets cause much turbulence and clapotis even on relatively good days. The outside passage is also prone to swell and turbulence as it too has outlying islets and reefs on its northern and western side.  The inner passage undoubtedly closes with conditions, and certainly for larger boats, is safest at HW. Such boats may find the channel does not behave itself as it should. Yachtspersons feel there may have been a rockfall or boulders thrown into the gap by W gales, choking and changing things. Outside that keep to the centre, then the N side near the E end. On the Broad Haven side, about 2<em>km</em> to the SE, is a good little harbour called the Danish Cellar at F706-397, useful on passage, with water in the house and camping. Tides The main west coast stream touches land hereabouts, so the flood runs northeast/east from 3:20 before Galway HW until 3:05 after. Races occur on the Broad Haven side where returning eddies meet the mainstream. On the flood, a clockwise eddy comes back north along the Broad Haven coast from about 2.5km SSE of the head. On the ebb, anticlockwise eddies happen in two places. One eddy comes back north along the eastern side of Broad Haven bay and rejoins the mainstream west of Kid Island. The ebb also sets up anticlockwise eddies on the Atlantic side, southwest of the head. Local paddlers report that the tide always seems to be going north inside Eagle Island, on both flood and ebb. Embarkation Embark from either of three locations, the first for kayaks and the other two, safe anchorages both, are important to yachts on passage:</p>\n<ol>\n<li>Best near HW, a sheltered S facing stony beach F628-345 on the S side of Annagh Head, well sheltered by offlying Annagh Island.It lies just below a new surfaced road and a new parking spot for Annagh Head, from which it is a convenent short carry to the shoreline, longer at LW. This launching spot is especially useful for a quick daytrip for smaller groups to Inishglora, Inishkeeragh, or Eagle.</li>\n<li>A working pier at F644-344 with good parking, on the northern side of Annagh Head, in a good big bay known as French Port, <em>Port na Francagh</em>.</li>\n<li>A wonderfully sheltered, isolated storm beach just further N, called Scotch Port at 647-361. The Commissioners of Irish Lights have a building at Scotch Port, for servicing the lighthouse on Eagle Rock and Black Rock. Here is a Corncrake reserve (one bird in 2003, 3 in 2010), and where Quail are not unknown. The last Corn Bunting in Ireland was in nearby Termoncarragh in 1992.12 – 15 pairs of Twite breed locally.</li>\n</ol>\n<p>These are also excellent embarkation places for a round of Erris Head, linking with Belmullet for a manageable walk  back of about 8<em>km</em>. The paddle is about 32<em>km</em>. For a shorter trip, shuttle to the Danish Cellar at F706-397 for about 16<em>km</em> paddling. Either trip enjoys the Atlantic side of the Head, which is as scenic and committing as any.  The “Erris Head Walk” starts and finishes at Danish Cellar, as good as any of its kind. Passage On passage, there is camping manageable opposite the French Port pier, but no water. For water, ask in the house nearest the pier. This is the house once owned by Danny Gilboy, the late warden of the nearby Birdwatch Ireland reserve. Do not go onto the reserve without permission, or unless accompanied by a member of the Gilboy family. Do not camp at the head of the bay unless intending to depart near HW, because of the extensive flats which severely dry out. Camping at Scotch Port is convenient and uncomplicated. The islands off the NW of the Mullet peninsula share common access and tidal information. They vary from low and grassy to huge and rocky, with a significant lighthouse. SPA Storm Petrel, Arctic &amp; Little Tern, Barnacle Goose, Corncrake, Quail.</p>\n","costalZone":"**The Mid-West**"}