{"name":"**Foynes Island**","nameHtml":"<p><strong>Foynes Island</strong></p>\n","safeName":"Foynes-Island","coordinates":{"irishGrid":{"sheet":"R","eastings":"250","northings":"521"},"fullIrishGrid":{"sheet":"","eastings":"125000","northings":"152100"},"tmcGrid":{"sheet":"","eastings":"524966.744","northings":"652144.928"},"geo":{"lat":"52.61535948","long":-9.1080081}},"cursor":71653,"description":"<p><strong>Foynes Island</strong> R250-521          Sheet 64 Foynes is the Anglicisation of <em>Oileán Fáinghe</em> in Irish, meaning “circular island”. It is well named, the island being very round. The island is situated 100m off Foynes village on the main coast road Limerick to Listowel. Historic In the days of amphibious planes, Foynes was the centre of the aviation world hereabouts. Being just about as far west in Europe as it is possible to be, that was important in those days. Planes from all over Europe stopped here to begin or end the Atlantic jump. Shannon Airport just across the estuary now fills the role of international airport to the west of Ireland, but with modern aircraft able to fly much longer distances, its role isn’t quite as critical. Its very long runway will always deserve it a role as a hub for certain long-haul airflights. Commercial foresters will find Foynes Island interesting, but others won’t be so turned on. It is a lumpy square kilometre of deciduous and coniferous trees. The interior is essentially impenetrable and holds little of interest to passing leisure craft. Land The main landing is at a pontoon at the S tip called Barneen Point, opposite the public harbour in the village. This gives access to the few houses on the island and should be considered private. The entire of the rest of the shoreline is accessible at HW but a sea of mud at lower waters. The mud is fine glutinous silt, most unpleasant. Whether extending a handful of metres or one hundred, landing onto it isn’t an option. Access can be conveniently achieved at only one other spot, halfway along the SW side at R245-523. Here, rocks come down to the water that are both accessible and mud free. Otter and Greenshank. <strong>County</strong> <strong>Clare</strong> <strong>Islands of the Fergus Estuary</strong> The Fergus Estuary is the branch of the Shannon Estuary that juts N up towards Ennis, the county town of Clare. It is choked with islands big and small. The boating hereabouts is similar in some ways to Clew Bay and inner Strangford Lough. The big distinguishing factor here though is that this entire system is the upper reaches of an estuary, whereas the others are simply drowned landscape areas. Mud Accordingly, while Clew Bay to a large extent and Strangford Lough very much so, may be muddy, very muddy, especially in their inner reaches and in their nooks and crannies, every tiny part of this area is affected by mud. The mud is a fine glutinous silt, quite unpleasant. The silt permeates the water everywhere, and swimming isn’t on.  The only parts that suffer less mud are the parts of islands scoured by the main flow, being – logically enough – the E side of the many islands on its W side and the W side of the few islands on its E side. Mudflats As with all such places, vast areas become extensive mudflats at LW, and a heedless moment on a falling tide can carry a heavy penalty. Tides run strongly through the channels, and indeed the tidal range is huge.  Nevertheless, even in Springs, the speed of the lateral flow equates to mere neaps in Strangford, despite that the vertical range is much greater. There is no commercial fishing of any kind done, but there must be flat fish and mullet who love such conditions. Clew Bay and Strangford are each end of Ireland’s drumlin belt, but the islands here have solid limestone bases, not boulders and clay. The land is therefore very rich and fertile. The bigger islands are farmed, mainly cattle and sheep, with some horses and goats. There is no tillage. Nowadays the farmers all live on the mainland nearby. The last full-time island resident (Deer Island) died in August 2004. She was the only female sole inhabitant of an Irish island in the 2002 census, there being three other sole male inhabitants. Farmers hereabouts commute to work on flat bottomed or shallow draft boats, of a kind used in estuaries the world over. They are among the very few Irish farmers that carry tide tables on their persons at all times. Embarkation There is really no convenient embarkation point on the E side at all. There are two only on the W side. Most central is Crovraghan Pier R278-601, a small working pier, busy at commuting times.  This means mid-tide on the up and mid-tide again on the down, when there will be many cars arriving and departing the pier, and left there between times. It is well sheltered by Illaunbeg 100<em>m_offshore, fast deep water filling the channel. A pleasant spot for campervanning.  The slipway being steep, the amount of mud to struggle past at LW is limited. Certainly it is always open at neaps, and possibly springs.  The channel is then always open to N/S.  The flow is very fast.  The pier is reached from a signposted crossroads 2_km</em> N of Killadysert on the main Ennis road. To the S, Cahiracon Pier R248-563 may be the more convenient, depending on the excursion plan, especially for the more S islands, or an excursion S across the Shannon Estuary. It is reached from just S of Killadysert. Any excursion in the Fergus Estuary is best carried out around HW, and Cahiracon may be preferred for allowing a more comprehensive exploration in the one go.  Cahiracon though is however a dumping ground and a ships’ breakers’ yard. Most unpleasant. Tides HW in the estuary is an hour after Galway, slightly ahead of Limerick Docks, which is 1:30 after Galway. The main channel is on the eastern side, but on the top half of the flood, locals prefer a channel that hugs the coast on the western side, inside Illaunbeg and Illaunmore (Deer Island). The ebb and flood occur with the rise and fall of the water. The direction of the flow is basically north/northeast for the flood and south/southwest for the ebb, but it tends to twist and turn with the channels and the results are peculiar on occasion (e.g. in the channel northeast of Crovraghan Pier). The flow can be very fast and strong at times, but never really all that violent, despite the range being enormous by Irish standards, easily over 6m. The islands are given here more or less from the SW.  Inishloe is unapproachable except at HW, difficult to fit in with a planned excursion, so only cursory information is available.</p>\n","costalZone":"**The Mid-West**"}