{"name":"**Goleen Bay to Kilkee**","nameHtml":"<p><strong>Goleen Bay to Kilkee</strong></p>\n","safeName":"Goleen-Bay-to-Kilkee","coordinates":{"irishGrid":{"sheet":"Q","eastings":"825","northings":"560"},"fullIrishGrid":{"sheet":"","eastings":"82500","northings":"156000"},"tmcGrid":{"sheet":"","eastings":"482475.983","northings":"656044.339"},"geo":{"lat":"52.64286316","long":-9.73659458}},"cursor":77476,"description":"<p><strong>Goleen Bay to Kilkee</strong> Q825-560 – Q886-604     Sheet 63 About 8<em>km</em> of vertical cliffs and steeps slabs. Goleen Bay is an excellent waystop and possible embarkation point, well sheltered, but beware of rough seas closing out its narrow entrance during big sets. The castle at Castle Point (Q835-577) cannot now be seen. The deeply undercut cliff here is popular with mackerel fishermen. From Goleen Bay to here are steeply sloped rock layers dipping straight into the sea. Offshore lies the distinctively shaped Illaunonearaun at Q827-570. There is no landing but it boasts fine arches and caves at its NE tip. SPA Storm Petrel, Barnacle Goose. There is a lovely arch at Foohagh Point at Q853-590, but watch for the submerged rock on its northern side. There is a most beautiful stack to its S called Green Pillar Rock, also called ‘The Candle’ by divers. A large hole has eroded through the centre, and there is a splendid jump off the landward side of the hole. The bay just N of Bishop’s Island at Q856-595 has the remains of some huts. There is a straight, 200m long cave in the SW corner. The island itself is visible only from the land opposite, and no landing is possible to kayaks. There are caves in the cliff wall opposite Bishop’s Island and a mighty sea stack on the corner. Clapotis often occurs in the sound, especially in the shallower, inside part. Approaching Kilkee Bay, just outside Duggerna Rocks, are a couple of nice caves, with the innermost having two entrances. The second is almost hidden by the big rock sticking up in the corner, or at HW. Waves tend to rear up between here and Knockroe Point to the S. The bay just to its S is Intrinsic Bay, where Goat Island is the tiny sloping rocklet heavily populated with birds. Avoid the tiny inlet behind the island. On Duggerna Rocks, at the southern side of the bay, are the famous Pollock Holes. These are famous for their natural swimming and snorkelling pools of all sizes. Covered at HW, they are refreshed twice daily. The Pollock Holes are deservedly a most popular attraction. The offshore rocks at this point are busy dive  sites. The inner bay has a beautiful, horseshoe strand, which is very well sheltered. As the town is right behind, the best landing is at the pier at the northern end of the beach. Scuba divers, both CFT and PADI (Comhairle Fo-Thuinn (Irish Underwater Council), Professional Association of Diving Instructors), organise themselves from this pier. Kilkee is a serious player as a tourist town. At the northern end of Kilkee Bay, a number of underwater reefs run S from George’s Head. These are known by frightened kayakers to boom on even the calmest days. The sheltered Byrne’s Cove at Q883-614 on the N side of the bay is popular with male naturists. The prevailing south-westerly swells, coupled with reflection off the cliffs, makes for turbulent water in this corner of the bay.</p>\n","costalZone":"**The Mid-West**"}