{"name":"**Hare Island**","nameHtml":"<p><strong>Hare Island</strong></p>\n","safeName":"Hare-Island-26","coordinates":{"irishGrid":{"sheet":"M","eastings":"317","northings":"237"},"fullIrishGrid":{"sheet":"","eastings":"131700","northings":"223700"},"tmcGrid":{"sheet":"","eastings":"531665.512","northings":"723729.488"},"geo":{"lat":"53.25951154","long":-9.02418325}},"cursor":83968,"description":"<p><strong>Hare Island</strong> M317-237          Sheet 45 A popular and attractive island about 1.5<em>km</em> SE of the entrance to Galway City docks and harbour.  A causeway to the NE dries out for about 90 minutes either side of LW, joining the island to the mainland at Ballyloughan Point in the suburb of Renmore, beside a camping and caravan park. There, a municipal sign warns that access to the island is prohibited in the interests of public safety.  Apparently the unwary get trapped there overnight from time to time, frightened by the strength of the flow crossing the causeway when the water levels rise more quickly than expected.  The sign seems to attract more traffic than it prevents, and certainly, groups can routinely be seen waiting on the dropping tide for the causeway to appear, then smartly setting out.   The discerning kayaker will visit at HW. The island is a raised green field on the W side, rising from the middle, with steep mud and grass cliffs around the higher parts.  The field features mainly ragweed and elder, with some brambles.  Rabbits abound.  No stock was seen August 2008 but a small construction suggests there must be at times. A lagoon flanked by a grass covered raised stoney perimeter comprises the E side.  The lagoon drains NE on the E side of the causeway.  It never empties much really, but it is renewed at each HW and is fresh looking and clear.  There is a small wreck on the ENE shore.  Herring Gull roost and appear to breed. Embarkation The suburb of Renmore boasts a paying camping and caravan park at M324-247, a nice beach, and some parking on the very limits of Galway city.  East of the point is green fields.  Launch from immediately outside the campsite M323-247.  Land on a sheltered stony beach on the N said just W of the causeway, where the swimming is better on lower tide levels. Tides The beach on the western or city side of the point dries for quite a long way so do time your excursion well.  HW as Galway.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"421\"><strong>Causeway to Hare Island</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Start Time</strong></td>\n\n<td width=\"161\"><strong>End Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"180\">4:00 before Galway HW</td>\n\n<td width=\"161\">Galway HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"180\">Galway HW</td>\n\n<td width=\"161\">4:00 after Galway HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The causeway may be portaged in between times. Leveret Light in the shallow water of the SW tip is a significant navigation marker marking the E side of the approaches to Galway port.  Mutton Island marks the W side.</p>\n","costalZone":"**The Mid-West**"}