{"name":"**Head**","nameHtml":"<p><strong>Head</strong></p>\n","safeName":"Head","coordinates":{"irishGrid":{"sheet":"F","eastings":"517","northings":"052"},"fullIrishGrid":{"sheet":"","eastings":"51700","northings":"305200"},"tmcGrid":{"sheet":"","eastings":"451682.735","northings":"805212.384"},"geo":{"lat":"53.97488362","long":-10.26099621}},"cursor":117379,"description":"<p><strong>Head</strong> F517-052           Sheet 22/Sheet 30 From Annagh Strand it is necessary first to travel NW to Saddle Head at F564-094 where a considerable lump may be expected. A reef just offshore adds both technical interest and fear. Then it is SW to the head itself. A few storm beaches litter these impressive cliffs under Croaghaun. At least one is well enough sheltered, and in the right conditions, lunch has been enjoyed at Gubfoheratawy F567-077.  Conditions do need to be calm indeed to land. The head itself has broken islets off it and the innermost passage is passable under the right conditions. Moyteoge Head at F565-035 lies 5<em>km</em> ESE, behind which is Keem Strand. Keem Strand F562-043           Sheet 22/Sheet 30 A beautiful, horseshoe beach at the end of the road on the southern side of the island, Keem Strand is known to photographers the world over. Sheltered in most conditions, it surfs in southerlies. There are parking spots and viewpoints here, and many walks for Croaghaun and Achill Head. Extensive and excellent rock climbing has recently been developed on the E side of the valley.  This bay was the killing ground for the Achill Basking Shark fishery. Toilets (by day) are up from the beach a bit.  Camping is inhibited by this being a favourite courting spot, winter and summer, after dark. Gubalennaun Beg Quay F623-036           Sheet 30 Locally “Purteen”.  In trouble, this is the only dependable landing spot for dozens of kilometres in either direction. Keem Strand to the W may dump and Keel to the E is a famous surfing beach. This is a quay with no facilities except water and camping, and the certainty of a landing in any conditions. In nearby Keel can be had most anything – nice restaurants, pubs, provisions. The famous Achill Basking Shark fishery was based here until the mid-20<sup>th</sup> Century. Keel Strand F636-046           Sheet 22/Sheet 30 This is a famous surfing beach to be used by sea kayakers only in calm conditions. There is a camping and caravan site just in from the beach, with a convenient road and water near the village at the NW end of the beach. There is a golf links in the middle. The most remote part is in the SE where the Minnaun (or Menawn) Cliffs begin. Camping is excellent just behind the beach just about anywhere, though watch for golfers in the middle. <strong>Achill Island (Inner) – Achill Sound</strong> Sheet 30 The kayaker on passage can easily manage Achill’s inside route. The tide governs entirely only in its narrower places, and the wind mostly prevails. Achill Sound Bridge at F738-998 and Bull’s Mouth at F737-068 are major challenges to larger craft, but kayaks can always manage. Under most conditions, one may paddle under the bridge, even against the flow. This may involve a short sprint, or at worst, a portage. Avoid the very bottom of the tide because drying mudflats S of the bridge inhibit the process.  All facilities are available here, as Achill Sound is the main town of the island.   The spectacular new swing bridge at Achill Sound was opened in October 2008, replacing the 1947 structure whose pivotal mechanism had become stuck and corroded. From the kayakers’ perpective, the channel is clear and navigable, but do be aware that the direction of buoyage changes N of the bridge At Bull’s Mouth, at the northern entrance to the sound at F737-068, the eddies allow one to avoid problems. Wind against tide generates its fearsome reputation. Tides The tide flows simultaneously in from both ends to meet on the extensive mudflats just south of Achill Sound Bridge. Accordingly, the flood flows south under the bridge until local HW, which is 2:00 after Galway HW. The tide floods north through the southern entrance of the sound at Achillbeg</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Southern entrance to Achill Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">4:50 before Galway HW</td>\n\n<td width=\"57\">4-5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">1:35 after Galway HW</td>\n\n<td width=\"57\">4-5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The fastest flow is at Darby’s Point, just inside the entrance. On the flood, a major eddy circulates just inside the Point at F723-935 on the Achill Island side, reaching as far as <em>Gránúaile</em>’s castle at F721-941. The tide floods south through the northern entrance called Bull’s Mouth F737-068 at up to 5kn.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Bull’s Mouth</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">4:50 before Galway HW</td>\n\n<td width=\"57\">5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">1:20 after Galway HW</td>\n\n<td width=\"57\">5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>With wind over tide, quite a race is set up to the SSE. On the flood, a major eddy circulates just inside the entrance on the Achill side. On the ebb, the sound empties to the north, which is often benign. In summary, going either way through the sound, slow boats should start a couple of hours before Galway HW and enjoy the flood to the mudflats just south of the bridge. Then perhaps break the journey, provision up and have a meal, in time to enjoy the ebb out the other side.</p>\n","costalZone":"**The Mid-West**"}