{"name":"**High Island – _Ard Oileán_**","nameHtml":"<p><strong>High Island – <em>Ard Oileán</em></strong></p>\n","safeName":"High-Island-–-_Ard-Oileán_","coordinates":{"irishGrid":{"sheet":"L","eastings":"507","northings":"576"},"fullIrishGrid":{"sheet":"","eastings":"50700","northings":"257600"},"tmcGrid":{"sheet":"","eastings":"450682.785","northings":"757622.793"},"geo":{"lat":"53.54727592","long":-10.25322343}},"cursor":105583,"description":"<p><strong>High Island – <em>Ard Oileán</em></strong> L507-576           Sheet 37 High Island is the jewel in the crown of W of Ireland wild islands. Only Inishtrahull to the N and Inishvickillaun to the SW rival its massive grandeur. Surrounded by high cliffs virtually all around, its overall geography, variety of magnificent and inspiring views, fauna, and other points of interest mark it out as being special. Circumnavigation and exploration in the occasional benign conditions is a spectacular experience. Landing The difficulty of landing sets High Island as a prize for all who aspire to come here. Midway along the SE side is a prominent cove, backed by huge cliffs under the highest part of the island. Landing is best about 200m E of this in a boulder choked cove. The back of the cove is shown on the OS sheet as having a ‘Cross Slab’. The landing cove is where the lower ground to the eastern end of the island begins to rise towards the centre, and where the island is narrowest and most waisted. Kayaks may well land in calm conditions onto the boulders and scramble airily to the plateau above. On the E side of the cove is a hard-rock landing for boats, at which surge is limited and the scramble to the plateau above is much easier. There is a ring for a shoreline, much improved as of 2010, and an out-haul anchor is recommended. Kayakers might consider landing even one boat at this spot, in case conditions deteriorate while ashore. Above the landings beware the opening to an old mineshaft – quite apparent in good conditions, but dangerous for the unwary. There is a second landing point reported, just E of the SW tip of the island at L503-571. Clinker boats might manage better here, but it is a bit exposed for kayaks. If manageable, it is closer to the monastic ruins on the island and might thus be preferred by some. It is directly underneath the smaller of the two island lakes. Camp at will. Water in the lakes appears stagnant but looks better in the streamlets E of centre. High Island is uninhabited. It was once owned by Brian Boru, and more recently by Richard Murphy, the poet. There is a (Murphy) stone hut, and a more recent timber Dúchas building. Rumours abound of a ruined copper mine on the eastern slopes near the high point of the island, and of an awesome cavern-like cave on the north-western side. There are the ancient 7th Century ruins of an early Christian beehive hut, monastery and chapel, said to have been founded by Saint Feichin of Omey Island fame. The ruins are beside the larger of two lakes above the western end. In 2003, these are being refurbished by Dúchas. Raised platforms and planks protect the excavations from workers’ muddy boots. There are three impressive inscribed slabs at the back of the chapel, worth finding. SPA Peregrine, Chough, Storm &amp; Leach’s Petrel, Barnacle Goose. In 2003, there were Raven, Twite, Black Guillemot, Skylark and Meadow Pipit.</p>\n","costalZone":"**The Mid-West**"}