{"name":"**Hog Island**","nameHtml":"<p><strong>Hog Island</strong></p>\n","safeName":"Hog-Island-23","coordinates":{"irishGrid":{"sheet":"Q","eastings":"986","northings":"533"},"fullIrishGrid":{"sheet":"","eastings":"98600","northings":"153300"},"tmcGrid":{"sheet":"","eastings":"498572.476","northings":"653344.815"},"geo":{"lat":"52.62185467","long":-9.49801141}},"cursor":74664,"description":"<p><strong>Hog Island</strong> Q986-533          Sheet 63 Little neighbour of Scattery Island and less interesting. A drumlinesque few acres, there are horses, Shelduck and goats. The island is privately owned and camping is not permitted. Rumours of a wind farm in January 2012 lack planning permission for corroboration.  All bushes and gorse on the island have been removed and a small breakwater wall is now located on the N side at the entrance to a salt marsh and lagoon that is navigable to kayaks at HW. Wildlife was good at the lagoon with 250+ Teal, 100 Widgeon, Snipe 30 and good numbers of Oystercatcher, Curlew, and Redshank roosting there at high water. Common Seals seen (4). Local HW is generally:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td width=\"111\"><strong>From</strong></td>\n\n<td width=\"113\"><strong>To</strong></td>\n\n<td width=\"94\"><strong>Galway HW</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"111\">Mizen HeadLoop Head Slyne Head Erris Head Tory Island</td>\n\n<td width=\"113\">Loop HeadSlyne Head Erris Head Tory Island Malin Head</td>\n\n<td width=\"94\">-01000000 +0015 +0040 +0100</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Offshore tidal streams Tidal information inshore along the west coast of Ireland is only occasionally reliable or available. There just aren’t enough boaters sending in information.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"308\"><strong>Offshore – Loop Head to Aranmore Donegal</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"230\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">N</td>\n\n<td width=\"230\">3:20  before Galway HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">S</td>\n\n<td width=\"230\">3:05 after Galway HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>It is also very little different – half an hour earlier – the rest of the way north and east around the corner to at least as far as Malin Head. The offshore mainstream makes itself felt where the land projects to meet it. For example:</p>\n<ul>\n<li>Loop Head to Kilkee • Outside of the Aran Islands •           Slyne Head •           Outside Inishshark, Inishbofin and Inishturk •           Achill Head •           Outside the Inishkeas •           Erris Head •           Rathlin O’Birne to Aranmore •           Tory Sound •           Downies to Melmore Head.</li>\n</ul>\n<p>Inshore tides Inshore, where paddlers operate, it is a little more complicated. It is widely accepted that tidal streams inshore in the shallows turn before tidal streams offshore. The islands and the much-fragmented coastline sets up eddies. The bays and inshore channels, from the Shannon Estuary in the southwest to Lough Swilly in the far north, fill and empty almost simultaneously. The variation between them is twenty minutes or less. This inshore cycle of bay filling and emptying is associated with the offshore main stream. As soon as the offshore stream begins to slacken off, the inshore streams start to flow in the opposite direction. Here is how it works. <strong>The offshore mainstream floods</strong> north until 3:05 after Galway HW, but inshore, the bays start to empty that bit earlier, at 1:00 after Galway HW. The inshore bays start to empty as soon as the offshore flood starts to slacken. <strong>The offshore mainstream ebbs</strong> south until 3:20 before Galway HW, but inshore, the bays start to fill that bit earlier, at 5:00 before Galway HW. The inshore bays start to fill as soon as the offshore ebb starts to slacken. To summarise, the bays mostly fill on the offshore flood and they mostly empty on the offshore ebb. It is just that the inshore cycle starts 1.5 – 2.0 hours earlier than offshore. As soon as the offshore flood or ebb slackens to about half pace, the process is exhausted and the inshore cycle the other way is triggered. Thus, all the bays and channels on the west coast fill from about 5:00 before Galway HW and empty from about 1:00 after Galway HW. Water movement in bays It has to be stressed that these timings relate to the entrances to bays. Up near the head of a bay, or even halfway up, the timing tends to be that bit later. Further, in bays where a large expanse of water is filled through a narrow or constricted entrance, it can be very much later. Bays with restricted entrances, into which large rivers flow, operate to rules that are more extreme again. The information that is commercially available about west coast tides relates to entrances of bays. The people who draw charts and write pilot books concentrate their efforts here. The reason is that mariners are always anxious to come and go with a favourable tide. Given that the west coast of Ireland consists almost entirely of such bays, this is very useful. The conscientious route planner is remarkably well informed for large sections of the coast. Care should be exercised in using information from the table on the facing page.</p>\n<ul>\n<li>Rates of flow are spring rates, mostly if not exclusively.</li>\n<li>They are not necessarily consistent throughout the bay.</li>\n<li>The value given may not be for the mouth of the bay itself, but for some other spot inside the bay which has been deemed more important. The reasons for this may not be readily apparent.</li>\n<li>Similar arguments apply for start and finish times, though less vigorously so.</li>\n</ul>\n<p>Common sense should be used or better again, consult the Irish Coast Pilot for more detailed information. All times are given relative to Galway HW.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td width=\"285\"><strong>Bay and place</strong></td>\n\n<td width=\"94\"><strong>Max. Rate</strong></td>\n\n<td width=\"66\"><strong>Starts to fill</strong></td>\n\n<td width=\"78\"><strong>Starts to empty</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"285\">Shannon Estuary (off Carrigaholt)Galway Bay – South Sound Galway Bay – Foul Sound Galway Bay – Gregory Sound Galway Bay – North Sound Kilkieran Bay Bertraghboy Bay Clifden Streamstown Cleggan Bay Ballynakill Harbour Killary Westport Bay Clew Bay (weaker flow) Clew Bay (stronger flow) Achill Sound South (off Achillbeg) Achill Sound South inner Achill Sound North (Bull’s Mouth) Blacksod Bay Outer (Achill/Duvillauns) Blacksod Bay inner (N+E of Blacksod Pt.) Frenchport Broadhaven Broadhaven Bay Killala Bay Ballysadare Bay Sligo Bay outer Sligo Harbour Ballyshannon (bar to the town) Donegal Harbour Killybegs Harbour Gweebarra Harbour Rosses Bay inner Aran Sound, north &amp; south Rutland Channels, north &amp; south Cruit Bay inner Sheephaven (+ Ards Bay entrance) Mulroy Bay (entrance) Lough Swilly (at Buncrana)</td>\n\n<td width=\"94\">Strong1kn 1.5kn 1.5kn 0.5kn 1.5kn 1.75kn 1.5kn Very strong Weak Weak 0.5kn 2kn 0.5kn 1.5kn 2.5kn 5kn 9kn 1.25kn     2.5kn 1kn Weak 1kn 1kn 3kn 2kn   0.25kn 9.5kn         Strong 1.5kn 1.5kn</td>\n\n<td width=\"66\">-0520-0520 -0520 -0520 -0520 -0520 -0520 -0500 -0500 -0500 -0500 -0500 -0505 -0530 -0530 -0450 -0450 -0450 -0515 -0450 -0515 -0450 -0515 -0450 -0450 -0450 -0505 -0415 -0530 -0450 -0500 -0520 -0520 -0520 -0520 -0500 -0520 -0505</td>\n\n<td width=\"78\">+0050+0105 +0105 +0105 +0105 +0105 +0105 +0100 +0100 +0100 +0100 +0100 +0040 +0040 +0040 +0135 +0135 +0120 +0050 +0120 +0050 +0100 +0050 +0115 +0115 +0115 +0115 -0015 +0045 +0015 +0015 +0050 +0050 +0050 +0050 +0105 +0105 +0055</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>All of these carry a warning. No one in a small boat should ever pass a lobster pot without checking which direction the tide is flowing. It’s like going out in the rain without a coat because the weather forecast is good. <strong>The Coast of West Clare</strong> This varied coastline changes greatly in character. The SW Clare coastline is synonymous with vertical slate cliffs. These begin at Kilbaha in the Shannon Estuary, just E of Loop Head and run NE for 60<em>km</em> or so, uninterrupted except for the occasional small boulder beach or long sweep of sand. The cliffs go all the way to the limestone Burren hills in the N of the county. There are few enough landings among the limestone escarpments between Doolin and Ballyvaughan. Steep cliffs then give way to the deeply indented bays in low-lying farmland on the NE edge of the Burren. Those who have set themselves to paddle all the way around Ireland, a mighty crew, properly fear the southern section of this county, from Loop Head to Doolin. It is one of the significantly exposed parts of the entire trip. West Clare is here divided into small day excursions, which allow one to intensively explore.</p>\n","costalZone":"**The Mid-West**"}