{"name":"**Horse Island _Olieán na gCapaill_**","nameHtml":"<p><strong>Horse Island <em>Olieán na gCapaill</em></strong></p>\n","safeName":"Horse-Island-_Olieán-na-gCapaill_","coordinates":{"irishGrid":{"sheet":"L","eastings":"576","northings":"408"},"fullIrishGrid":{"sheet":"","eastings":"57600","northings":"240800"},"tmcGrid":{"sheet":"","eastings":"457581.343","northings":"740826.367"},"geo":{"lat":"53.39835211","long":-10.14159433}},"cursor":100006,"description":"<p><strong>Horse Island <em>Olieán na gCapaill</em></strong> L576-408           Sheet 44 SW of Strawbeach, Horse appears as pleasantly grassy, but isn’t. It is an unexpectedly large expanse of rock, with very sparse vegetation. Surprisingly, rabbits are living here, but must be the hungriest of their kind in Ireland. No camping. No water. A spit of stormbeach at the NE gives a soft enough landing. <strong>Connemara West</strong> <em>Conamara Thiar</em> <strong>Slyne Head to Killary Harbour</strong> <em>Ceann Léime go dtí an Chaol Sháile Rua</em> <strong>County Galway</strong> <strong>Slyne Head – <em>Ceann Léime</em></strong> Slyne Head is a major headland and divides the west coast of Galway and Mayo from Galway Bay. It is an island headland. Slyne Head is actually the W tip of Illaunamid, the outermost of a fragmented group of islands lying off the SW tip of Connemara. There are three main groups of these islands: Illaunamid, Chapel/Duck Island, and nearest the coast, Illaunaleama – <em>Oileán Léime</em> and Doonawaul – <em>Dún na bhFál</em>. The innermost and outermost sounds are unnamed. The much-fragmented gaps on the inside of Duck Island are Cromwell’s Sound, Blind Sound and Joyce’s Sound. Tim Robinson’s map of Connemara and/or Admiralty chart 2708 are recommended for the detailed navigation required in this area. The area consists of shallow reefs and islets surrounded by deep water and is exposed to Atlantic swell from all sides. The more interesting route W towards Illaunamid passes through the chain of islands. These are divided by sounds where strong tidal currents and overfalls occur, and are formidable in wind over tide conditions. The area between Chapel Island at L529-409 and Illaunamid at L514-412 is also dotted by reefs, and should be treated with caution, even in small swell. If there are frequent breakers on these reefs, landing at Illaunamid is likely to be difficult, if not impossible. However, if conditions permit, there is scope for exploring and playing in the tidal races outside Illaunaleama –<em>Oileán Léime</em> and Doonawaul – <em>Dún na bhFál</em>. Embarkation The nearest departure point is approximately 3<em>km</em> E on the Galway Bay side, in the bay opposite Connemara Golf Club, at the NW end of a long beach (<em>Trá Mhóir</em>) at L570-432. Parking may dictate a start further E at the totally dependable Bunowen Bay at L590-417. A trip N around the headland adds a certain interest and variation to the trip. The nearest alternative landing to the NE is at Stackport at L556-434, 1<em>km</em> NE of the coastal headland inside Slyne Head. This landing is a 1.5<em>km</em> road walk W from the <em>Trá Mhóir</em> put-in. Irish Lights used this quay for ferrying goods to the island, but the road is now through a series of gates, and may be private, so please ask for permission before taking your car down to the pier. The landing is difficult to see from seaward, but is close to two small houses. More dependable is Doonloughan at L569-453, but there is limited parking. Easiest perhaps on this side is at the head of Mannin Bay at L630-460, where the main road skirts the sea and there is plentiful parking. Tides HW and LW are as for Galway.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Slyne Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"180\">3:20 before Galway HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"180\">3:05 after Galway HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>However, locals say that the north-going stream is stronger and runs for longer in each tidal cycle. SPA Storm Petrel, Sandwich, Arctic, Common &amp; Little Tern, Barnacle Goose.</p>\n","costalZone":"**The Mid-West**"}