{"name":"**Illancroagh and Heath Island**","nameHtml":"<p><strong>Illancroagh and Heath Island</strong></p>\n","safeName":"Illancroagh-and-Heath-Island","coordinates":{"irishGrid":{"sheet":"F","eastings":"786","northings":"030"},"fullIrishGrid":{"sheet":"","eastings":"78600","northings":"303000"},"tmcGrid":{"sheet":"","eastings":"478577.114","northings":"803012.771"},"geo":{"lat":"53.96214124","long":-9.85039614}},"cursor":119259,"description":"<p><strong>Illancroagh and Heath Island</strong> F786-030           Sheet 30 These two small islands jointly and effectively guard the entrance to the SE corner of Achill Sound North, a water system called Bellacragher Bay. The bay penetrates between the Corraun Peninsula and the mainland almost to Mallaranny, a narrow twisting inlet of great interest and a splendid option for a foul weather day. The embarkation point at F784-025 is just below the post office at Tonregee, halfway between Mallaranny and Achill Sound Bridge. Limited parking but with a handy stony landing. Illancroagh at F786-030 is the more interesting of the two islands. It can be landed on anywhere. There is splendid, huge, exposed bog oak on the western side, and a significant Common Gull colony in season. There are tide races all around. The tide runs E and W on either side. Wind over tide in these gaps normally happens on the ebb. These conditions provide a fun race just off the put-in point, and elsewhere at times. The tide also fills and empties round the duller Heath Island. The passage inwards from this point features strong tides at all the projecting points, and a varying landscape best savoured on the journey SE and inwards. Rhododendrons are followed by conifers, by grasslands suitable for remote yet convenient camping, then by ubiquitous peat-hags, sometimes close to the road and sometimes away from it. At the head of the bay are salmon farm tanks, always worth a visit to see these brutes leaping and displaying. The trick is to catch the tide inwards, lunch, and then catch it again outwards. Otherwise eddy-hop. Local HW is about Galway + 0230 in the furthest recesses of the bay, which is perhaps an hour later than local HW at the Bull’s Mouth. Tidal races are to be found at most of the twists and turns. The most playful ones are on either side of Illancroagh, and these are best enjoyed on the top half of the ebb. Being shallow, they do not particularly need a spring tide.</p>\n","costalZone":"**The Mid-West**"}