{"name":"**Illanmaster _– Oileán Maigheastar_**","nameHtml":"<p><strong>Illanmaster <em>– Oileán Maigheastar</em></strong></p>\n","safeName":"Illanmaster-_–-Oileán-Maigheastar_","coordinates":{"irishGrid":{"sheet":"F","eastings":"935","northings":"432"},"fullIrishGrid":{"sheet":"","eastings":"93500","northings":"343200"},"tmcGrid":{"sheet":"","eastings":"493474.271","northings":"843204.025"},"geo":{"lat":"54.32642339","long":-9.63766952}},"cursor":126707,"description":"<p><strong>Illanmaster <em>– Oileán Maigheastar</em></strong> F935-432           Sheet 23 High, square, block-shaped island located very close to the mainland but separated from it by a dramatic rock canyon. The channel is easily navigable by kayak and perhaps by other small, seaworthy boats, in good weather conditions. The passage is shallow and kayakers need to exercise good judgement in conditions when swell is running from in from W/NW direction.When entered from the W side, the passage through the high, steep, rock walls is impressive. The passage opens on the E side into an attractive bay, at the head of which (F936-426) lies a fine storm beach. The area provides an ideal lunch spot for kayakers en route from Portacloy to Belderg – <em>Béal Dearg</em>. Landing The island is steep and precipitous. Landing is difficult but possible on the sheltered ESE side onto shelving rock platforms. Easiest ascent is to traverse left to start and then to follow an obvious fault line that runs diagonally up to a grassy right hand slope. The ground is steep but the Puffin burrows give good holds on the grassy sward until one gains the ridge that sweeps in from island’s NE side. Follow this ridge line to the summit. Views are worthwhile on all sides. Camping is not a real option . Some seepage water found on rock slaps above the landing. Island is ungrazed and has a rich flora.   SPA Puffin and Storm Petrel. Puffin, Guillemot, Manx Shearwater, Storm Petrel, and Shag all breed. Chough, Oystercatcher and Rock Pipit, GBB, LBB and Herring Gull all present in small numbers May 2009.</p>\n","costalZone":"**The Mid-West**"}