{"name":"**Illaunaleama – Oileán na Léime**","nameHtml":"<p><strong>Illaunaleama – Oileán na Léime</strong></p>\n","safeName":"Illaunaleama-–-Oileán-na-Léime","coordinates":{"irishGrid":{"sheet":"L","eastings":"548","northings":"419"},"fullIrishGrid":{"sheet":"","eastings":"54800","northings":"241900"},"tmcGrid":{"sheet":"","eastings":"454781.929","northings":"741926.155"},"geo":{"lat":"53.4074664","long":-10.18416276}},"cursor":101941,"description":"<p><strong>Illaunaleama – Oileán na Léime</strong> L548-419           Sheet 44 Closest of all the group to the mainland, this is a beautiful island, only a narrow passage separating it from the mainland to the E. Sheep grazed and short grassed, even the rocks are scoured smooth, and no other Irish coastal island deems shoes more redundant. There is a very pleasant sandy beach facing E to the mainland, onto which land. There is also a storm beach landing on the W side, with a sheep pen above, a working environment. Camp pleasantly, but water was not found. <strong>Doonloughan Group</strong> Doonloughan is a beautiful mainland area of machair and beach, with a sprinkling of houses, about 7<em>km</em> NE of Slyne Head. The four islands described here are important as they create a sheltered inside channel. This is useful to know of in the context of a passage from Slyne Head to ManninBay to the NE, especially in any kind of wind conditions. The whole area outside the islands is strewn with dangerous booming reefs, and shallows of every kind. Here be dragons! Frightening waves tube, for a long way off, to great height and power, in almost any conditions. The middle channels entering this inner area on either side of Illaunamenara should also be avoided for the same reasons. The inside channel is impassable at lower water, when its two mainland piers are separated by 1<em>km</em> of sandflats.  Enter the channel from the SW Slyne Head side via the open bay inside Inishkeeragh, to a little quay at L569-453.  Enter from the NE Mannin Bay side via the sheltered deep-water channel inside Inishdugga, to a substantial and sheltered pier at L569-457.  Camping by either pier is excellent, but better at the latter.  No water found at either location, but ask at the houses. It is important if arriving at evening time to choose the campsite with open water available in the direction of travel the following morning. If necessary, wait to camp until the channels connect.</p>\n","costalZone":"**The Mid-West**"}