{"name":"**Illaunamid – _Oileán Imill_**","nameHtml":"<p><strong>Illaunamid – <em>Oileán Imill</em></strong></p>\n","safeName":"Illaunamid-–-_Oileán-Imill_","coordinates":{"irishGrid":{"sheet":"L","eastings":"514","northings":"412"},"fullIrishGrid":{"sheet":"","eastings":"51400","northings":"241200"},"tmcGrid":{"sheet":"","eastings":"451382.641","northings":"741226.338"},"geo":{"lat":"53.40023634","long":-10.2349183}},"cursor":100571,"description":"<p><strong>Illaunamid – <em>Oileán Imill</em></strong> L514-412           Sheet 44 This island is best known for its western headland, Slyne Head or <em>Ceann Léime</em>, and its lighthouse at L514-412. Illaunamid means ‘Wood Island’, because of the amount of flotsam washed up here. Robinson also terms it <em>Oileán Imill</em> (Edge/Margin Island), which Anglicises as Illaunimil. The most obvious feature of the island is the two lighthouses. Both were built in 1836. One is unused. The other flashes twice, every 15 seconds. For the story of these lighthouses and their people, read Bill Long’s excellent ‘Bright Light, White Water’. Tales include drowning tragedies during the building of the lighthouses, drowning of keepers, alleged murder of Irish Lights’ personnel on the island, shipwrecked sailors stealing boats and dismissal of keepers for drunkenness. Three big sets of solar panels are now connected into the lighthouse complex, along the southern wall. However, other features not mentioned in the book show that the keepers’ lives were not all misery. For instance, in the mid-90s, the remnants of a mini-golf course were to be seen, just to the S of the lighthouse. Alas, this is no longer evident. There is also an unusual model of a lighthouse, complete with crane, on a rock in a brackish pond. The elaborate model is the strangest sight here. It is N of the path between the lighthouse complex and the quay. It was refurbished in 2005. The model also has a small extra and easily missed feature – an outlying channel buoy in the extreme E end of the large pond. The effect of the relatively small model within the large pond/rock pool is quite realistic. The rock of the island is metamorphic (gneiss). The island is attractive with a remote feel to it. However, the impression of neglect and decay is strong around the unused lighthouse complex. The functioning lighthouse received a general clean up and was looking well in 2005. The quality of the building work in the network of houses and workrooms around the older lighthouse is impressive. Some of the fireplace mantles and capping stones are of beautifully worked granite. The assortment of debris and flotsam and jetsam, both around the lighthouse and on the storm beaches, does provide diversion for avid beachcombers. The island merits an overnight. Fauna Wildlife includes seals and rabbits. Breeding birds include Cormorant, Shag, Arctic Tern, Wheatear, Meadow &amp; Rock Pipit, Raven, Skylark, Oystercatcher and Ringed Plover. It is the best seabird and cetacean watching point in Galway. Some excellent work was done here by Davenport in 1979-1981 on spring Skua passage migration, but none appears to have been done on other species since. Pomarine Skua were spotted in nearby Ballyconneely Bay on the southern approaches in May 2003. Landing There are two landing areas, both of which are only dependable in low swell conditions. The first, and more reliable, is at a quay on the E end of the island at L518-410. It is easily spotted by a small pump-house and crane, formerly used to transfer fuel oil to the lighthouse. If the waves are too much at the quay, there is a small gully a few yards S. It leads to a small coral strand, more accessible on the top half of the tide. It is accessible at lower water, but only onto boulders. The gully is very narrow, admitting one kayak at a time. A less attractive alternative is a larger boulder beach on the N side of the quay. The second landing area is on the N side of the island, close to the W end and the lighthouse itself in a cove at L515-412. This small cove has the attractive name of <em>Fuaigh na gCaccanai</em> (Cove of the (Cormorant) Shite)! This landing is only reliable in calm conditions when all weather is coming from the S. There are steps cut in the stone towards the centre of the cove. On the W side there is a rock-choked passage topped by a concrete bridge leading to other steps. In both landing spots care must be taken to lift boats well clear of rogue waves and rising tide. Camping There are sheltered flat areas suitable for camping near the outbuildings of the older, disused lighthouse. The walk from the E landing to the lighthouse requires quite a bit of ferrying of gear. Camping is also available S of the E landing over the first hummock. Although not as protected as by the lighthouse, it is fine for reasonable weather conditions.</p>\n","costalZone":"**The Mid-West**"}