{"name":"**Illauncasheen – _Oileán an Chaisín_**","nameHtml":"<p><strong>Illauncasheen – <em>Oileán an Chaisín</em></strong></p>\n","safeName":"Illauncasheen-–-_Oileán-an-Chaisín_","coordinates":{"irishGrid":{"sheet":"L","eastings":"841","northings":"243"},"fullIrishGrid":{"sheet":"","eastings":"84100","northings":"224300"},"tmcGrid":{"sheet":"","eastings":"484075.729","northings":"724329.688"},"geo":{"lat":"53.25664528","long":-9.73738224}},"cursor":91502,"description":"<p><strong>Illauncasheen – <em>Oileán an Chaisín</em></strong> L841-243           Sheet 44 Known as Illauncasheen locally, but Illauncosheen on the OS map, this little island is situated in Casheen Bay – <em>Cuan Chaisín</em>. Ungrazed save by a single donkey, this is a small, unattractive island off the eastern side of Furnace. It provides shelter for the fleet of working boats operating from the pier opposite. Camping is theoretically possible at southern end. <strong>Kilkieran Bay</strong> <strong><em>Cuan Chill Chiaráin</em></strong> The bay N of Lettermore Island is mostly very shallow, giving paddling which varies greatly with the level of the tide. At HW, there are quite a few small islands, some inhabited, some not, and all with reasonably straightforward landings. As the tide falls, the flow between the islands increases and the channels all narrow. Some of the streams reach 3kn, and then the channels dry up, so that the whole area is seaweed-covered rocks and islets. Many of the islets then become linked at lower tides. The area is heavily dredged by fishermen for oysters and bladder-wrack seaweed. The seaweed is collected and taken away in trucks to be processed into iodine and fertiliser. There is also salmon farming. The local wildlife is spectacular with large numbers of seals, some of which are inquisitive, and otters, which quite definitely are not. Also, there are birds, Common, Herring and Lesser Black-backed Gull, and large numbers of Red Breasted Merganser. Worth visiting in its own right, the area is particularly attractive as a fallback in time of windy weather. Its combination of races and shelter can combine to give more fun than open ocean water. Embarkation From the W side, suitable for the middle section of the bay, put in is easiest at the harbour at Kilkieran L846-315itself, where there is good parking.  Kilkieran also boasts good provisions and a pub.  Smaller groups may prefer pretty Ardmore Quay L817-293 for the S end of the bay, where there is limited parking requiring courtesy.  Further N, the inner bay is easiest accessed from a smaller working quay at Flannery’s bridge in a deep inlet at L867-354.  Opportunities to put in on the E side of the bay are far too numerous to list and the choice will depend on the group and its itinerary. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"327\"><strong>Kilkieran Bay</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"66\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">5:20 before Galway HW</td>\n\n<td width=\"66\">Various</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">1:05 after Galway HW</td>\n\n<td width=\"66\">Various</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The tide flows at 1.5kn at the entrance between Ardmore Point at L818-283 and Illauneeragh at L838-273. It gets up to 2kn between North Island and the mainland, just northeast of Kilkieran. With wind over tide (usually on the ebb), a race forms.</p>\n","costalZone":"**The Mid-West**"}