{"name":"**Illaungorm North**","nameHtml":"<p><strong>Illaungorm North</strong></p>\n","safeName":"Illaungorm-North","coordinates":{"irishGrid":{"sheet":"L","eastings":"786","northings":"398"},"fullIrishGrid":{"sheet":"","eastings":"78600","northings":"239800"},"tmcGrid":{"sheet":"","eastings":"478576.916","northings":"739826.405"},"geo":{"lat":"53.39461406","long":-9.82568372}},"cursor":98395,"description":"<p><strong>Illaungorm North</strong> L786-398           Sheet 44 A low-lying yet interesting island that marks the entrance from Bertraghboy Bay to Cashel Bay. The island is very attractive and has a number of interesting features. Landing Approached from the S the best landing is onto a lovely coral beach at a small spit in the extreme SW corner. This beach may well be best for landing as the tide drops but a narrow cut just north of spit also allows access. The cut is interesting in that is has remains of an old landing place, one of three found around the island. The unsightly wreck of gantries, pontoons and galvanised walkways from a ruined fish farm operation unfortunately mars the S shoreline. The second landing is at the site of the original village located in the NW of the island. The village has super views looking N to Cashel Hill and beyond into the Glencoaghan Horseshoe of the Twelve Bens. The houses are set close to the HW mark, reminiscent of those at Inishsherk.  The remains of a small quay/landing place are located here also. Just south of the largest ruined house the remains of an old boulder choked well was found.  It contained water in January 2008 but it was not certain if it is gravity or spring fed, so its reliability is not known.  In May 2008 it was judged unusable. A third landing area with three distinctive small jetties is located further E of the village along the N shore in small bay with a small ruin just S of the landing. The island’s only tree is an atmospheric wind shaped Hawthorn dominating the NE corner. On the S shore there are outcrops of old peat, which the sea has eroded to expose some very interesting examples of bog deal. The intertidal areas almost double the island’s size at LW and provide good feeding areas for duck and wading species and the presence of Otter was noted. There was no sign of recent grazing in January or May 2008 so the diversity of flora was rich. About LW, it is possible to walk to Illaungorm South. Best camping near village and at NW corner.</p>\n","costalZone":"**The Mid-West**"}