{"name":"**Inishshark    _Inis Airc_**","nameHtml":"<p><strong>Inishshark    <em>Inis Airc</em></strong></p>\n","safeName":"Inishshark-  -_Inis-Airc_","coordinates":{"irishGrid":{"sheet":"L","eastings":"501","northings":"640"},"fullIrishGrid":{"sheet":"","eastings":"50100","northings":"264000"},"tmcGrid":{"sheet":"","eastings":"450082.915","northings":"764021.408"},"geo":{"lat":"53.60456184","long":-10.2653386}},"cursor":106092,"description":"<p><strong>Inishshark    <em>Inis Airc</em></strong> L501-640           Sheet 37 The name means ‘Sea Monster Island’. A splendid, formerly-inhabited island. There is an abandoned school, but no modern church. The pier was built in 1937 by Michael O’Sullivan of Ballycastlebeg in Cork, according to a commemorative stone nearby. The islanders in living memory went to Inishbofin of a Sunday for mass.  Expert natural meteorologists, on 28<sup>th</sup> October 1927 they saw the front coming that caused devastation to fishermen up and down the west coast, depopulating the Inishkeas.  They had no way to warn anyone and Shark, alone of ALL THE ISLANDS, lost not a single man.  There were 26 families in 1893, but the population dwindled, and the last left in October 1960, mainly for the mainland nearby. The island is rugged yet pretty. Birds The island is home to 70 or 80 Barnacle Goose each winter. Bonxie also breed here. There is an interesting, small burial ground at the harbour and a small derelict 19<sup>th</sup> Century chapel, which is called St. Leo’s, after the patron saint of the island. The church had a bell, which broke and fragmented, and it was believed that to bring any part of it on a journey would bring good luck. Emigration being what it was in the middle part of the 20<sup>th</sup> Century, North America is thought to be littered with carefully kept and much honoured little bits of the bell. Inishshark lies WSW of and is separated from Inishbofin by Ship Sound. The island has large cliffs and sea stacks on the western side. Big breakers and reflecting waves are the norm out the back of the island, providing an interesting and committing circumnavigation. The crossing of Ship Sound can be treacherous with contrary winds and many shallows, which may boom. Landing and Camping The traditional landing is inside a protective but otherwise unusable pier below the abandoned village on the E end of the S coast. The landing is onto a steep slipway or stony storm beach beside the slipway. Alternatively, use a very narrow cut providing a dependable soft landing about 100m E of the pier. The camping is excellent. The water in the well looks a little dodgy. There is also a fine landing located at the SE tip of the island L503-643 that can be missed quite easily by kayakers making direct to the old pier and slipway. A distinctive square shaped hummock on the shoreline is a useful marker to guide in those looking for this landing. There are two narrow cuts leading to a lovely hidden sandy beach. The most northerly of the two cuts is the better for landings as a boulder partially blocks the more southern one. The camping above this landing is very good and water can be found in the obvious little valley than runs away uphill. This may require a pool to be dug below the boulder area on the beach but the water quality was good in August 2010. A pair of territorial Great Skuas was actively defending two well fledged young on the NW side in August 2010</p>\n","costalZone":"**The Mid-West**"}