{"name":"**Inishturk**","nameHtml":"<p><strong>Inishturk</strong></p>\n","safeName":"Inishturk","coordinates":{"irishGrid":{"sheet":"L","eastings":"619","northings":"749"},"fullIrishGrid":{"sheet":"","eastings":"61900","northings":"274900"},"tmcGrid":{"sheet":"","eastings":"461880.485","northings":"774918.954"},"geo":{"lat":"53.70566774","long":-10.09204761}},"cursor":108639,"description":"<p><strong>Inishturk</strong> L619-749           Sheet 37 This is one of the most rugged and remote of all the inhabited islands. There were once up to 180 people resident, and now there are 62. The local national school has only 3 pupils in 2001/2012.  The island children have always gone away to secondary school as teenagers. This is one of the most rugged and remote of all the inhabited islands off the W coast. Until recently, there was no regular ferry, but long overdue perhaps, Inishturk got a new ferry on September 16<sup>th</sup> 1997. This is probably the most significant ‘Irish offshore island development’ for many years, and it’s hoped that the needs of islands and islanders are at last being taken seriously. Operating out of Cleggan and Roonah Quay, this ferry also has a real significance for kayakers, as the homeward trip becomes possible even if the weather kicks up overnight. Those who sail small boats off the W coast of Ireland must occasionally expect to fail to be behind their desks of a Monday morning. Inishturk is now a marginally more dependable objective. We wish the islanders well and hope that all this won’t change things for them, other than as they would wish. There are fantastic high cliffs at the back of the island. The western side of the island can cut up very rough and care should be taken to avoid breakers up to 100m W of the cliffs. In mirror-calm conditions or offshore easterly winds, the back of the island has huge cliffs to explore. Care should also be taken at the N of the island where fierce downdraughts can be experienced beneath the two high points. There are B&amp;Bs, pubs, and basic shops. There is a splendid circular roadway to walk. This goes inland, up the valley from the harbour, and back anti-clockwise by the southern side. Generally, the walking on the island is very good. The N and W are dramatically cliffy. Near the NE tip is a blowhole, the seaward end of which emerges through a penetrable boulder-choke, giving a scuba dive of great quality. Corncrake Formerly a Corncrake stronghold, there were 26 pairs counted in 1988. Paddlers heard at least one in 1992, but they were all gone by 1994. Landing The landing place is in the main village and harbour (by Nimmo) on the E side, which has recently been extended and is very sheltered. Also, landing is possible at beaches just S of the main harbour, if necessary. Off the mouth of the harbour is a bar, which can give a sporting arrival or departure. But the water inside or outside the bar is well sheltered. In the Great War, the Royal Navy favoured this as an anchorage. Portdoon          L607-737 A narrow cut in rocks yields a superbly sheltered natural harbour, halfway along the southern coast. Camping is easy, but it is a good walk to the pub.</p>\n","costalZone":"**The Mid-West**"}