{"name":"**Inishlackan – _Inis Leacan_**","nameHtml":"<p><strong>Inishlackan – <em>Inis Leacan</em></strong></p>\n","safeName":"Inishlackan-–-_Inis-Leacan_","coordinates":{"irishGrid":{"sheet":"L","eastings":"722","northings":"377"},"fullIrishGrid":{"sheet":"","eastings":"72200","northings":"237700"},"tmcGrid":{"sheet":"","eastings":"472178.268","northings":"737726.908"},"geo":{"lat":"53.37424742","long":-9.92098487}},"cursor":97424,"description":"<p><strong>Inishlackan – <em>Inis Leacan</em></strong> L722-377           Sheet 44 An attractive, low island in the mouth of Bertraghboy Bay. Inishlackan is distinguished from the land by a conspicuous, rectangular, water-tank structure on the highest point of the N side of the island. There is water in rain barrels outside most houses. Water used to be pumped by a windmill (now ruined) from a walled pond up to the nearby water storage tank. Formerly inhabited, it is now occasionally so in summer. The first summer dwelling was a restored schoolhouse in the NE corner above the harbour / beach. By 2005 there were up to half a dozen holiday homes, for that niche market. At least one of them was seriously well appointed, at the W end, complete with solar panels and well laikd out grounds. There is a large, shell-midden in sand hills at the NE corner of the island, by the schoolhouse. Inishlackan is a good stopover with easy access to the extremely pretty Roundstone village. Roundstone is a posh tourist centre, with pubs, restaurants, and some shops, but is poorly provisioned. It is the centre for intense tourist use of this stretch of mainland coast. The island is worth the visit. Landing and Embarkation Land in many places but it is best at a very sheltered pier with a sandy beach by the NE corner. There are rocky shores on almost all sides, with reefs offlying. Circumnavigation is iffiest at the SW corner. There is camping near the pier and elsewhere. The mainland embarkation is from a pier at Erlough at L717-386, in a bay about 1<em>km</em> to the N of the island, reached by taking the first left turn after the Garda Station as one leaves Roundstone for Ballyconneely.  Roundstone Pier and most of Roundstone were developed by Nimmo as a piece of private enterprise, one of a number of controversies that attached to the great man.</p>\n","costalZone":"**The Mid-West**"}