{"name":"**Inishbofin – _Inis Bo Finne_**","nameHtml":"<p><strong>Inishbofin – <em>Inis Bo Finne</em></strong></p>\n","safeName":"Inishbofin-–-_Inis-Bo-Finne_","coordinates":{"irishGrid":{"sheet":"L","eastings":"540","northings":"648"},"fullIrishGrid":{"sheet":"","eastings":"54000","northings":"264800"},"tmcGrid":{"sheet":"","eastings":"453982.107","northings":"764821.203"},"geo":{"lat":"53.6128443","long":-10.2068427}},"cursor":106941,"description":"<p><strong>Inishbofin – <em>Inis Bo Finne</em></strong> L540-648           Sheet 37 The name means ‘White Cow Island’. A regular ferry serves this lovely island, out from Cleggan in County Galway at L602-584 (pier by Nimmo). The population is 150. There are pubs, hotels, hostel, shops, chipper and restaurant. Inishbofin is a large attractive English-speaking island, popular with tourists. The grid reference is for the new main pier. The village area is well spread out, ribbon fashion, along the shore of the S-facing harbour and bay area. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Ship Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NW</td>\n\n<td width=\"180\">3:35 before Galway HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SE</td>\n\n<td width=\"180\">2:50 after Galway HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Landing The sea state at the entrance to the main harbour and bay can be very rough for tidal reasons. Two white towers on the island face the entrance to the main harbour, on a bearing of 032<sup>o</sup> (true), and lead in through the safest entry point. The entrance can boom in heavy swell to either side of the best route. The best landing for small craft is on a slipway beside the old pier further into the bay than the new pier, or a shingle beach behind it. In emergency or on circumnavigation, there are landings on every side of the island, but fewest in the N. Circumnavigation Watch for <em>Dun Na hInine</em> (Daughter’s Fort), an almost detached stack at the NW point. Otherwise, the circumnavigation is interesting if undramatic by local standards. The most turbulence may be expected at Ship Sound and around the Stags of Bofin in the NW at L505-670. Camping There is good camping with easy landing and privacy at L537-644. This is by the ruined fort at the harbour mouth, opposite the village. Access to the village area is then easiest by sea.  The pleasant 10 minutes walk around is also entirely manageable, certainly worth it for the quality of the camp spot. Any campsite on the (convenient) village side of the main harbour will lack privacy.  Minor warnings are that noise late at night from outside the pubs across the water may bother, and camping too near the fort means you could be cut off by the tide.  <em>Caveat camptor</em>. For a longer stay, camping is undoubtedly best made around at the eastern end of the island, in the horseshoe shaped bay, which has a very pretty beach for a nice soft landing, very sheltered, but a bit public. The end of the beach where Inishlyon meets Inishbofin used to be popular but is no longer allowed. Coastal erosion defence measures are being put in place in the form of newly planted Marram grass. This landing spot necessitates a long walk to camp or stay at Day’s Hostel at L543-653 (095 45855), not to mention the pub and the good shop. Corncrake Inishbofin was always a Corncrake stronghold, but there were only 14 recorded in 1988. By 1994, there were none. The good news is that 5 were serenading in 2003, and 3 in 2010.</p>\n","costalZone":"**The Mid-West**"}