{"name":"**Inishnee – _Inis Ní_**","nameHtml":"<p><strong>Inishnee – <em>Inis Ní</em></strong></p>\n","safeName":"Inishnee-–-_Inis-Ní_","coordinates":{"irishGrid":{"sheet":"L","eastings":"735","northings":"383"},"fullIrishGrid":{"sheet":"","eastings":"73500","northings":"238300"},"tmcGrid":{"sheet":"","eastings":"473477.994","northings":"738326.768"},"geo":{"lat":"53.37994795","long":-9.90170372}},"cursor":97742,"description":"<p><strong>Inishnee – <em>Inis Ní</em></strong> L735-383           Sheet 44 The island has a population of 30. It almost fills the western part of Bertraghboy Bay. The grid reference is for the highest point, which is to the S of the figure-eight-shaped island. The island lies E of Roundstone. Nowadays, it is connected to the mainland by a modern, new bridge, replacing the picturesque relic built by the Congested Districts Board around 1890. Going from the modern and popular holiday village of Roundstone to the island is stepping back a generation or two in time. The island has a rocky shore all around. There are no sandy beaches. The eastern side is quite interesting in that there are a large number of small, hand-built little harbours and jetties. These are now all disused, and at times, may only be identified at close quarters. One may land on the E coast almost anywhere. The S/SW coast is steeper and landing is not so easy. The northern and western shores may be used to land, but involve carries over uneven ground. Water may be obtained from houses on the island. There are no shops. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Bertraghboy Bay</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">5:20 before Galway HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">1:00 after Galway HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Flows of 2kn are reported at the entrance to the bay between Inishtreh and Inishnee and on the western side may be up to 1.5kn just at and south of the bridge, where there are some shallows.</p>\n","costalZone":"**The Mid-West**"}