{"name":"**Inishbiggle**","nameHtml":"<p><strong>Inishbiggle</strong></p>\n","safeName":"Inishbiggle","coordinates":{"irishGrid":{"sheet":"F","eastings":"746","northings":"067"},"fullIrishGrid":{"sheet":"","eastings":"74600","northings":"306700"},"tmcGrid":{"sheet":"","eastings":"474577.975","northings":"806711.983"},"geo":{"lat":"53.99440999","long":-9.91282505}},"cursor":118196,"description":"<p><strong>Inishbiggle</strong> F746-067           Sheet 30 The population is 26, mainly adults. Inishbiggle is a large, attractive, low, hummocky island with a dozen or so inhabited houses, perfect for a half day expedition on foot or much longer.  Traffic is sparing, the local boat is the curragh, Irish is spoken and hay is saved by scythe. The post office is at F746-067. The abandoned school F753-067 (shown as a church on the OS sheet) thrived from 1948 to 1998.  Electricity arrived in 1978 and reliable water in 1990 (from Ballycroy side).  Previously water was local until piped in after 1981 from Achill side across the infamous Bulls Mouth, but the strength of the flow there defeated the engineers. The church at F758-066 is a “must see”, built in the 1870s with the best of quarried sandstone from Achill.  No nails were used in the timberwork, only dowels, all still deemed perfect in the 2000s when a local team of craftsmen set about to refurbish the lot.  The red pine timber was entirely free of worm.  Originally Protestant, the church was rededicated to interdenominational Christian use in 2003. Access was traditionally from Achill.  The islanders campaigned for generations for a cable car on the Achill side across Bulls Mouth and finally they lost that war in 2004.  The decision was instead to build waterborn ferry pier facilities, but on the mainland Ballycroy side, where the tidal flows are not quite as harsh.  Essentially Inishbiggle now looks E to the mainland instead of W to Achill.  The mainland road eastwards was much improved and is well signposted off the main road near Ballycroy. Embarkation and Landing The main access to Inishbiggle is nowadays from the mainland at Dorans Point F775-078 where there is a substantial pontoon and pier.  The ferry is run by Michael Leneghan 00 353 (87) 126 9618.  Landing is then at a similarly modern gabion reinforced pontoon and pier at Gobnadoogha F764-077 in the NE of the island.  It seems that Eamon O’Cuiv, the Minister for Arts, Heritage, the Gaeltacht, and the Islands, is serious about and has shown more genuine interest in the islands, even the English speaking ones, than any other minister, ever. Inishbiggle is at the northern end of the Achill Sound “inside route” and is separated from Achill Island by the Bull’s Mouth at F737-068. One may land on a beach of small stones, and at a modest slipway F739-069, just E of the Bull’s Mouth.  One may launch from the slipway opposite, on Achill, at F735-071, where there is some parking. Another handy embarkation point on the Achill side is at Bunacurry Harbour at F718-044 which is 2.5<em>km</em> SW of the Bulls Mouth. This is a stone and mud flat area, with a manageable carry even at LW, but plenty of parking. Vehicular Access All vehicles such as there are on Inishbiggle were driven there via Annagh Island that lies to the SE.  It is possible to drive from the mainland across the inner sound at a spot called locally Claggan F786–046 to F783-046 on Annagh, for a couple of hours when the sound dries at LW.  There is a fine boreen across Annagh S of centre to about F773-053, from where the strand to Inishbiggle can be driven for the bottom half of the tide.  6 hours dry and 6 wet is the rule, springs or neaps.  The inishbiggle drive-in point is just below the church. Anecdotally, this complex access becomes famous virtually every nationwide election or referendum held in Ireland.  Policy dictates that all the islands off the coast are balloted a few days before the actual polling day, for fear it might be necessary to try again and again.  Anytime there is a blow and the ferry can’t go to Inishbiggle, the local sergeant of the Gardai sets off from Claggan to Annagh and then to Inishbiggle.  Mostly he gets the business done quickly enough but not always.  All too often he has been caught unable to drive home that day, and in the line of duty, he has famously been photographed, up to his waist, carrying the ballots shoulder high, a beacon of civic duty.  Inishbiggle votes have therefore been dubbed “floating votes”. Ballycroy was the scene of the filming of the iconic “Ballroom of Romance” in 1981</p>\n","costalZone":"**The Mid-West**"}