{"name":"**Inishgalloon**","nameHtml":"<p><strong>Inishgalloon</strong></p>\n","safeName":"Inishgalloon","coordinates":{"irishGrid":{"sheet":"F","eastings":"623","northings":"035"},"fullIrishGrid":{"sheet":"","eastings":"62300","northings":"303500"},"tmcGrid":{"sheet":"","eastings":"462280.525","northings":"803512.723"},"geo":{"lat":"53.96255092","long":-10.09879696}},"cursor":116653,"description":"<p><strong>Inishgalloon</strong> F623-035           Sheet 30 Impressive large island lying 500m S of Gubalennaun Beg quay (by Nimmo) (locally “Purteen”). The island is high and whale backed, grassy on top, and of sufficient steepness to make camping sites a premium. The island is grazed by sheep. Views in all quarters are spectacular. Landing and Water Landing onto sloping rock shelves at obvious cut in NE corner. Given any swell it could be tricky enough, onto rock shelves.  Swimming may be necessary if seas are lifting. No information re low water situation, which may allow more kelp and softer cuts to become available.  Scramble to top.  Water not found. The island has 3 sea caves on its E flank and a gem of a sea cave at its W end. This cave cuts right through the island N/S but also has a W exit. The N entrance is accessible at higher stages of the tide but is decidedly narrow at the lower end of the tidal cycle. All entrances are narrow and kayakers entering need to be wary of swell conditions. The run through is “interesting”. Tides run hard on the ebb off the S/SE corners of the island. Breeding Shags, Herring and Greater Black backed Gulls. <strong>Achill</strong> <strong>Island (Outer) – the Round of Achill Head</strong> The round of Achill Head may be done from either side, depending on conditions. The wind direction is everything, but beware of katabatics (downdraughts) on the lee side of the final ridge out to the head, a notorious local feature. The round trip from Doogort to Keem is about 26<em>km</em>. If going to Keel, it is even longer at over 33<em>km</em>. The round of Achill Island as a whole is about 80<em>km</em>, especially if the beautiful Achillbeg is taken in, and it is worth taking at least three days. This expedition round Achill Head will always be the crux of that trip, and has to be one of the foremost Irish sea paddling trips, to be grabbed when conditions allow, and with caution. Those on expedition along the coast will find it considerably easier to stick to the inner route through Achill Sound, but the round of Achill Head will be an integral part of the outer route. A trip around Achill and the Mullet Peninsula to the N is a week’s unrivalled expedition. This trip involves a challenging open crossing to Duvillaun Mór from Achill Head itself or Saddle Head to its NE. The Round of Achill Head is described here from the northern side, starting at Doogort. Doogort F672-089           Sheet 22/Sheet 30 This is an important launching or finishing point for the route outside the Mullet peninsula or Achill Head. There is a good beach – it is best to land on at the western end under the hotel. There are also a campsite with facilities and water. It is a bit of a carry from the campsite to the beach. The quay just NW has a landing and water, but no camping. Beware of overfalls to the E of the beach on the ebb. They are just W of Ridge Point at F704-109. Annagh Strand F602-077           Sheet 22/Sheet 30 The outer, western part of Achill is dominated by the two summits of Slievemore (671m) at F650-087 and Croaghaun (664m) at F554-058. Between these two, on the northern side, cut off from civilisation altogether, lies the utterly beautiful N-facing Annagh Strand. It is 9.5<em>km</em> or more into the anticlockwise round of Achill Head. The beach is backed by Lough na Keerogue (Lake of the Beatles). From Doogort, the coast follows the cliffs around, with at least one memorable arch, until a truly remarkable pap (teat) shaped hill (269m) at F607-076 lies just SE of the beach. This is a worthwhile trip in itself, either by hillwalk or paddle, and a must on the circumnavigation, as 16<em>km</em> lies ahead. The megalithic tomb at F602-076 is easily found as it has a ‘modern’ <em>bothán</em> (hut) built in its middle, anything but a normal sight, probably of Inishkea islander construction. The beach is backed by fairly steep boulders which are covered by the tide a couple of hours before and after HW.  Launching/landing is not recommended during this time, particularly in surf, which tends to dump.  Timing is critical.  Best to come and go between LW and mid tide on the sand. <strong>Achill</strong></p>\n","costalZone":"**The Mid-West**"}