{"name":"**Inishglora**","nameHtml":"<p><strong>Inishglora</strong></p>\n","safeName":"Inishglora","coordinates":{"irishGrid":{"sheet":"F","eastings":"616","northings":"308"},"fullIrishGrid":{"sheet":"","eastings":"61600","northings":"330800"},"tmcGrid":{"sheet":"","eastings":"461580.894","northings":"830806.735"},"geo":{"lat":"54.20745581","long":-10.12192334}},"cursor":124297,"description":"<p><strong>Inishglora</strong> F616-308           Sheet 22 Inishglora is a long and narrow low-lying island. It is interesting for its monastic ruins at the eastern end, and for its beehive stone formations. The church roof collapsed in 2003 after standing for centuries (millennia?). The Children of Lir The cairns on the island are said to be the resting places of the children of Lir. The children, Finola and her brothers Aedh, Conn and Fiachra were changed into swans by a jealous stepmother, Eva. She was jealous of the love of the children for their mother Eve, her eldest sister, who had died. The swans would keep the wit, the nature, and the speech of humans, as well as the power of music. This would continue until a prince from the N married a princess from the S, and they heard the voice of the Christian bell bringing the light of the new faith over the land. In all, they spent 300 happy years on Lough Derryvaragh in County Westmeath, 300 desperate and stormy years around Rathlin Island off the NE of Ireland (the “Sea of Moyle”), and finally 300 years at peace around Inishglora. Then, Saint Kemoc changed them back into humans. Alas, they were elderly crones. Here on Inishglora, as Christians, they ended their days at last. This is the saddest tale of ancient pre-Christian Ireland, well worth reading up on. Saint Brendan established the monastery here in the 6<sup>th</sup> century. He later became famous for being the first European to travel to America (Newfoundland), in a leather rowing boat, a large version of the <em>currach</em> still common today on the W coast of Ireland. Storm Petrel extensively colonise the E end of the island. Breeding waders Snipe, Dunlin, Oystercatcher, Ringed Plover. In the 1821 census, 7 people were living on the island. Landing and water There is a landing place opposite Inishkeeragh on a sandy beach on the southern side, just inside the eastern tip. Landing might also be possible on a storm beach in a shallow bay, midway along the northern side. There is a disused well at the eastern end, but the water is not good. Wells need use.</p>\n","costalZone":"**The Mid-West**"}