{"name":"**Inishfadda Islands**","nameHtml":"<p><strong>Inishfadda Islands</strong></p>\n","safeName":"Inishfadda-Islands","coordinates":{"irishGrid":{"sheet":"L","eastings":"803","northings":"390"},"fullIrishGrid":{"sheet":"","eastings":"80300","northings":"239000"},"tmcGrid":{"sheet":"","eastings":"480276.555","northings":"739026.562"},"geo":{"lat":"53.38781745","long":-9.79983916}},"cursor":99352,"description":"<p><strong>Inishfadda Islands</strong> L803-390           Sheet 44 Appropriately named, this is a long finger of an islet(s) just off the shore.  Detached from the mainland at all stages of the tide in the SE of outer Cashel Bay, a strong current flows through the gap on its S side. Land to choice but especially under the old ruined cottage in the ESE.  Marvel at the stone lintels above the windows.  Mussels everywhere.  Ungrazed.  Difficult to explore. <strong>Cashel Bay – Inner Islands</strong> The very sheltered inner Cashel Bay is very pretty and a most pleasant spot.  A road runs close along its N side.  Often bypassed, a mistake. Near the W end is a prominent boathouse L794-423 on the shoreline. Beside and around the boathouse is</p>\n<ul>\n<li>a leisure facility consisting of a child swimming pool gouged out of the foreshore, prettily surrounded by large blocks,</li>\n<li>a diving board arrangement for adult attention,</li>\n<li>a “three-and-in” type football pitch, and</li>\n<li>the boathouse itself, altogether a marvellous community facility.</li>\n</ul>\n<p>This is private land.  The boathouse is reached by a closed gate, opposite which is parking L794-424 for a handful of cars.  The 150m carry to the watertline is acceptable. At the E end is a public pier L805-423, very handy, room for a couple of cars at least, but it dries at the bottom half of the tide, so that at LW the mudflats reach out 100m.  Timing is important. Common Seal may breed, as several are to be seen in the locality and the habitat is suitable. Good numbers 45+ of Red-breasted Merganser and a single Goosander were seen in the area in March 2008.  The male Goosander was seen again in May 2008.</p>\n","costalZone":"**The Mid-West**"}