{"name":"**Inishkea North**","nameHtml":"<p><strong>Inishkea North</strong></p>\n","safeName":"Inishkea-North","coordinates":{"irishGrid":{"sheet":"F","eastings":"565","northings":"223"},"fullIrishGrid":{"sheet":"","eastings":"56500","northings":"322300"},"tmcGrid":{"sheet":"","eastings":"456481.876","northings":"822308.608"},"geo":{"lat":"54.12974916","long":-10.19598058}},"cursor":122813,"description":"<p><strong>Inishkea North</strong> F565-223           Sheet 22 The North Island is separated from the South Island by a narrow sound. The most visible feature is a huge prominent burial mound just E of the village at the SE tip, known as the Baily Mór. Its humpbacked shape is dominant from most angles, and it boasts carved stone slabs said to relate to St. Colmcille. Baily Beg is the smaller conical mound nearby. The dead of both islands were buried on the North Island. Landings Land at sheltered sandy beaches in the rounded bay in the SE, underneath the abandoned village. There are landing points also in many other spots. These include the N side of the SE tip, and a beach on the NE side, just short of the N tip. Escape is also possible on the Atlantic side, at the head of a deep cut behind the village, and probably other spots. Water Water has been found in a well that may need a little tidying, at the N end of the houses, in from the N end of the larger beach. Camping Camping in the bay in good weather is best at the Baily Mór mound, which is open but scenic, and otherwise attractive. In bad weather, some shelter may be had at the village. Birds One of the most important machair breeding sites for waders in Ireland. Lapwing, Dunlin, Redshank, Ringed Plover and Snipe. The breeding waders on the island’s main machair were splendid in May 2009. Redshank, Snipe, Dunlin, Lapwing, Ringed Plover, Oystercatcher, all present in good numbers. Also breeding Arctic Terns ( c.100 pairs) (at least 3 colonies) and Little Terns (c.20 pairs ) the latter also on the other machair NW west of  village.. The islands N of Inishkea have over recent years  a growing breeding  Greylag Goose population of a semi resident/feral nature. Little Tern were seen acting territorially in 2004 (fighting), which may indicate that they are starting to breed. Fauna There is a seal colony at the NE. David Cabot, noted naturalist, with an interest hereabouts, counted 1,000 grey seal here, the largest ever such count in Ireland. Seals do migrate and the local population was 693 in 1995 according to Oliver O’Cadhla. Tides A shallow spit Gubnacusha-Pluddany Rocks extends well E of the E point of the island.  With wind over, it surfs dangerously for up to 2<em>km</em> off.</p>\n","costalZone":"**The Mid-West**"}