{"name":"**Inishkeas/Duvillauns Group**","nameHtml":"<p><strong>Inishkeas/Duvillauns Group</strong></p>\n","safeName":"InishkeasDuvillauns-Group","coordinates":{"irishGrid":{"sheet":"F","eastings":"614","northings":"183"},"fullIrishGrid":{"sheet":"","eastings":"61400","northings":"318300"},"tmcGrid":{"sheet":"","eastings":"461380.819","northings":"818309.484"},"geo":{"lat":"54.09518215","long":-10.11924608}},"cursor":119599,"description":"<p><strong>Inishkeas/Duvillauns Group</strong> F614-183           Sheet 22 This remarkable group of islands is well worth visiting. Embarkation Embarkation is from Portmore, a sheltered sandy S-facing beach about 3.5<em>km</em> W of Blacksod Point, and 1<em>km</em> S of a prominent tower on a low hill, known as Glash. The surf is much smaller at W end at a small slip called Port F614-183. Camping is best on machair at Fallmore F619-184, the E end of the beach. Surf can be an issue off the tip of the stormbeach off Portmore, and also 1.5km NNW at Surgeview Point.  To compound things, the tide runs hard in this area, especially on the ebb.  Alternatively, the most dependable launch of all is from Blacksod Pier itself, 4<em>km</em> E at F653-186, where the camping is less private but still wonderful.  This pier is by Nimmo, as is Saleen Pier 12<em>km</em> to the North at F670-290. The southern part of the Mullet peninsula is a stronghold for Corncrake. Tides The main west coast flood runs north from Achill Head, past Black Rock, then NNE past the outside of the group, from 3:20 before Galway HW until 3:05 after. The flood and ebb pour into and out of what is almost a sheltered ‘lake’ confined between the group of islands and the Mullet. The flows through the gaps seem to start a couple of hours earlier, at 5:15 before Galway HW until 1:00 after. They flood generally northeast/north through the channels between the Duvillauns, the Inishkeas and the Mullet. Certainly, in Blacksod Bay south of the Duvillauns, the ENE flood runs at about these times. The streams are weak inside the lake but achieve 2.5kn in springs off salient points and flow strongly through the gaps in the inner islands. From inside the islands, the ebb pours out of the ‘lake’ the same way and the timings are the reverse of the flood. The Spanish Armada Ships driven into the Blacksod area north of Achill could turn left or right. On 21<sup>st</sup> September 1588 two Armada ships sailed in. The <em>Duquesa Santa Ana</em> turned left into Elly Bay and safety, the <em>Rata Encoranada</em> turned right towards Achill. It put down its anchor off Doona point. It dragged and the ship went aground. All the crew got off safely. They then force marched around to Elly Bay and joined the <em>Duquesa Santa Ana</em> They all got going again but were shipwrecked in Loughros More Bay in Donegal. The survivors of all this walked overland to Killybegs where they were lucky to find the <em>Girona</em>, and joined it on its way to Scotland and safety, they hoped.</p>\n","costalZone":"**The Mid-West**"}