{"name":"**Inishmore – _Inis Mór_**","nameHtml":"<p><strong>Inishmore – <em>Inis Mór</em></strong></p>\n","safeName":"Inishmore-–-_Inis-Mór_","coordinates":{"irishGrid":{"sheet":"L","eastings":"883","northings":"088"},"fullIrishGrid":{"sheet":"","eastings":"88300","northings":"208800"},"tmcGrid":{"sheet":"","eastings":"488274.811","northings":"708832.979"},"geo":{"lat":"53.11833334","long":-9.66906392}},"cursor":85501,"description":"<p><strong>Inishmore – <em>Inis Mór</em></strong> L883-088           Sheet 51 Population 900. Inishmore is the largest and most westerly of the three main islands. It has several small off-liers, dealt with here as a group. With its airport and all-weather ferry from Galway City, Inishmore, especially around the town Kilronan, has a very ‘mainland’ feel to it. Landings L883-088        Kilronan pier (<em>Cill Rónáin)</em>, for all mainland type facilities. L887-073        Killeany <em>(Cill Éinne)</em> pier, by Nimmo, near the airport.  Remote. L828-105        Kilmurvey (<em>Cill Mhuirbhigh</em>), W of centre on the northern side, has a sheltered sandy beach. The best campsite is on a grassy area on the western side of the bay, just N of the beach. This is just the other side of a pier, where there is an easy rocky landing, and good water in a well. This is the obvious departure point on passage NW. L777-116        Bungowla (<em>Bun Gabhla</em>), a sheltered pier and slip, facing across the sound to the Brannock Islands at the W end of the island. Sheltered slipway, manageable camping, water. This is the jumping off point for the navigation of the Dun Aengus cliffs, the unbroken 16<em>km</em> line of cliffs of the SSW side of Inishmore. This passage is a major challenge for kayakers. L831-092        In exceptionally calm conditions, in someone else’s empty plastic boat, or in extreme distress, there is the possibility of a landing at about mid  point on the SSW coast. This is under Gortnagapple (<em>Gort na gCapall</em>), 1<em>km</em> E of Dun Aengus. A sloping natural slipway lies at <em>Port Bhéal an Dúin</em> on the right hand side of the easterly of two bays, where the cliffs are lowest of all. Rumour has it that this place is very occasionally used by curraghs. This is the slipway made famous in the classic film ‘Man of Aran’. Otherwise, these cliffs are 14<em>km</em> of lee shore, best attacked from <em>Bun Gabhla</em> on the ebb tide in total calm, finishing Portdeha. L904-067        Portdeha.  A fine sandy beach protected by high dunes on S/W side.  Exposed to SE winds which may cause it to surf.  An attractive spot and well positioned for any run down the Dun Aengus cliffs from E or W.  Ideal place to take a stroll down towards Straw Island. No water found.  Camping would be a struggle, having to carry gear up the beach and over high dunes behind, besides then finding spots amongst tough marram grass. Certainly possible but areas of much easier camping abound. Mega-Clasts Clasts are any particles of solid rock broken down by erosion and deposited in a new setting.  Mega-clasts are huge such clasts.  Recorded in numerous other localities along the W Scottish and Irish seaboard, nowhere are mega-clasts as obvious as on the barren karst of Inismore.  What could be powerful enough to lift huge angular / isolated sections of wave-cut platform weighing up to 2.5 <em>tonnes</em> and catapult them 50<em>m</em> upwards and leave them stranded in linear heaps 50<em>m</em> inboard of the cliff top? Recent research has produced two theories.  These mega-clasts may be the result of “recent” tsunamis in the North Atlantic, say the last 1,000 years, estimated from the degree of weathering. These tsunamis are often set off by submarine landslides in Volcanic archipelagos such as the Azores. Alternatively, or maybe as well, a recent theory, developed in nearby Galway University, suggests mega-clasts have been brought about by “freak” storm waves. Conventional ideas on the size of storm waves are shifting due to reams of data gathered by worldwide tsunami alert buoy systems, as well as data from offshore rigs, in ultra deepwater 1500<em>m</em>+. If huge freak waves are actually high frequency events, this would have significant implications for ship design and maritime insurance. Freak waves are finding growing acceptance amongst the scientific community. <strong>Rock Island/Eeragh Island</strong></p>\n","costalZone":"**The Mid-West**"}