{"name":"**Inishkea (Inis Gé) South**","nameHtml":"<p><strong>Inishkea (Inis Gé) South</strong></p>\n","safeName":"Inishkea-(Inis-Gé)-South","coordinates":{"irishGrid":{"sheet":"F","eastings":"558","northings":"210"},"fullIrishGrid":{"sheet":"","eastings":"55800","northings":"321000"},"tmcGrid":{"sheet":"","eastings":"455782.01","northings":"821008.896"},"geo":{"lat":"54.11788318","long":-10.20606028}},"cursor":121954,"description":"<p><strong>Inishkea (Inis Gé) South</strong> F558-210           Sheet 22 The S island is perhaps the more attractive. The landing place is at the ruined village onto a sandy beach beside a stone pier. The beach is sheltered between the pier and Rusheen Island, which is accessible at LW. The pier has been extended and strengthened in recent years and many boats may be able to lay alongside for at least the top half of the tide. It is an outstandingly beautiful and pleasant island, not to be missed if in the area. Approached from the SE, the island is seen as low lying, with a white tower on the summit of a low hill, which, when aligned with another on the shoreline, gives a bearing of 120<sup>O</sup>. The two towers transit to the gap between Duvillaun Beg and Gaghta Island, useful to yachts. The ruined building on the skyline is the village school at the northern end of the village. As of 2007 there are up to six holiday homes finished or heading that way, up from one only for a generation. A lot of activity/people and boats tied up at pier over May Bank Holiday 2010. Minimum of 6 and possibly 8 houses now re-developed.  In October 2012 seven refurbished holiday houses were counted. Water Good reliable water can usually be had in a small well, 100m S of the pier, just above the first beach, Porteenbeg, where sand meets grass. Camping Good camping may be had at the village behind the houses. Beaches in rounded bays to the S of the village give good landings and camping, but not water. On circumnavigation, escape is possible on the Atlantic side at the head of at least three deep channels almost dissecting the island towards the southern end. Climbing There is what appears to be unlimited and excellent rock climbing on steep gneiss at the south-eastern end. Stan Pearson and Ian Stevens have been working here since 2002. There is a clean crag at the southern tip, and other crags on the outside as one moves N. Grades vary between severe and E1, 10m to 25m. Routes can look improbable, but the rock is fantastic with hidden finger jugs. On balance, the crags here are not as comprehensive as Gola, but it is quiet, for now anyway. Fauna It is renowned for its winter population of Barnacle Goose and Snipe. In 2009 5 geese wre electronically tagged by Doctor Cabot and friends, and tracked to NE Greenland, the first successful such scientific effort.  There is also a large population of seals.</p>\n","costalZone":"**The Mid-West**"}