{"name":"**Island Eddy**","nameHtml":"<p><strong>Island Eddy</strong></p>\n","safeName":"Island-Eddy","coordinates":{"irishGrid":{"sheet":"M","eastings":"351","northings":"164"},"fullIrishGrid":{"sheet":"","eastings":"135100","northings":"216400"},"tmcGrid":{"sheet":"","eastings":"535064.754","northings":"716431.034"},"geo":{"lat":"53.1943557","long":-8.97175836}},"cursor":82849,"description":"<p><strong>Island Eddy</strong> M351-164          Sheet 52 Eddy is a large and pretty island, low-lying, 2<em>km</em> NW of the mouth of Kinvara Bay. Formerly inhabited by seven families, Eddy was abandoned in 1947. The islanders settled on the mainland nearby, mostly at Doorus and Clarinbridge. The village is in a line set back from the beach at the northern side of the E end. It is now mostly in ruins and overgrown, though one house has been restored as a holiday home.  Deciduous trees behind the village gave good shelter. The island is grazed in summer. The bigger part of the island lies W of the village and is reached by a narrow causeway. There are enormous lagoons on the northern and south-western sides. A coral sandbank projects from the eastern end of the island. This dries out all the way to the mainland at the bottom of very low spring tides, when Razorfish can be dug on the lowest parts. Embarkation Put in at a choice of launchings. All three piers mentioned are by Nimmo.</p>\n<ul>\n<li>The nearest embarkation point is from a quay 2<em>km</em> NE of the island at M360-181, called locally Lynch’s Quay [Nimmo], 6<em>km</em> WSW of Clarinbridge.</li>\n<li>Killeenaran at M372-167, 2<em>km</em> E, is more popular.</li>\n<li>Most conveniently accessed (but height barrier) is the N facing beach (locally called <em>Trácht</em>) at M341-138, (by road) 2<em>km</em> S and 5<em>km</em> NW of Kinvara, where there is plenty of parking, and toilets.</li>\n<li>Parkmore Pier [Nimmo] at M354-138 has parking and easy access.</li>\n</ul>\n<p>Landing Land at the beach on the E end of N side, at the abandoned village. Camping Good camping can be had almost anywhere. No water was found.</p>\n","costalZone":"**The Mid-West**"}