{"name":"**Kilkee to Doonbeg**","nameHtml":"<p><strong>Kilkee to Doonbeg</strong></p>\n","safeName":"Kilkee-to-Doonbeg","coordinates":{"irishGrid":{"sheet":"Q","eastings":"886","northings":"604"},"fullIrishGrid":{"sheet":"","eastings":"88600","northings":"160400"},"tmcGrid":{"sheet":"","eastings":"488574.667","northings":"660443.355"},"geo":{"lat":"52.68367118","long":-9.64800527}},"cursor":77976,"description":"<p><strong>Kilkee to Doonbeg</strong> Q886-604 to Q962-663   Sheet 63 This section is around 14<em>km</em>. Kilkee to Farrihy Bay is about 5<em>km</em> and is a pleasant trip with rock layers, sloping steeply into the sea. George’s Head protects Kilkee Bay. The head has a cave opening to the S. The bay just to the N is Chimney Bay. Offshore are two rocky outcrops. That nearer Kilkee is known as Biraghty More at Q883-633, which is a popular scuba dive  site. It boasts a good jump into the sea on the landward side. Facing Biraghty More on Corbally Point is a small cave. Further N is Biraghty Beg. Farrihy Bay has a reef at the mouth. On the southern side of the bay is Corbally village where landing is possible, but there is a long carry to the road. Corbally village is mostly holiday cottages now, but the native villagers were noted Irish speakers up to 1950 or so. Clerical and lay ‘<em>Gaelgeoirí</em>’ were common visitors in summer months. There is a rocky beach at the NE corner of the bay with good road access, but sharp reefs force a long carry at LW. This is not a rough weather landing spot by any means. Donegal Point at Q896-654 is turbulent at most times. It separates Farrihy Bay from a small, sheltered inlet to its N, called Bealnalicka. There is a rock beach here with steep access above the inlet to an in-fill quarry, which has road access. There are splendid caves at the inner, southern side of the inlet. One cave is a gem. It goes all the way S, through the headland into Farrihy Bay. The roof of the cave has collapsed halfway along, and being open to the sky, there are curious lighting effects even in poor ambient light conditions. Expect rough conditions at the southern entrance to the cave, and in the middle. Two reefs run outwards from the N entrance to the caves. Ballard Bay is noted for its sheer spectacular cliffs. Visit the caves inside a distinctive notch called the Horse Shoe at Q905-658. The caves are in the southern side of the bay, just W of the Napoleonic signal tower at Q910-656. A rocky shoreline leads around the headland to Carrickfadda known locally as the Blue Pool, a rock ledge at the outer NW end of the headland. Carrickfadda is popular with fishermen, despite some being tragically swept out to sea by boomers over the years. On the W side of Doonbeg Bay, there is the remains of a castle at Killard Point. There is good road access to a sheltered slipway at Q953-673. Access is also possible at HW, right up into Doonbeg itself, at a slipway N of the bridge, at Doonbeg Castle. The Doonbeg area is also shown on Sheet 57.  Doonbeg pier is by Nimmo.</p>\n","costalZone":"**The Mid-West**"}