{"name":"**Leamareha**","nameHtml":"<p><strong>Leamareha</strong></p>\n","safeName":"Leamareha","coordinates":{"irishGrid":{"sheet":"F","eastings":"608","northings":"175"},"fullIrishGrid":{"sheet":"","eastings":"60800","northings":"317500"},"tmcGrid":{"sheet":"","eastings":"460780.937","northings":"817509.66"},"geo":{"lat":"54.08783824","long":-10.12804252}},"cursor":121246,"description":"<p><strong>Leamareha</strong> F608-175           Sheet 22 Land at shingle or rocks on the northern side. Greater Black-backed Gull breed. <strong>Inishkeas</strong> These islands are not named for Inis Gé (the ‘islands of geese’ in Gaelic), despite their ornithological significance. Instead, they are named for ‘Insulam Gedig’ in Latin, or Naomh Géidh or Saint Gé in Irish. The first written reference to the islands was in a letter from Pope Innocent III appointing a local Bishop in 1198. There was a thriving and stable Irish speaking population here from the late 18<sup>th</sup> to the early 20<sup>th</sup> Century. Nevertheless, no native writer ever emerged to record their lives from their own perspective, as happened elsewhere. Their story is pieced together from outside records. The population was stable at about 300 between the two islands for much of the time, though the South Island nearly always held more people than the North Island. They ran out of turf by the 1830s, importing it thereafter. They survived the 1840’s famine better than the nearby mainland, partly through fishing and piracy. Circumstances suited piracy because calm weather conditions in April and May becalmed many a sailing boat hereabouts. This all got out of hand so the coastguard placed a presence on the island to stop the practice. Ravaged always by storms, the islanders were almost beaten by a big one in 1857, and were finally defeated in 1927. As protection against the wind, they developed a special style of lazy bed for the potatoes, 2m across and 30cm higher on the windward side, to protect the fragile young plants. The climate being milder than the mainland, potatoes could be sown in February or even January, giving the islanders a huge competitive advantage at the market in Belmullet. They kept cows for milk, pigs for meat, and sheep for sale and for wool. They even kept horses to work the land, but more so on the N island where the widespread machair is more equine friendly. They also grew barley and their <em>poitín</em> was well known over a wide area, being favoured by the Boycotts, a well-known but not particularly popular local landed family. Their <em>poitín</em> was despised by the artist Paul Henry who visited in 1909. The boat crew got sozzled and gave him a trying journey back to Westport. A pier was built on the North Island in 1863 but it was blown away within the year. A sturdier model was built on the South Island beginning in 1888, which is there to this day and looking well, sheltering the strand in front of the village. Schools were established on both islands about 1899. Three policemen were stationed on the North Island about the same time to try to stop the worst of the illegal distillery industry. Relations between the islands were never good, except when absolutely necessary. Burials took place only on the North Island. The North Island also took in the Coastguard in 1849 and a police barracks fifty years later. Perhaps all this influenced things so that the North Island took the pro-Treaty side in the Irish Civil War of 1922/23, and the South Island the Republican side. On one occasion, they all drew up on their own side of the narrow channel between the islands and pegged stones at each other. In 1927, the two islands were united in grief when, on the 26th October, their young men were cruelly taken, ten of them lost in one storm. A big low came in and they were fooled by the lull at its centre. The fishermen were yards off the North Island when the westerly winds struck suddenly and strongly. Many couldn’t retreat, and the last to drown were almost on the mainland well to the E. Each of the five currachs contained two brothers, mostly in their late teens. The community spirit was broken and another drowning a couple of years later emptied the islands by 1939. SPA Peregrine, Barnacle Goose, Golden Plover, Common, Arctic &amp; Little Tern. Corncrake numbers have dwindled to nothing, and the last bird heard singing was in 2000. One of the most important machair breeding sites for waders in Ireland. Lapwing, Dunlin, Redshank, Ringed Plover and Snipe. Grey Seal colony is the biggest in Ireland.</p>\n","costalZone":"**The Mid-West**"}