{"name":"**Lettermullan Island – _Leitir Mealláin_**","nameHtml":"<p><strong>Lettermullan Island – <em>Leitir Mealláin</em></strong></p>\n","safeName":"Lettermullan-Island-–-_Leitir-Mealláin_","coordinates":{"irishGrid":{"sheet":"L","eastings":"826","northings":"215"},"fullIrishGrid":{"sheet":"","eastings":"82600","northings":"221500"},"tmcGrid":{"sheet":"","eastings":"482576.046","northings":"721530.301"},"geo":{"lat":"53.23116927","long":-9.75881514}},"cursor":90100,"description":"<p><strong>Lettermullan Island – <em>Leitir Mealláin</em></strong> L826-215           Sheet 44 A sprawling ‘mainland’, island on the eastern side of the entrance to the main part of the bay. Lettermullan Island is central to more than half a dozen off-lyers on its W, NW and N. To the W, Golam – <em>Gólam</em>, Freaghillaun More – <em>Fraochoileán Mór</em> and Freaghillaun Beg – <em>Fraochoileán Beag_surround Crappagh – _An Chnapach</em>, which is itself attached to Lettermullan by an unmarked causeway/bridge of recent construction. Beware of the passage inside Crappagh at very LW. To the NW and N, Inisherk – <em>Inis Eirc</em>, Dinish – <em>Daighinis</em> and Illauncosheen (Illauncasheen locally) – <em>Oileán Chaisín</em> surround Furnace – <em>Fornais</em>, which is similarly attached to -Lettermullan. Lettermullan is joined on the E to Gorumna Island (and eventually to the mainland) by road bridges to the NE. The bridge between Lettermullan and Gorumna is passable with ease only at very HW but circumnavigators can get through all these gaps with effort at all stages. The gap between Crappagh and Lettermullan has extensive shallows and may be more difficult. Beware when navigating hereabouts on lower or dropping tides. Tides flow strongly, ebbing S or W through the narrows. Beside the Lettermullan/Gorumna bridge, on the Gorumna side, is a pub that serves good seafood. The northern shore has nothing interesting. The eastern shore has a number of working quays. The southern shore has a beautiful bay E of centre at L843-216, inside Dog Island – <em>Oileán an Mhadra</em>, and a wild, westerly section off which clapotis will always be present. Camping Camping for the tourer may be conveniently had at L826-215 on the remote commonage at the SW tip. This is just inside and opposite the signal tower at Golam Head on Golam Island, at the eastern side of a sheltered N-facing bay. The bay is created by Golam Island, which is not totally cut off.</p>\n","costalZone":"**The Mid-West**"}