{"name":"**Loop Head to Bridges of Ross**","nameHtml":"<p><strong>Loop Head to Bridges of Ross</strong></p>\n","safeName":"Loop-Head-to-Bridges-of-Ross","coordinates":{"irishGrid":{"sheet":"Q","eastings":"686","northings":"471"},"fullIrishGrid":{"sheet":"","eastings":"68600","northings":"147100"},"tmcGrid":{"sheet":"","eastings":"468578.997","northings":"647146.338"},"geo":{"lat":"52.55974683","long":-9.9382895}},"cursor":76827,"description":"<p><strong>Loop Head to Bridges of Ross</strong> Q686-471 to Q735-504   Sheet 63 7<em>km</em> of cliffs lie between Loop Head and the Bridges of Ross. Tides Tides hereabouts, even in close, are the main west coast offshore stream</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Loop Head to the Bridges of Ross</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NE</td>\n\n<td width=\"170\">3:20 before Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SW</td>\n\n<td width=\"170\">3:05 after Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Loop Head Loop Head is a big square-cut, jutting headland. It consists of vertical black cliffs over 30m high. There is a detached section right at the head itself. This is called Diarmuid and Gráinne’s Rock. It is a vertical tower 100m by 20m, separated from the mainland by a deep, narrow gorge. In very calm conditions, it is possible to paddle through this gap. Diarmuid and Gráinne fled from Fionn and the Fianna, a long time ago. Their near capture is recorded widely all over Ireland in places named after them, such as this. From the mainland, marvel at the cairn on top of the rock and wonder how it got there. It wasn’t Diarmuid or Gráinne. Mick Fowler and Steve Sustad, two English climbers, put it there in 1990. They have specialised in climbs such as this. They abseiled down, swam out, climbed up, and then tyroleaned back (shinnied along a rope suspended between rock and mainland) to the mainland, leaving their mark behind. The feat has not been repeated. Around the Head, there is always a swell, which booms on the off-lying reefs. There is a huge lighthouse which is rarely visible from below, except from way out. The cliffs relent after Black Rock at Q703-490. The view southwards from here looks bleak as rising black cliffs stretch out to sea. The detached rock, 2<em>km</em> NE of the head, is Gull Island at Q701-482. The prominent point by it is Bullaunaleama, with its significant arch, with hundreds of birds occupying its ledges. 3<em>km</em> ENE of the Head lie two shallow bays with storm beaches where landing is possible, Fodry Bay and Ross Bay at Q733-500, handy to the road. The Bridges of Ross is a N facing, natural harbour. Once there were two bridges, but one fell into the sea. The remaining one is on the western side of the mouth of the inlet, just E of the Point of Ross. There are two inlets within the harbour. Access is normally easier from the wider one, being the more E of the two. There is a track down to a boulder beach. The bay is not completely cut off in rough conditions, as the mouth is wide enough. Care should be exercised though.</p>\n","costalZone":"**The Mid-West**"}