{"name":"**Moynish More**","nameHtml":"<p><strong>Moynish More</strong></p>\n","safeName":"Moynish-More","coordinates":{"irishGrid":{"sheet":"L","eastings":"866","northings":"947"},"fullIrishGrid":{"sheet":"","eastings":"86600","northings":"294700"},"tmcGrid":{"sheet":"","eastings":"486575.388","northings":"794714.529"},"geo":{"lat":"53.88942162","long":-9.72549394}},"cursor":115248,"description":"<p><strong>Moynish More</strong> L866-947           Sheet 30 An outfarm with cattle and sheep, this is a large double headed island, with boreens and tracks. There is a sandy LW beach at the NNE in a small bay.  Good camping is on short grass on the E side of the bay. <strong>Achill Island Area</strong> Achill (14,672ha) is the biggest and most populous Irish island with 2,500 full-time residents. It is connected to the mainland by a swivel bridge at Achill Sound, built 1888. ‘L’ shaped, high mountains mark the scenery all along the SW side. Only in the far NE corner is there flat land. At Keel, there is a substantial machair, and behind it is the most populated part of the island where there are pubs, restaurants, and all amenities. Two-thirds of the way down the W side is Dooega, a sheltered harbour, and at the S tip lies Achill’s little sister Achillbeg, a wonderful island. The E shore on the edge of Achill Sound is low and boggy. Near the S end of the sound is a Granuaile castle worth visiting. The RNLI station is close by. Midway up the sound is the bridge at the village of Achill Sound, where there are all facilities. On the N coast is the hamlet of Doogort, under Slievemore Mountain, with its beautiful beach and pier, backed by machair. During the famine era of the mid 19<sup>th</sup> Century, Edward Nangle ran the most energetic Protestant ministry ever experienced in Ireland. Generally, the various Christian churches in Ireland do not proactively proselytise (convert) each other’s members. Nangle went in hard and succeeded to a degree, but at a price. He opened schools and even a hotel. He stands critically judged by history in that he only offered food to the hungry who would become Protestant. Those accepting this bribe were called ‘soupers’, a pejorative term all over Ireland to this day. He also operated on Inishbiggle. Paul Henry (1876 – 1958) the noted Belfast landscape artist spent years on Achill and some of his best works were painted here – Launching the Currach, Potato Diggers, and Granuaile’s Castle.</p>\n","costalZone":"**The Mid-West**"}