{"name":"**Mutton Island**","nameHtml":"<p><strong>Mutton Island</strong></p>\n","safeName":"Mutton-Island-27","coordinates":{"irishGrid":{"sheet":"M","eastings":"297","northings":"233"},"fullIrishGrid":{"sheet":"","eastings":"129700","northings":"223300"},"tmcGrid":{"sheet":"","eastings":"529665.942","northings":"723329.586"},"geo":{"lat":"53.25565704","long":-9.05405856}},"cursor":84376,"description":"<p><strong>Mutton Island</strong> M297-233          Sheet 45 Situated 1<em>km</em> immediately S of the entrance to Galway City docks and harbour at the Claddagh. The main pier at Galway is the only one to be named after its designer – Alexander Nimmo, the great maritime engineer of the early 19<sup>th</sup> Century. No other one man changed the face of the west of Ireland more than he, ever. In the aftermath of the famine of 1821, the official response was to build up the infrastructure of western Ireland, which then lagged behind the rest of the United Kingdom, of which it was then part. He is responsible for 40 piers altogether between Waterford and Sligo, besides all the roadways we now call the national primary roads in the entire area from Clare to Mayo.  A practical visionary, he forced the official hand to keep building after the immediate effects of the famine had dissipated.  The results of his efforts made similar efforts in the great famine of the 1840s the more effective. A non-portageable causeway has joined Mutton to the mainland since 2000. The causeway facilitates a new sewerage treatment plant for the city, the location chosen in controversial circumstances in spite of protests from conservationists. Mutton is useful more as a pitstop than as a waystop. The whole island is taken over by the sewerage works, except for a small swampy portion on the eastern side. Land anywhere on the eastern side. Camping is forbidden… it would be very unattractive anyway. All Galway bound traffic keeps E of the island, and be careful at night. The low tower on the southern side is no longer a lighthouse. <strong>Aran Islands</strong> Sheet 51 The Aran Islands are an experience unlike anything else in Ireland, the maritime Burren, ruggedly beautiful.  Inisheer on the Clare side is the smallest, the prettiest, and the most accessible.  Inishmaan in the middle is the most traditional and remote, yet very progressive.  Inishmore is the largest, the most dramatic, almost mainlandlike, such is its popularity.  Inishmore can be accessed by air or ferry from Galway City, but most people head out by smaller craft from villages on the Clare or Galway coasts, Doolin or Rossaveal. Embarkation – Clare side Doolin in County Clare is the obvious embarkation place on the Clare side. Keep N of Crab Island at the harbour mouth, as the S side enjoys a world renowned reef surfwave. Inisheer is 8<em>km</em> WNW. There is no other embarkation point hereabouts, with cliffs for many kilometres either side. Embarkation – Galway side Passenger ferries go from Rossaveal. There is no one obvious embarkation point for kayaks on the Galway side for Inishmore. Set out from anywhere convenient on the Connemara coast, probably around Lettermullan.  Departure from the island N to the mainland requires care in identifying the landing spot, as the mainland coast is low-lying and rocky. The islands off the Connemara coast tend to merge with the mainland background. The best navigational markers are the signal tower on Golam Head and the small, automated lighthouse on Croaghnakeela. Tides Local HW/LW is the same as Galway. The flooding tide fills Galway Bay through the four sounds around the Aran Islands.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"327\"><strong>Aran Islands</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"76\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">In</td>\n\n<td width=\"173\">5:20 before Galway HW</td>\n\n<td width=\"76\">Various</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">Out</td>\n\n<td width=\"173\">1:05 after Galway HW</td>\n\n<td width=\"76\">Various</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The direction of the flood is northeast through the sounds either side of Inishmaan, NNE on the Clare side and east on the Galway side. Ebb tide timings and directions are the reverse in all cases.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Western (Dun Aengus) cliffs of Aranmore</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NW</td>\n\n<td width=\"180\">3:20 before Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SE</td>\n\n<td width=\"180\">3:05 after Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Tidal streams northwest and southeast of the group, off the Galway and Clare coasts, are weak. South Sound between Inisheer and the County Clare mainland achieves only 1kn in springs and North Sound between Inishmore and the mainland even less, 0.5kn. Streams in the middle two sounds east and west of Inishmaan are much stronger. Be careful of both central sounds with wind against tide, which occurs mostly on the ebb as prevailing winds are from the southwest. The stream between Inishmaan and Inishmore, called Gregory’s Sound, reaches 1.5kn in springs. Also, being surrounded by cliffs, quite a sea state rises in Gregory’s Sound. In westerly winds, a sea state occurs when the swell claps against the cliffs on the southwest of Inishmaan. The stream between Inishmaan and Inisheer, called Foul Sound, also reaches 1.5kn in springs, but lacks the reputation of Gregory’s Sound, there being no cliffs.</p>\n","costalZone":"**The Mid-West**"}