{"name":"**Mweenish Island _Oileán Mhuighinse_**","nameHtml":"<p><strong>Mweenish Island <em>Oileán Mhuighinse</em></strong></p>\n","safeName":"Mweenish-Island-_Oileán-Mhuighinse_","coordinates":{"irishGrid":{"sheet":"L","eastings":"764","northings":"294"},"fullIrishGrid":{"sheet":"","eastings":"76400","northings":"229400"},"tmcGrid":{"sheet":"","eastings":"476377.372","northings":"729428.656"},"geo":{"lat":"53.30070926","long":-9.85467746}},"cursor":94333,"description":"<p><strong>Mweenish Island <em>Oileán Mhuighinse</em></strong> L764-294           Sheet 44 A large, well-populated Gaeltacht island, 9<em>km</em> SE of the entrance to Bertraghboy Bay and attached to the mainland by a road bridge to the NE. The passage under the bridge is passable at the higher parts of the tide. One Corncrake was heard singing here in 2003. Mweenish is the home place of the Galway Hooker, the traditional wooden, gaff-rigged, tumble-homed sailing boat of the W coast of Ireland. Hookers very nearly went extinct as a working boat a century ago, but have enjoyed a considerable revival since about 1970 as a leisure craft. There are now 15 or 16 of them on the water. One such hooker, the Saint Patrick, built on Mweenish in 1906 and skippered by Paddy Barry, crossed the Atlantic in 1986, and has since gone to Greenland. She also sailed to other Arctic destinations including beyond the 80<sup>o</sup> latitude parallel off Spitzbergen in 1990. Saint Patrick slipped her mooring and sunk at Glandore in 2003… <em>may she rest in peace</em>. Paddy Barry went on to achieve even more fame by negotiating Canada’s North West Passage in 2003 and in 2004/2005 Siberia’s North East Passage, in each case in ‘Northabout’, the sailing craft specially designed and built for such purposes by Jarlath Cunnane of Dublin. Landing and Camping There are several working piers and quays, but the points of greatest interest to kayakers are the three beaches. The nicest is at L764-294 in the SW-facing elbow of the island, with good camping on machair in the dunes behind the beach, and good parking. This beach would be the best embarkation point for Mason – <em>Oileán Máisean</em> or MacDara’s Island – <em>Oileán Mhic Dara</em>. More reliably sheltered is the E-facing, smaller beach at L774-284, on the eastern side of the southern tip. Here, there is limited parking but excellent camping beside the ruin of a house at the southern end of the beach. Otherwise camping is impractical as the fields are stocked. There is a tide-dependent beach and a good flat grass area at the NE side opposite the bridge at L768-299.</p>\n","costalZone":"**The Mid-West**"}