{"name":"**Oghly Island – _Oileán an Chlaí_**","nameHtml":"<p><strong>Oghly Island – <em>Oileán an Chlaí</em></strong></p>\n","safeName":"Oghly-Island-–-_Oileán-an-Chlaí_","coordinates":{"irishGrid":{"sheet":"L","eastings":"748","northings":"391"},"fullIrishGrid":{"sheet":"","eastings":"74800","northings":"239100"},"tmcGrid":{"sheet":"","eastings":"474777.719","northings":"739126.585"},"geo":{"lat":"53.38744143","long":-9.88249663}},"cursor":97986,"description":"<p><strong>Oghly Island – <em>Oileán an Chlaí</em></strong> L748-391           Sheet 44 This medium sized island, remote despite nestling just off the E side of Inishnee, was reported when this <em>Oileáin</em> project began in 1991 as showing no evidence of previous habitation or of water, but there were two wooden huts on the island. Now in 2008 there is a house and various outbuildings, probably including the two huts.  Solar panels on the boathouse beside the pontoon landing at the NE at L748-391 provide power, as does the wind generator up by the house to the SE, in the shelter of a mature stand of conifers.  With all the appearances of a summer-house only, there are modern additions, such as a sunroom. And land maintenance.  Paths have been cleared around the island for walking.   Planting has been aggressive, with well mature conifers arounf the house in the NE, and experimental trees such as eucalyptus, contorted pine, alder, sally, and even rhododendron (no kidding), Rhododendron Ponticum, a native to the Pontiac mountains. Ponticum is unusual among Rhododendrons in that it is lime tolerant. Almost all others prefer lower pH levels. Finest development of all is the tidal swimming pool in the SE, created by a simple garage, over which broods an ornamental elephant.  Full marks, daddy. The coast is rocky all around, but totally weed covered, so landings may be effected quite easily, downwind. <strong>Cashel Bay Islands</strong> A group of quite diverse islands are located in that part of the inner parts of Bertraghboy Bay, in or about the entrance to Cashel Bay. There is an inner Cashel bay and an outer Cashel bay.  The whole area is attractive especially if paddling from S/N, as there are great views of Cashel Hill and Twelve Bens, as well as a feeling of kayaking in close proximity to the mountains. <strong>Cashel Bay – Outer Islands</strong> The group of eight islands at outer Cashel Bay, in ENE Bertaghboy Bay, is dominated by the distinctive height of Croghnut Island. Most of these islands are flat and low lying, which seems to exaggerate the 30m summit of Croghnut. The island’s summit is a very useful navigation aid. All these islands have extensive areas inter-tidal zones that dry at LW, thus giving good circumstances for a variety of bird species, and Otter. Croghnut Island and Illauncroghnut to its N become joined at LW, as do Illaungorm North and South, so kayakers need to plan ahead to avoid embarrassment.</p>\n","costalZone":"**The Mid-West**"}