{"name":"**Rusheen Island**","nameHtml":"<p><strong>Rusheen Island</strong></p>\n","safeName":"Rusheen-Island","coordinates":{"irishGrid":{"sheet":"F","eastings":"561","northings":"212"},"fullIrishGrid":{"sheet":"","eastings":"56100","northings":"321200"},"tmcGrid":{"sheet":"","eastings":"456081.949","northings":"821208.852"},"geo":{"lat":"54.11976258","long":-10.20157114}},"cursor":122384,"description":"<p><strong>Rusheen Island</strong> F561-212           Sheet 22 Rusheen is a small tidal islet off the strand in front of the South Island village. One may walk out at HW. It appears as an undistinguished islet, and one may land anywhere. Rusheen might not even have achieved individual mention here, save for its extraordinary history. It was a major centre of the whaling industry in Ireland in the first years of the 20<sup>th</sup> Century. Then as now, the Norwegian whaling industry wanted to do things its own way. Seasonally controlled at home, they established out-stations in other countries to bridge the gaps. They set up one such station in 1908 at Rusheen. They rented the island from the Congested Districts Board who had bought out the whole of Inishkea. It appears they also paid rent to the islanders, who liked to think they owned the place, and wouldn’t be persuaded otherwise. This may have been a Norwegian solution to a Norwegian problem, but was more likely an Inishkea solution to an Inishkea problem. Within months there was a thriving industry, with modern buildings, piers and slips, though made of wood, Norwegian style. Three whaling boats killed an average of 60 whales per annum, of all main types but mostly Fin. The Norwegians kept themselves to themselves, living on their boats, but some learnt Irish to deal with the workers. Steam power helped with the hauling and boiling of the whales to reduce them to oil and fertiliser, but water was in short supply. Hence the dam to be seen behind the houses on the South Island. The S islanders coveted all the employment for themselves, and wouldn’t let N islanders work for the Norwegians. This actually suited everyone in a roundabout way. The southerners could afford to employ mainlanders to till their fields and harvest their crops for them. North Island fishermen thrived because less fishermen meant better fishing. Also, lobsters seemed to thrive on the discarded whale offal. So did the pigs of the South Island which all went feral. Cray and lobster were plentiful and valuable, and were transported live. The cray went to Paris and the lobsters to faraway London. The whaling only lasted until 1911 when a combination of events ended it. There was a major strike. Further, the stench was unbearable. Even the mainlanders many kilometres away to the E complained. Finally, a fall off in demand for whale products ended the enterprise. The rusting and rotted remains of this endeavour are still to be seen as litter all over Rusheen. No drinking water was found.</p>\n","costalZone":"**The Mid-West**"}