{"name":"**Saint MacDara’s Island – _Oileán Mhic Dara_**","nameHtml":"<p><strong>Saint MacDara’s Island – <em>Oileán Mhic Dara</em></strong></p>\n","safeName":"Saint-MacDara’s-Island-–-_Oileán-Mhic-Dara_","coordinates":{"irishGrid":{"sheet":"L","eastings":"723","northings":"299"},"fullIrishGrid":{"sheet":"","eastings":"72300","northings":"229900"},"tmcGrid":{"sheet":"","eastings":"472278.242","northings":"729928.584"},"geo":{"lat":"53.30422782","long":-9.91633962}},"cursor":95177,"description":"<p><strong>Saint MacDara’s Island – <em>Oileán Mhic Dara</em></strong> L723-299           Sheet 44 A most attractive island, 7<em>km</em> S of the entrance to Bertraghboy Bay. Named <em>Cruach na Cara</em> on the OS 1:50,000 map, but nobody calls it that. It is uninhabited. 300 Barnacle Goose were found here in April 1994, but whether they were waystopping or wintering is not known. It is a place of annual pilgrimage on the 16<sup>th</sup> July every year. Saint MacDara is the patron saint of Galway Hookers, traditional sailing boats, which always dip their sails when passing the island. The church is of 12<sup>th</sup> Century construction. The roof fell in during the 19<sup>th</sup> Century and was restored in 1977.  An old graveyard became exposed in the big storms of January 2014. Landing and Camping Land at an attractive, sheltered, sandy beach on the eastern side below the church. There is excellent camping by the beach. There is another landing on the SE, S of the spit, on a pebble beach, necessary perhaps in easterly or north-easterly wind. Embarkation The best known launching point for Mason or MacDara’s is the beach in the SW-facing elbow of Mweenish Island at L764-294. Consider also Ard East pier, at the disused fish processing plant at L757-312, where endless parking. <strong>The Skerd Group – <em>Na Sceirde</em></strong> An impressive collection of rugged islets, lying 14<em>km</em> SSW of the entrance to Bertraghboy Bay. The whole is a network of rocks, bays, narrow channels, cuts, rocky reefs and small outlying rocks, though very much dominated by Skerdmore, which is bigger in area than one would at first expect, and is also highest at nearly 20<em>m</em>. Well worth the journey on a good day, these islets are said to have the greatest feeling of remoteness of all Irish offshore islands. As one approaches from the N, the combined mass appears to be one. In fact, the group consists of a cluster of high, rocky islands, separated by narrow channels. The channels divide the mass into blocks, mainly Skerdmore and Skerdbeg, each with outliers.  Skerdmore is by far the largest and highest block, to the SW of the middle channel, and Skerdbeg next biggest, to its NE. The OS sheet is less than accurate in this regard. The layout of the group is quite complicated. Skerdmore is rather horseshoe-shaped and faces E. Skerdbeg lies off the mouth made by its prongs, creating a reasonably sheltered interior embayment. There are rocks and hummocks lying off both islets, including a set that runs E/W from Skerdbeg towards the middle of Skerdmore, thereby dividing the interior embayment into two parts, N/ S of these rocks. The N part is accessible from the N, and the S part is much more easily entered from the S. The two parts of the embayment are joined by narrow channels through the rocks, the most navigable of which is towards the E side, but even this may not be passable from N to S at extreme LW, but some are easily so at other levels. Kayaking through the channels is quite possible in calm conditions but the entire area has an aura of danger, and is probably quite hazardous in swell. Embarkation The nearest launching point is 11<em>km</em> NW at the beach in the elbow of Mweenish Island at L764-294. It is also practical to set out from anywhere around Roundstone or the Bertraghboy Bay area generally, and perhaps break the journey at Croaghnakeela at L690-324. Breeding Herring Gull, Great Black-backed Gull, Shag, Black Guillemot and possibly Oystercatcher. Grey Seals.</p>\n","costalZone":"**The Mid-West**"}