{"name":"**Scanlan’s Island**","nameHtml":"<p><strong>Scanlan’s Island</strong></p>\n","safeName":"Scanlan’s-Island","coordinates":{"irishGrid":{"sheet":"M","eastings":"253","northings":"104"},"fullIrishGrid":{"sheet":"","eastings":"125300","northings":"210400"},"tmcGrid":{"sheet":"","eastings":"525266.854","northings":"710432.38"},"geo":{"lat":"53.13916899","long":-9.1169552}},"cursor":81530,"description":"<p><strong>Scanlan’s Island</strong> M253-104          Sheet 51 Scanlan’s Island is a low, cultivated, agricultural island set out in large fields, lying 3.5<em>km</em> NE of Ballyvaughan. It is barely an island, being cut off only at HW, and being circumnavigable only on the very highest tides. The rest of the time it is accessible by land from the N at M258-115, near Finavarra village. Scanlan’s is noted here for the tidal race that sets up on the ebb at the narrows at its southern tip at M252-103. This is between the island and the mainland where Poulnaclogh Bay flows into Ballyvaughan Bay. The race runs due W. A significant height difference is discernible over as little as 50m, and the run  off in springs, with wind over, can go for over 500m. Tide Race Paddlers prefer playing in this race to the more powerful Aughinish Point race nearby, because of its ease of access and relative safety of escape. This race flows into the enclosed Ballyvaughan Bay, whereas Aughinish flows into the more open water of Galway Bay. It is shallow and bumpy with even a hint of westerlies – good fun to be in. Access is from Bishop’s Quarter beach at M245-095, 1<em>km</em> SW and 2<em>km</em> NE of Ballyvaughan. The beach is easily accessible to vehicles, with a good car park and camping. Ballyvaughan has all facilities. Slack water immediately outside the narrows is as Galway HW and LW. The stream at the narrows and inside Poulnaclogh Bay can be up to +0100 flooding and ebbing. The most powerful flow at the narrows is the first part of the ebb. This is normal for such configurations, especially after heavy rain, as some fresh water fills Poulnaclogh Bay.  Indeed the surface water downstream of the narrows can taste quite fresh.  The lower half of the ebb usually yields longer flatter waves, a bit less confused, that bit more amenable.  However, the situation is very variable. The whole area teems with bird life in winter. On land is found Snow Bunting, on Loch Murree Whooper mute and even Whistling Swan in 2010, beside regular winter Widgeon, Pochard and Teal. On the sea there are Brent Goose, many Merganser, Long-tailed Duck, and especially Divers. More than 130 Great Northern Diver have been counted in recent times. The area is particularly noted for the rarer Black Throated Diver. Clive Hutchinson’s ‘Birds in Ireland’ records a flock of 18 in 1985. Singles and small groups are regular visitors. Grey Phalarope were seen here in significant numbers in October 2001.</p>\n","costalZone":"**The Mid-West**"}