{"name":"**Scattery Island**","nameHtml":"<p><strong>Scattery Island</strong></p>\n","safeName":"Scattery-Island","coordinates":{"irishGrid":{"sheet":"Q","eastings":"976","northings":"526"},"fullIrishGrid":{"sheet":"","eastings":"97600","northings":"152600"},"tmcGrid":{"sheet":"","eastings":"497572.691","northings":"652644.972"},"geo":{"lat":"52.61537905","long":-9.51255515}},"cursor":74184,"description":"<p><strong>Scattery Island</strong> Q976-526          Sheet 63 The island seems to have been named for a dragon (<em>Cathach</em> in Irish, giving <em>Inis Cathach</em>). It has a long and varied history and its origins are mostly associated with St. Senan, born in 488 A.D. He founded the Christian settlement there in the 6<sup>th</sup> Century. It was a holy island until the Vikings took over for a century or so before being recaptured by Brian Boru in 975. The Vikings must have been pleasantly surprised when they first arrived, to find the access door to the round tower at ground level. This makes it the most easily accessible round tower in Ireland. The island was inhabited until 1978. No artificial fertiliser was ever used on these fields so the island is of ecological interest as a semi-wild grassland. The south, west and north of the island away from the main buildings is wild and rugged but has good wildlife interest especially at the lagoon areas near the lighthouse and at the north end. Widgeon, Teal, Curlew, and Redshank were seen in good numbers in January 2012. 1 Hen Harrier was at the small pond in the centre of the island. There is an abandoned village on the northern end of the E side. Many of the cottages have fallen into disrepair and access is now denied with security fencing in place. The lighthouse and battery are at the southern point. The battery is in good condition but access to the roof through the hole in the ceiling is now impossible. Metal grids prevent entry to the inside of the battery. The lighthouse was first established in 1872. The old lighthouse cottage is in poor condition but there is evidence of some repair work being planned. By January 2012 the island has become much more managed with a small visitor centre, toilets and OPW staff quarters located in newly furbished cottages above the main landing pier. There is a well managed and maintained way marked trail that guides the visitor around the main monastic remains, round tower and churches. There is what looks like a peat marina cut into the sod at the southern end of the E side. This is just N of the lighthouse. It could hardly have been a commercial success. The island has plentiful rabbit and in 1999, Golden Plover and a Short-eared Owl. Tides The tidal streams between the mainland and the islands tend to be stronger than between the islands. In each case they flow southeast with the flood and northwest with the ebb. Landing and Camping Land on Scattery at a muddy-sandy beach at a pier towards the northern end of the E side. Also, less conveniently further over S towards the battery/lighthouse. Camping is possible anywhere, but permission is needed from Dúchas. The water in the well behind the monastery is fresh and good to drink.</p>\n","costalZone":"**The Mid-West**"}