{"name":"**Stags of Broad Haven – _Na Stacaí_**","nameHtml":"<p><strong>Stags of Broad Haven – <em>Na Stacaí</em></strong></p>\n","safeName":"Stags-of-Broad-Haven-–-_Na-Stacaí_","coordinates":{"irishGrid":{"sheet":"F","eastings":"838","northings":"479"},"fullIrishGrid":{"sheet":"","eastings":"83800","northings":"347900"},"tmcGrid":{"sheet":"","eastings":"483776.385","northings":"847903.005"},"geo":{"lat":"54.36651011","long":-9.78851453}},"cursor":126043,"description":"<p><strong>Stags of Broad Haven – <em>Na Stacaí</em></strong> F838-479           Sheet 22 No amount of forewarning prepares the visitor for the reality. Only a few places truly merit this assertion. One thinks of Skellig, Moher, Aran, but these Stags are worthy of inclusion on any such list. Unlike the others, these Stags are little known, greatly enhancing their fame among the few fortunate enough to have visited. There are five stags in all – huge, dramatic, pointy topped rocks usually circled in foam. They lie 4<em>km</em> from the beach and 2.5<em>km</em> from nearest land. They are best seen from the SW. All but one have arches, and one is entirely bisected by a long narrow dramatic cave. The passage through and around the Stags is one of the significant Irish sea kayaking experiences. Embarkation The embarkation place is at Portacloy <em>– Port a’Chlóidh</em> at F840-440, a sheltered, sandy beach, attractive and N-facing. There is good camping just behind the beach on commonage, but ask for permission. Water is available in local houses. Launching and landing is easier at the pier NW of the beach under most conditions, but when there is any swell, this sweeps across the slip and can deposit small boats several feet lower down, which can be painful.  Also, the camping there is less satisfactory. There are no provisions available locally – this is a very remote spot. A watchtower on the headland marks the western side of the entrance to the bay. The whole coastline hereabouts, particularly from Portacloy W, has arches, caves, channels and passages second to none anywhere. These are easily enjoyed in plastic boats. Bring good head-torches for the caves, which are very deep. Local HW is Galway +0040. SPA Puffin, Storm &amp; Leach’s Petrel.  Storm Petrel also present. Huge Leatherback Turtle 2009. Landing Landing on any of the Stags without swimming is not normally possible. The central Stag (<em>Teach Dónal Ó’Cléirigh</em>) is highest at 97m. Land at the south-western tip at F840-478. To its S is <em>An Teach Mór</em>, second highest at 94m, on which the landing is easiest on the northern tip at F839-479, but the climb to the top is harder. Or, land at the more exposed southern tip at F839-476, which has the easier looking climb.  Bonxie May 2009 “loitering with intent” E of centre is <em>An Teach Beag</em> at about 85m, which boasts the tunnel, running E/W. Land at the south-eastern tip at F840-478, or at an equally sheltered spot just outside and NE of the tunnel at F840-479. A little rock to the E of <em>An Teach Beag</em> is <em>An Bád Bréige,</em> which is often mistaken for a boat when seen from a distance. The Stags NW of centre, <em>Carraig na Faola</em> and just further out, <em>an t-Oighean</em> (78m) were first landed on in 2013.</p>\n","costalZone":"**The Mid-West**"}