{"name":"**Straw Island – _Oileán na Tuí_**","nameHtml":"<p><strong>Straw Island – <em>Oileán na Tuí</em></strong></p>\n","safeName":"Straw-Island-–-_Oileán-na-Tuí_","coordinates":{"irishGrid":{"sheet":"L","eastings":"909","northings":"085"},"fullIrishGrid":{"sheet":"","eastings":"90900","northings":"208500"},"tmcGrid":{"sheet":"","eastings":"490874.253","northings":"708533.023"},"geo":{"lat":"53.1161766","long":-9.63014626}},"cursor":86479,"description":"<p><strong>Straw Island – <em>Oileán na Tuí</em></strong> L909-085           Sheet 51 Straw Island, at the mouth of Killeany Bay (<em>Cuan Cill Éinne</em>), is a good resting stop. Good easy landing onto shingle beaches in the N and E. No great merit. Major lighthouse (11 <em>m</em>. high) which flashes twice every 5 seconds. <strong>Connemara South</strong> <em>Conamara Theas</em> <strong>Galway City to Slyne Head</strong> <em>Cathair na Gaillimhe go Ceann Léime</em> <strong>County Galway</strong> <strong><em>Co. na Gaillimhe</em></strong> This section deals with the coastline from Rossaveel to Slyne Head. There are no islands, and no information available as to the coastline W of Galway City to Rossaveel. For convenience, the section is divided into its eastern and western halves. The eastern section is centred around Gorumna Island (Kilkieran Bay/Greatman’s Bay – <em>Cuan Chill Chiaráin/Cuan an Fhir Mhóir</em>), and Bertraghboy Bay – <em>Cuan na Beirtrí Buí</em> is in the W. The E section is further divided into three sections: Greatman’s Bay, the islands around Lettermullan Island between the entrances to Greatman’s Bay and Kilkieran Bay, and Kilkieran Bay itself. Historical Context The very first roads, bridges and piers among the bays and waters of Connemara – <em>Conamara</em> were constructed under the engineer Nimmo after the 1821 famine.  There was no fully functioning road transport system until the late 1800s. Well into the early 1900s, wooden sailing boats, Connemara Hookers, were the workhorses of these waterways. Hookers were a dominant feature of the Conamara landscape. They ferried goods – tea, sugar, flour and tobacco to small shops in outlying communities on the many inshore islands, and even transported turf to the Aran Islands. Before 1900, the region was among the poorest in Ireland. It was a harsh landscape. With hard labour, people were reasonably self-sufficient. They provided food and support for their families from farming, kelp gathering, fishing and trades. But there were groups who were very poor. Old people, widows with young children, or men with families and no land, all were vulnerable. Some years there was a poor harvest in fishing or potato. The Congested Districts Board was set up in the 1880s to develop infrastructural schemes, which helped to alleviate such poverty. A huge number of men were employed in building roads, causeways and bridges. The Board achieved more under British administration than would be achieved in the years immediately after Irish independence. The causeways and bridges which joined the islands to the mainland, and between the islands of Lettermullan – <em>Leitir Mealláin</em>, Gorumna – <em>Oileán</em> <em>Gharmna</em> and Annaghvaan – <em>Eanach</em> <em>Mheáin</em>, were built in the years between 1886 and 1891. Many roads in the Carna area were built then also. Men earned one shilling (about 6 cent) a day. 900 were working on these schemes from <em>Ceantar na n-Oileáin</em>, (<em>Leitir Móir</em> and <em>Leitir Mealláin</em>) which shows a huge reliance on these relief works to help families survive famine and high rents. About 1900, lace-making industries were set up to create income opportunities for women. It became a way for women to earn the price of a fare to America to escape from a life of poverty and hardship. The population were tenants on the land. It was a struggle to keep their holdings and to survive. Landlords and their agents charged exorbitant rents. Those who could not pay their rent were evicted. It drove many people to emigrate. There were many schemes in America and Australia around 1900 looking for ‘white healthy people’ to occupy and inhabit the ‘new countries’. It was the beginning of emigration on such a scale that it scourged the west of Ireland until about the 1970s. The emigrants’ destination changed in the 1950s to England where work was plentiful, due to the efforts to rebuild after World War 2.  In 2013 emigration is again the scourge of all Ireland. In the 1900s, all the islands in South Conamara were ravaged by poverty, emigration, and the hardships of making a living. This contrasted with how these same islands had previously provided people with food when many other parts of the country were starving. From the 1950s onwards, the final death knell for life on these islands came as people chose an easier lifestyle on the mainland. They preferred easier access to housing, electricity, health services, education for their children, and opportunities to work and earn money. Who were the people who came to live on these offshore rocky islands?  We are privileged to know mainly because of the Griffith’s Valuation Survey.  This was, ironically, a property tax survey that was carried out between the years 1847 and 1864.  It involved a detailed valuation of every taxable piece of agricultural land or built property, to get an accurate estimate of the annual income it should produce.  It listed names of occupiers, landlords, area and type of tenement.  The names of the occupiers then and landowners today on <em>Inis Oirc</em> have not changed significantly, though there is the addition of one family. The survey was used as a basis for local taxation for 100 years up to the late 1970s, when residential property tax was abolished, but now in 2013 it is back. <em>Inis Oirc</em> is one of six islands that form an archipelago of small islands on the outer western landmass of <em>Ceantar na n-Oilean, Conamara</em>. It is tucked away, a welcome haven, safe from the tides and turmoil of Golam Head. Five families lived on <em>Inis Oirc</em>. It is now abandoned. There were two families of Folans, two of Flahertys and one of McDonaghs. There were 40 children born to these families.  They endured tragedy and loss with the deaths of some 11 children in infancy. Children went to school on the mainland at <em>Leitir Meallain</em>. They lived by farming and fishing. Everything the families needed for the houses was brought ashore in currachs and was made use of.  As they grew older the children moved away and many settled on the mainland, while others emigrated to England and the USA. The last person left the island about 1984. Though the island is abandoned, the descendents of the people who left it still farm cattle there. In 2013, the Down Survey of 1656-1658 was digitised by TCD and published on the <em>www</em>, another valuable insight into the past and the ultimate land grab of Irish history, between 1641 and 1670.  This survey, the first of its kind in the world, was carried out after the Cromwellian Wars. It sought to measure all the land that the native Irish Clans would forfeit, to be redistributed to the mercenaries who fought for Cromwell. It was a survey which recorded townland boundaries and measured areas with great precision at a scale of 1:40 perches, almost equivalent to 1:50,000 today. It even put a value on remote islands that were difficult to land on, never mind remote mainland. In 2004, Oileáin was reporting that the government was making substantial improvements to the infrastructure of islands, extending and deepening harbours, and especially installing mains water / electricity on small inhabited islands.  Increasingly, many islands gained holiday homes.  For a time the tide seemed to be turning, but maybe it is ebbing again. The current hard economic times will surely discourage continuing investment, and the return of the taxation of residential property is hardly incentivising. These days, islands are a very attractive destination for paddlers and other tourists. Kayakers, whose goal whenever the opportunity arises, is to visit offshore islands and in particular lesser visited islands, are in a unique position to explore the winds of change. Their questioning and awareness starts the moment they get out of their boats. Usually, their interest centres on how people have lived, – buildings, fields, field boundaries, paths, piers/landings, all the trails of their existence. Many of these inshore islands were inhabited until the not too distant past. When we shelter alongside the old walls of the people who have travelled these same boreens before us, we should reflect on their lives and the drastic causes behind these settlement changes. <strong>Greatman’s Bay <em>Cuan an Fhir Mhóir</em></strong> Greatman’s Bay is the smallest of the three island strewn bays on the S-facing Galway coast. Greatman’s is bounded by the Carraroe – <em>An Ceathrú Rua</em> peninsula to the E and Gorumna Island and Lettermore Island to the W. Bealadangan – <em>Béal an Daingin</em> at the N connects Greatman’s Bay to Kilkieran Bay, for even quite large but unmasted vessels. Only the island free Cashla Bay – <em>Cuan Casla</em> just to the E is smaller among the great bays hereabouts. At this E end of the S <em>Conamara</em> coast, information is comparatively scant for the kayaker. This is so even though Carraroe is a famous tourist resort, and that Gorumna is Ireland’s fifth biggest offshore island. Let the knowledgeable reader accept the challenge, and furnish information to put matters right. Tides Local HW in the furthest regions of the bay such as Bealadangan is about 1:00 after Galway HW, all much as one expects.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"327\"><strong>Greatman’s Bay</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"66\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">5:00 before Galway HW</td>\n\n<td width=\"66\">Various</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">1:00 after Galway HW</td>\n\n<td width=\"66\">Various</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The tide floods north and east through the narrows, ebbing south and west. Greatman’s Bay is much more open at its northern parts than is Kilkieran Bay, so the tide runs very strongly indeed through the remoter gaps. A flow of 4 – 5kn is reported at Bealadangan, but following this logic, much less may be expected at Kiggaul Bay – <em>Cuan Choigéil</em> where Gorumna meets Lettermullan to the west. As with other bays hereabouts, beware when navigating in the narrow places on a falling tide. One mistake and the kayak can be grounded, necessitating a long wait, or a muddy session dragging the boat over seaweed covered rocks in search of open water. <strong>Camus Bay <em>– Cuan Chamuis</em></strong> Camus Bay <strong>–</strong> <em>Cuan Chamuis</em> is the innermost bay among the myriad of islands at the head of Greatman’s Bay and Kilkieran Bay. The two bays are joined in places between the islands. Camus Bay is distinctive in that one can meet the tide ebbing from Camus Bay into Kilkieran Bay even as it floods into Camus Bay from Greatman’s Bay. This is due to the narrows that occur at L947-340 E of <em>Cladhnach</em> – Clynagh Island (off <em>Rosmuc</em>) further up the bay. Embarkation Two embarkation points face each other across the narrowest point of the bay</p>\n<ul>\n<li>at <em>Rosmuc</em> L933-358 on the W side, newly reconstructed in concrete, and</li>\n<li>at <em>Camus Uachtar</em> L935-358 on the E side, unreconstructed.</li>\n</ul>\n<p>Parking is non-existant on the E side and tolerable on the W side. Tides</p>\n<ul>\n<li>Tides ebb and flow strongly through the bay.</li>\n<li>Overfalls occur NE of Clynagh at L947-340</li>\n<li>Tides flow strongly through the narrows between the two embarkation points around Dunmanus Island.</li>\n<li>Tides ebb W/E between</li>\n</ul>\n","costalZone":"**The Mid-West**"}