{"name":"**Tawin Island**","nameHtml":"<p><strong>Tawin Island</strong></p>\n","safeName":"Tawin-Island","coordinates":{"irishGrid":{"sheet":"M","eastings":"300","northings":"193"},"fullIrishGrid":{"sheet":"","eastings":"130000","northings":"219300"},"tmcGrid":{"sheet":"","eastings":"529965.864","northings":"719330.443"},"geo":{"lat":"53.21976205","long":-9.04868588}},"cursor":83133,"description":"<p><strong>Tawin Island</strong> M300-193          Sheet 51 Kilcolgan Point at M300-193 at the W tip of the island is a useful waystop for a tour in inner Galway Bay. Land onto boulders and slabs, on whichever side is sheltered. The island is accessible by road, and is flat but interesting. Tawin is used here to describe a large area, being a long narrow peninsula with the island at its extremity.  Accessed from Clarinbridge or easier from Oranmore, both on the Galway Limerick road, the area includes the main island Tawin West and for two other islands (Inishcorra and Tawin East), besides a part of the mainland called Mweenish Island, which is actually attached at all stages of the tide.  The area is in the Galway commuter belt, and there is a lot of one off housing. The whole thing is lovely and includes two Nimmo piers. Best known feature of the region is the Oranmore Sailing Club at the small Rinville pier (one of Nimmo’s) at M355-219 on sheet 46, well signposted.  Inside Rinville Point, the peninsula encloses a marine insititute, an hotel, and a golf course.  There is a lovely walk along the shore to the point, and for the energetic, a walk along the N shore to beyond the golf course, where it is possible to access the woodland in the interior and thereby, back to the starting point.  Well recommended. Mweenish in the extreme S is actually the remotest part of the entire.  Except for two raised areas, one at each end WNW and ESE, it is largely salt marsh, only occasionally below the waterline.  One could camp here and be undisturbed for a week. Short grass and clean seas make the prospect attractive.  The OS 1:50,000 shows the area as detached, but the old half inch shows it correctly as definitely mainland.  The views southward to the Burren are stunning.  Land access is strictly from the WNW, which is a long way by boreen from the nearest road.  It may be possible to arrive on foot from the NE at LW springs.  Oyster farming is carried out intensively in the sheltered bay to the NE.  Access from the Nimmo quay at 360-181, called locally Lynch’s Quay. Inishcorra is a working farm area, not to be disturbed unnecessarily.  Access on foot is from Tawin East to the NW at HW.  Signs hereabouts refuse permission for the hunting of hares, and trespassing generally. The strip of land projecting W on the S side that with the Tawins on the N side encloses the Inishcorra Bay area is called Glasheen Island.  It is best known for the wreck of the <em>Pamela</em> that came ashore here without loss of life. Tawin East is really a part of the road to Tawin West that happens to have a bridge at each end.  It is otherwise undistinguishable from mainland.  Tides flow extremely forcefully under the bridge on the E side.  This area is popular for kayak training. The school and houses on Tawin West are close to the Tawin East bridge.  Further west the land is barer, and sheep graze, some cattle too.  There is a swimming beach on the N side at M305-195.  Periwinkles grow in industrial quantities around the W end History Eamon deValera met his wife Sinead here in 1911 when he was running an Irish summer college in the local national school.  Jack B. Yeats painted here, and photography opportunities abound.  It is a noted birding spot. Circumnavigation The island is at the head of a useful round trip with a simple shuttle between put in and out points. Start or finish on the N side at Oranmore Sailing Club at the small Rinville pier (one of Nimmo’s) at M355-219 on sheet 46, well signposted from Oranmore village.  On the S side, on Sheet 52, try the pier called locally Lynch’s Quay, 6<em>km</em> WSW of Clarinbridge at M360-181 where there is good parking, or at HW, and for the easier shuttle, try a quay at M407-197 just W outside of Clarinbridge. This provides a trip of 18<em>km</em> or so. Sheets 45,46 and 51 are needed.  There are nice west-going races on the lower ebb off Mweenish Point at M354-175, Sheet 52 (the E point of Mweenish Island) in the S. There are also races off St. Brendan’s Island at M326-213, sheet 46 in the N. Under normal winds, the trip is probably best done S to N. There are plenty of convenient escape points. There are splendid views of the nearby Galway City from the island. Visit Island Eddy village en route.</p>\n","costalZone":"**The Mid-West**"}