{"name":"**The Cliffs of Moher**","nameHtml":"<p><strong>The Cliffs of Moher</strong></p>\n","safeName":"The-Cliffs-of-Moher","coordinates":{"irishGrid":{"sheet":"R","eastings":"068","northings":"884"},"fullIrishGrid":{"sheet":"","eastings":"106800","northings":"188400"},"tmcGrid":{"sheet":"","eastings":"506770.791","northings":"688437.221"},"geo":{"lat":"52.93863481","long":-9.38695791}},"cursor":79481,"description":"<p><strong>The Cliffs of Moher</strong> R068-884 to R058-971    Sheet 51/Sheet 57 To the N of Liscannor are the famous Cliffs of Moher, running NNE for 16<em>km</em> or more from Hag’s Head at R011-897. Hag’s Head lies 3<em>km</em> W of Furreera (R042-880 Sheet 57) in Liscannor Bay, or about 6<em>km</em> W of Liscannor Harbour (one of Nimmo’s). Small parties will start or finish this classic excursion at Furreera. Larger parties may prefer Liscannor, as it has the better parking, easy access at the harbour, and in the village itself, facilities including restaurants, pubs, hotel and hostel. The Cliffs of Moher are the highest vertical cliffs in Ireland. Except for one stack off O’Brien’s Tower, and a few storm beaches, landings are few. Even then, these are only accessible in very settled conditions. These cliffs provide the most dramatic and committing day paddle in Ireland. If doing the Cliffs of Moher, choose light winds, or south-easterlies, which will wash over the top. Supreme Surfing Wave <em>Aill na Searrach</em> (a.k.a. <em>Aileens</em>) is Ireland’s biggest and best surfing wave, at over 10m, thought to be among the top five waves in the world.  The wave is close inshore, just N of Branaunmore. It was known for years but never surfed until recently.  Efforts began October 2004 but standard techniques were found wanting.  Surfers came from Australia, USA and the UK to try their luck.  Eventually on 15<sup>th</sup> October 2005, surfers were brought out to the site from Doolin.  Getting onto the wave involves being towed a by jet-ski, which then makes a hasty retreat, tactics not then necessary anywhere else in Ireland.  Conditions only get suitable a few times every year.  The wave spills into the base of the cliffs themselves, so its danger is not just its size.  Keep away, unless you are one of a very small handful of experts. Doolin claims, with some validity, to be the secret capital of Irish music. It is Mecca to every hitch  hiker and cycling tourist under the age of sixty to visit Ireland. Doolin boasts excellent music, hostels, camping (in a paying site conveniently at the harbour), seafood restaurants, chippers, as well as everything touristy. Doolin Pier at R057-970, Sheet 51 is the obvious embarkation place for the Aran Islands. Inisheer lies 8<em>km</em> to the WNW, or 10<em>km</em> to the main beach. The slipway at Doolin pier is steep, less than well sheltered, and busy. Parking in summer is easier just 100m N, in front of the campsite. The launching is no more difficult off the rocky beach, despite a small, awkward carry. There is no other embarkation for many a cliff-bound mainland mile on either side. Day excursions either side of Doolin are committing and amongst the best in the country. Going S the first get out is approx 15<em>km</em> at Liscannor and even this is weather dependant. Going N the next get out is approx 16<em>km</em> at Fanore and this is very weather dependant also. After this the certain get out is at Gleninagh Pier another 8<em>km</em> further on, inside Galway Bay. Doolin has a coast and cliff rescue service. Contact Mattie Shanahan at 065 – 7074415, the leader of the local Coastguard (Doolin) Unit. Local information may be had from any of the local ferrymen, there being a number of busy, small ferry routes to the islands. SPA Peregrine, Chough.</p>\n","costalZone":"**The Mid-West**"}