{"name":"**The Islands of Clew Bay**","nameHtml":"<p><strong>The Islands of Clew Bay</strong></p>\n","safeName":"The-Islands-of-Clew-Bay","coordinates":{"irishGrid":{"sheet":"L","eastings":"935","northings":"863"},"fullIrishGrid":{"sheet":"","eastings":"93500","northings":"286300"},"tmcGrid":{"sheet":"","eastings":"493473.892","northings":"786316.302"},"geo":{"lat":"53.81544614","long":-9.61768449}},"cursor":110834,"description":"<p><strong>The Islands of Clew Bay</strong> L935-863           Sheet 31 The islands of Clew Bay are very accessible, and provide an highly attractive option for visiting paddlers, whether or not suffering bad weather. Essentially, these islands are the most W tip of Ireland’s ‘drumlin belt’, the other end being at Strangford Lough, S of Belfast.  Drumlins are the remnants of lateral moraines left behind by the last ice age, boulder clay and gravel covered with soil and grass.  The belt wanders through Down, Armagh, and Cavan, and then meanders ever westwards, disappearing into the sea at Clew Bay. The islands, just as in Strangford, tend to be grazed, grassy hummocks. These islands are pretty and in the prettiest of locations. They are sandwiched between the mighty cone shaped Croagh Patrick to the S and the Nephins to the N. Croagh Patrick is a holy mountain with a chapel on the summit.  Known all over as ‘the Reek’, a reek is a haycock, or also a stack of turf. The Nephins are probably the remotest and wildest mainland hills in Ireland. It is widely believed in Ireland that there are 365 islands in inner Clew Bay, ‘one for every day of the year’.  Pilgrims climbing Croagh Patrick get their chance to count them, but must be distracted, as in reality there are slightly less than 100. About 55 are dealt with in this text as of 2012. The barefoot walk to the summit, on the last Sunday of July, is an annual test for the hardier of local Christians.  In kayaking terms there are half a dozen islands that stand out, a dozen highly attractive, another dozen nice, and the rest, well they are grand altogether.  Quality, in terms of the visiting recreationalist with a day or days to spend, peaks along the W outer rim, and even at that is better in the S half.  Inishoo midway is generally regarded as the jewel in the crown, while Innishcannon just to its N is the pretty unattractive. In June 2012, only some of the islands were inhabited, and no water was found on any uninhabited ones. There is probably a connection. Collan More, and Island More / Knocky Cahillaun are the largest. All inhabited islands had been given piers and/or pontoons about 10 years ago, and most had mains water and electricity even before that.  Inishlyre had the largest population at 6.  Collan More, with a permanent population of 2, has the famous Glenans Sailing Centre, capable of over 50 students at a time. Inishgowla South had 2.  Inishgort with 1 has a lighthouse. John Lennon bought Dorinish in 1969 and a commune thrived there for a while. It is said locally that he preferred the hotels of Westport and Mularanny, accessing the commune by day by helicopter.  The commune survived in tents. Many of the islands are interconnected by reefs at lower tides, and many others are almost so, making seagoing journeys amongst them less trouble on the top half of the tide. Reefs / gravel bars sometimes differ from OS (understandably). For instance Inishgort to Islandmore dries at mid tide, while Islandmore, Rabbit Island, Derrinish and Inishbee are more or less permenently connected.  The big worry is being caught on a falling tide, unable to float out of trouble.  Realistically, the <em>portage</em> is a necessary part of the sea kayaker’s skills hereabouts, so factor it into the trip planning. A different island may be chosen each night. Beware that navigation needs careful map reading and getting lost is more than possible, necessitating landing and a stroll to the nearest summit to reorientate. There are a few derelict crofts.  The local mudwall division of fields will interest the many for its labour intensive character.  Marvel at the lazybeds, the term used to describe famine time potato growing activity.  There was nothing lazy about those who grew potatoes this way or subsisted on potatoes any way.  On some islands lazybeds cover every green inch. Regrettably, the islands are divided W/E between sheets 30 / 31, truly a pity. Categorisation The islands of the bay may loosely be divided into three categories for the visitor.  The outer islands, particularly in the middle/S, are remote and wonderful and invite camping overnight.  Inside these the islands tend to be farmed, but the more remote tend to be absentee farmed.  That means sheep but not cattle, so these are also a joy to walk, mostly unfenced, the views are stunning, and camping is normally perfectly possible.  Nearer the shore the islands may be inhabited or farmed as though on the mainland, so greater respect for the privacy of the owner is required, especially where there is one house only on an island. While walking is a pleasure, on occasions strictly with permission, camping would normally be out. Flora &amp; Fauna Black Guillemot, waders, Grey Wagtails, and all the usual bird and plant life abound. A single Corncrake was heard in 2001.  There are no rabbits.  Several islands in the NE were rat infested in 2012.  Seals are few and localised.  Some signs of otter.  Foxes reside. Damson trees are frequent in the NE, so roll on September. Tides There is no committed or exposed paddling.  Beachcombing on low tides is a must, especially where a stormbeach joins two islands in a natural catchment setup.   Slack water corresponds closely to HW and LW Westport, which is about Galway +0030. Beware of the tidal race on the ebb at the Inishgort lighthouse at L900-876. There are 3<em>kn</em>+ races through gaps between Bartra, Inishdaugh and Dorinish, and similar but weaker (approx 1.5<em>kn</em>) N &amp; S of Inishoo. Flows are also significant in Newport Channel and S of Inishbearna. Beware of localised wind –v- tide. Care should be taken in the N side of bay, especially off the Rosturk strand area, for risk of stranding on sandflats as the tide recedes. Access Access is from anywhere near Westport or Newport, but for the middle section of the bay perhaps nowhere more central or convenient than the pier at Rosmoney Quay L935-873.  From Westport, head N on the N59, and when barely out of the town, turn left at a sign for rugby, golf and Glenans Sailing Club. Follow the small road to the the sailing club and park at the pier. There is a stand-pipe for fresh water and easy slipway access.  Roscahill Pier L942-885 on Castlelaffey strand is also convenient and is more sheltered in N winds, but to be avoided at LW springs.  It is adjacent to a castle associated with Graineuaile’s most famous seafaring son <em>Tibod Na Long</em>. There are significant tidal streams on both ebb and flood through entrance channel. The road crossing this channel on the OS doesn’t exist. The Carraholly area may also be considered for the very S/SE area near Westport, called Westport Bay.  The best put-in is Pigeon Point L953-850 – park sensitively as the shellfish factory is operational, and remember that trucks need room to turn. There is a huge harbour seal colony just off here.  This is also the site of the Achill islanders tragedy when 34 migrant workers from Achill waiting to go on board the Elm, a steamship bound for Scotland. Access is poorer towards the N, and certainly there is nothing readily suggestive for the NW outer islands.  Even Mulranny pier L833-957 may be considered in this regard.  Elsewhere along this N side of the bay, the carry to LW may be offputting.  For small parties there is a feasible option at L868-958 Rosturk Strand, just down a short boreen from the main road.  Here the rising tide reaches earlier than elsewhere, but the parking is limited, very much so at spring tides. To the N inner islands, in Newport Bay, access is best from Newport Marina [Gridref] (at the apartments themselves, formerly a seaweed factory) – or – the newly renovated and extended pier at Carrigahowley / Rockfleet L923-952, well sheltered and adjacent to the excellently restored Rockfleet castle.  This is associated with Grainneuaile’s second husband, Richard “Iron Dick” Burke, who acquired his name from his habit of always wearing armour, from which he made his fortune. At HWS it is possible to paddle right up to the castle door. Access sadly has been prohibited in 2010 by the OPW in fear of litigious entrants. Pedalling / Paddling Planning The Westport – Achill Sound railway, closed in 1937, has now been converted to an excellent 42<em>km</em> cycle route, making a great option for a combined paddle / cycle trip.  Opening spring 2011 all the way. Main Channel into inner Westport The main channel from seaward into Westport passes immediately S of Inishgort lighthouse, and swings S, passing SW of Inishlyre, continuing between Inishlaghan and Inishimmel.  Now head ESE (actually 127<sup>o</sup>, SW edge Inishlyre on Inishgort lighthouse), pass between Inishraher and Inishgowla South, then keep Finaun and Green Islands to left, the little Corillan and Carricknamore to right.  Once into inner Westport Bay the channel towards Westport is called Westport Channel, which passes S of Monkellys Rocks, and is a excellently buoyed all the way in to L973-847. Follow the channel along the old quay, until a handy slipway at the gates of Westport House L981-846, where parking is reasonable in the area, and all modern facilities nearby. Best approached at mid-tide or above.  Do explore the fine old boathouse of Westport House, opposite the quay. Do not under any circumstances deviate towards Westport Quay to the ESE L978-843. From Close inshore the S part of Clew bay, a passage is perfectly possible just off Bartraw, inside Inishdaugh.</p>\n","costalZone":"**The Mid-West**"}