{"name":"**– _Oileán Mionnán_**","nameHtml":"<p><strong>– <em>Oileán Mionnán</em></strong></p>\n","safeName":"–-_Oileán-Mionnán_","coordinates":{"irishGrid":{"sheet":"F","eastings":"787","northings":"438"},"fullIrishGrid":{"sheet":"","eastings":"78700","northings":"343800"},"tmcGrid":{"sheet":"","eastings":"478677.426","northings":"843803.895"},"geo":{"lat":"54.32850978","long":-9.86526683}},"cursor":125670,"description":"<p><strong>– <em>Oileán Mionnán</em></strong> F787-438           Sheet 22 Kid Island is a massive lump, 86m high, more than matching the local mainland cliff-top, 250m to its SE. Kid Island guards the north-eastern approaches to Broad Haven – <em>Cuan an Inbhir Mhóir</em>. To pass NE inside the island is to be transported instantly into the surreal world of the N Mayo coastline. High and sheer cliffs dotted with huge caves vie with jagged stacks everywhere. Transcending everything are the Stags of Broad Haven. This is scenery worthy of any James Bond boat chase. Embarkation, Camping and Water Launch from the beach inside Rinroe Point pier – <em>Barr na Rinne</em> at about F802-406. There is no water or camping on the island but there is excellent camping on machair at the launch point, on either side of the road approaching the pier. Excellent water is available from a pipe exiting the cliff at the northern end of the beach, N of the pier. This area is known locally as Carrowteigue – <em>Ceathrú Thaidhg</em>. Landings There are two. Land more easily in a dramatic cove in the NE, below some metal stanchions placed there long ago to aid getting sheep onto and off the island. However, the scramble from here is long and needs care, up rock slabs and then grass. Marvel at the thought of yapping dogs industriously herding sheep on such terrain. Many of both species must have had an unexpected swim or worse. The landing at the western tip is more exposed, but there is an easier scramble to the summit. The grass top is extensive and sheep-grazed. It was the sight of sheep in 2003 that tempted an ISKA party to try to find a landing. A long, interesting ridge runs out N, worth the scramble for the view. A cave appears to run right through this ridge, 20m above the water line. Light can be seen. Rumour has it that scuba divers climb up there and scramble all the way through. Breeding sheep, Puffin, Guillemot, and Great Black-backed Gull.  Two pairs of Bonxies present in May 2009, and Manx Shearwater and Storm Petrel remains found. LBB Gull also breed. Chough, Raven, Skylark, Meadow &amp; Rock Pipit and Rock Dove present in May 2009.</p>\n","costalZone":"**The Mid-West**"}