{"name":"**Bray Head**","nameHtml":"<p><strong>Bray Head</strong></p>\n","safeName":"Bray-Head","coordinates":{"irishGrid":{"sheet":"O","eastings":"286","northings":"170"},"fullIrishGrid":{"sheet":"","eastings":"328600","northings":"217000"},"tmcGrid":{"sheet":"","eastings":"728522.731","northings":"717029.91"},"geo":{"lat":"53.18817834","long":-6.07685336}},"cursor":20860,"description":"<p><strong>Bray Head</strong> O286-170          Sheet 56 Bray Head is a mountain with twin peaks. The more northerly, 206<em>m</em> high peak has a prominent cross on top. The higher, 240<em>m</em> peak is to the S. At shore level, there are two roughly equivalent headlands, Bray Head at O286-170 and Cable Rock at O290-156. Cable Rock is a pronounced headland with an off-lying rock. There are large seabird colonies on the head in the breeding season. Swell develops if there are sustained or strong winds from N, E or S, and gives difficult conditions all along the headland from the promenade in Bray to Cable Rock. The sea frequently breaks over Cable Rock, 80<em>m</em> off the headland. The tide flows strongly through the gap. Beware of a deeper rock, about 50m off the shore, which breaks the lower half of the tide in bad conditions. The sea state off Bray Head is almost always more severe than on the adjoining coast. Rogue waves are not unusual. This is not a place to go swimming, as the escape routes are tricky, the few storm beaches having dumping surf. This whole 3<em>km</em> section is a fine paddle, very scenic, the slopes of Bray Head rising above, and the cliffs at the water’s edge a modest rock-climbing haven. Look for the climbing cliffs just N of the Cable Rock headland. They are identified by the metal spikes in the steep ground in the first 20m above HW where the railway tunnel opens. There are three landable storm beaches on the head, but they are exposed and steep, or even missing, at HW. Above them runs the railway line, which was engineered out of the cliff with great difficulty in the mid 19<sup>th</sup> Century. The most convenient embarkation point in Bray is at the extreme S end of the promenade at O276-179, closest to the head. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Dalkey Island to Wicklow Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">N</td>\n\n<td width=\"173\">5:15 after Dublin HW</td>\n\n<td width=\"57\">3.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">S</td>\n\n<td width=\"173\">0:45 before Dublin HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>North of Greystones, it is mostly possible to keep inshore, out of the way of an unfavourable tide. South of Greystones, one is unsheltered from ebb or flood and this stretch is a sustained hard battle if against the tide.</p>\n","costalZone":"**The East Coast**"}