{"name":"**Bull Island**","nameHtml":"<p><strong>Bull Island</strong></p>\n","safeName":"Bull-Island","coordinates":{"irishGrid":{"sheet":"O","eastings":"227","northings":"374"},"fullIrishGrid":{"sheet":"","eastings":"322700","northings":"237400"},"tmcGrid":{"sheet":"","eastings":"722624.203","northings":"737425.518"},"geo":{"lat":"53.37277135","long":-6.1571985}},"cursor":18508,"description":"<p><strong>Bull Island</strong> O227-374          Sheet 50 N of Dublin Port is the North Bull Island, in the NW corner of the bay. It is connected to the shore by an ancient wooden bridge at O213-359 at its SW end, and a road/causeway at O225-374, midway along the island, built 1962. Much silting of the inner stretch of water has occurred since then, especially close to the causeway, which is now recognised to have been an environmental nightmare, and studies are underway to find a solution. The North Bull Wall which bounds the island on the S also delimits the N side of Dublin Port, and was built in 1825 on the advice of the famous cartographer and harbour builder, Captain Bligh, of <em>Bounty</em> fame. SPA Golden Plover, Bar-tailed Godwit, Great Northern Diver, Little Egret, Peregrine, Merlin, Short-eared Owl. The significance of the Bull for bird watchers is in the huge numbers and the variety of species. It is popular because the birds may be easily watched. Living close to buses, cars, golfers, joggers and even dogs, the birds do not startle easily. In the channels, the rising tide concentrates the birds as it pushes them up the shore, and they can be watched from very close range. The Bull features prominently in the early stages of the education of all Dublin birders. It holds its interest for even the very advanced, because it is always throwing up surprises – rare migrants, and the odd mega-vagrant. The Bull has internationally important numbers of Brent Goose,<em>kn</em>, and many other winter species. Most of the centre of the island is taken up with two golf courses, which are fenced off from the outer rim. Birders are found mostly on the mainland side, and swimmers favour the open beach on the outer side. Hares abound on the golf courses and are tolerated with equanimity by the golfers. There is an Interpretive Centre near the causeway. It probably owes its existence to its timing, as it was built shortly before planning permission became necessary.  </p>\n","costalZone":"**The East Coast**"}