{"name":"**Dalkey Island**","nameHtml":"<p><strong>Dalkey Island</strong></p>\n","safeName":"Dalkey-Island","coordinates":{"irishGrid":{"sheet":"O","eastings":"277","northings":"263"},"fullIrishGrid":{"sheet":"","eastings":"327700","northings":"226300"},"tmcGrid":{"sheet":"","eastings":"727623.019","northings":"726327.892"},"geo":{"lat":"53.27191021","long":-6.08658693}},"cursor":19888,"description":"<p><strong>Dalkey Island</strong> O277-263          Sheet 50 An interesting small grassy island, it has a Martello Tower, a fort, black rabbits, goats and other furry creatures. No reliable water has been found but a well W of the church, just above the shore, is kept whitewashed. The views of Dublin Bay from both the Martello Tower and the ruined fort are well worth the trouble. Until a generation ago, the King of Dalkey Island was elected locally and crowned on the island, but the practice died out in the 1980s. History Roman coinage was found here dated to 352AD, so the Romans may have traded from a base here.  Vikings named it <em>Dalk Eyja</em> (“Thorn Island”) and the Irish name means the same “<em>Deilg Inis</em>“. Archaeological excavations have revealed Mesolithic Bann flakes, Neolithic hollow scrapers and Bronze Age arrowheads on the island. In the early medieval period, the island was a base for sea-going traders, importing goods from the Mediterranean and western France. The medieval church is dedicated to St.Begnet. The lintelled doorway is a feature of the period prior to the 12<sup>th</sup> Century. The bellcote high on the gable above is likely to have been added later, possibly in the 15th Century. The high side walls might also have been raised about then. The fireplace at the E end was added when the church was used as a residence by soldiers and masons in the early 19<sup>th</sup> Century. The Martello Tower and the gun battery were built in response to the threat of invasion from French forces around 1804 and 1805. The tower is exceptionally large. The original entrance is high up and was reached by a ladder. The present entrance (recently closed, unfortunately) is an insertion and leads directly into the magazine. The gun platform on the roof mounted two 24-pounder guns. The gun battery is built into the granite cliffs on the southern tip of the island. While it is unimposing from the mainland, ships sailing into Dublin Bay would have had three large guns trained on them. Embarkation Embark from Bullock Harbour at O263-277, 3<em>km</em> NW, rather than the nearer Coliemore Harbour. Launching and parking is easier. Landing Landing is best at a little beach on the landward side of the NW corner, W of the church. There is also a little cove just inside the nearby pier. The beach here is usable except on the bottom third of the tide. A regular ferry runs from Coliemore Harbour opposite to the pier. Tides The tide runs strongly on both sides of Dalkey Island.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Dalkey Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">NNW</td>\n\n<td width=\"173\">4:00 after Dublin HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">SSE</td>\n\n<td width=\"173\">2:00 before Dublin HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The tide changes half an hour later in neaps, the flood starting at 4:30 after Dublin HW and the ebb at 1:30 before Dublin HW. One stream of the flood tide swings around Killiney Bay and divides, one part moving NNW through Dalkey Sound, the other sweeping east out to sea past the southern tip of Dalkey Island and on past Muglins. Expect overfalls on the flood at the southern tip of the island. These are particularly big with a south or southeasterly swell. If in doubt about the conditions, have a look from a safe distance at Sorrento Point. Otherwise, following the coast of the island will ensure you are in the full flow before you see the overfalls. A decision to turn back at this stage will mean paddling against a 2-3kn flow.</p>\n","costalZone":"**The East Coast**"}