{"name":"**Greystones to Wicklow**","nameHtml":"<p><strong>Greystones to Wicklow</strong></p>\n","safeName":"Greystones-to-Wicklow","coordinates":{"irishGrid":{"sheet":"O","eastings":"296","northings":"128"},"fullIrishGrid":{"sheet":"","eastings":"329600","northings":"212800"},"tmcGrid":{"sheet":"","eastings":"729522.473","northings":"712830.818"},"geo":{"lat":"53.15021953","long":-6.06360235}},"cursor":21359,"description":"<p><strong>Greystones to Wicklow</strong> O296-128 – T317-942      Sheet 56 For 20<em>km</em> S of Greystones, all the way to Wicklow town, the immediate coastline is uniformly flat and boring when seen from the sea. The backdrop however is the Wicklow Hills, known as the Garden of Ireland, always lovely. Landing can be achieved at any point but the shingle beach is mostly steep with dumping surf. On land, the going is anything but boring. The railway runs the entire length of the stretch, right on top of the beach, with pleasant perambulating pathways beside it. Four roads come down to the sea from the coastal highway, so the section may be broken into smaller bits for more leisurely-minded strollers. The more determined can walk from Bray or Greystones to Wicklow and get the train back. SPA Bewick and Whooper Swan, Little Tern, Golden Plover, Bar-tailed Godwit. 1<em>km</em> of rocky coastline S from the harbour, the town ends and the long beach begins at O299-121. The hinterland along the entire stretch attracts rare bird species, especially waders, and particularly in winter. 6<em>km</em> S along the sandy beach, the Kilcoole wetland system flows under a bridge at O315-061, called locally “The Breaches”, and into the sea. This wetland system is unique in being so low-lying that it has been scantily mapped by the OS. More to the naturalist’s taste, there are two eco-systems in one, fresh water and salt water, side by side. The two are wonderfully different, barely separated, and the subject of much study as to their comparable flora and fauna. Barry O’Flynn of nearby Kilcoole carried out the first study in 1973.  The more northerly is fresh water and includes a Birdwatch Ireland reserve, 1.5<em>km</em> N of the Breaches. In summer, there is a colony of Little Tern maybe 200<em>m</em> N of the Breaches, the largest in Ireland, also a Birdwatch Ireland reserve, between the bridge and a major stand of Sea Buckthorn.  The terns nest in the gravel of the beach, and are so splendidly camouflaged that it is truly inconsiderate to walk on the beach hereabouts at all in season. The colony area is well marked from landward. Please therefore be careful if landing. Birdwatch Ireland are rumoured to have had a major crisis of conscience some years back about this colony.  It was preyed upon by a Kestrel, who could scope the area wonderfully from a perch on the electricity wires where they crossed the bridge.  The kestrel was so successful that it became necessary to employ wardens on a permanent 24/7 rota. Even the permanent wardening wasn’t enough and there were rumblings of a strategic alliance with a local gun club. The kestrel became famous under the stage name “Kevin the Killer Kestrel from Kilcoole”. It is said the Irish Minister for the Environment somehow persuaded his governmental colleague the Minister for Energy to put all electricity wires in the area underground, even at the bridge, and apparently it worked.  Kevin lost his easy number, got bored, and went away, as bored kestrels do. About 3<em>km</em> further S is Six Mile Point at O318-038, the most easterly point on the route.  The <em>km</em> S of Six mile Point is the most intensive of all Irish bird reserves, managed by Birdwatch from their nearby HQ. Camping. Pleasantly camp just about anywhere S of Greystones. Indeed this is probably the first grassy camping S of Dublin. Tides From Dalkey Island to Wicklow Head, the N going flood runs from Dublin HW +0515 to -0045, achieving 3.5<em>kn</em> in places, in springs. The S going ebb achieves 3<em>kn</em>. This stretch is unsheltered from ebb or flood, and is a sustained hard battle if against the tide.</p>\n","costalZone":"**The East Coast**"}