{"name":"**Horseshoe Island**","nameHtml":"<p><strong>Horseshoe Island</strong></p>\n","safeName":"Horseshoe-Island","coordinates":{"irishGrid":{"sheet":"T","eastings":"091","northings":"199"},"fullIrishGrid":{"sheet":"","eastings":"309100","northings":"119900"},"tmcGrid":{"sheet":"","eastings":"709026.574","northings":"619951.378"},"geo":{"lat":"52.32035164","long":-6.40071787}},"cursor":23961,"description":"<p><strong>Horseshoe Island</strong> T091-199           Sheet 77 The island is long, narrow and flat, lying N/S, about 1.5<em>km</em> x 0.5<em>km</em> maximum width at its higher N end.  It is located about 1<em>km</em> NW of Rosslare Point T099-188, off the area known locally as the Burrow or Rosslare Back Strand.  Its LW footprint is huge, and has only in recent years become completely detached from the mainland. Wexford Harbour is a complex area of shifting and drying sandbanks, and considerable areas dry out at LW.  Mussel farming is very big in the area. The island has been formed since the early 1980s when neighbouring Tern Island was washed away in winter storms.  The neighbour, Tern Island, was known to hold some 2000+ breeding Irish Roseate Terns. The species’ last refuge was Rockabill, Co. Dublin, where a dedicated wardening and conservation scheme began in 1989, which has been successful in restoring the breeding numbers. Horseshoe Island is larger than one would expect when viewed from the mainland and is a pleasant combination of sandy beaches mixed with dune complex and intertidal salt marsh areas. The island’s central ridge is covered in Phragmites reeds and the sheltered N end has huge quantities of Glasswort.  Camping is attractive but no water found. The island is a very important roosting and feeding area for terns and waders on migration, while Ringed Plover and Little Tern breed in significant numbers. Access Launch from the end of the rough track leading to the Point on the W side.  Landing is best on the E beach facing the Point.  This island may just be accessible on foot at LWS. The island is larger than one would expect when viewed from the mainland and is a pleasant combination of sandy beaches mixed with dune complex and intertidal salt marsh areas. The island’s central ridge is covered in Phragmites reeds and the sheltered N end has huge quantities of Glasswort.  Camping is attractive but no water found. The island is a very important roosting and feeding area for terns and waders on migration, while Ringed Plover and Little Tern breed in significant numbers.</p>\n","costalZone":"**The East Coast**"}