{"name":"**Ireland’s Eye**","nameHtml":"<p><strong>Ireland’s Eye</strong></p>\n","safeName":"Ireland’s-Eye","coordinates":{"irishGrid":{"sheet":"O","eastings":"284","northings":"414"},"fullIrishGrid":{"sheet":"","eastings":"328400","northings":"241400"},"tmcGrid":{"sheet":"","eastings":"728323.031","northings":"741424.614"},"geo":{"lat":"53.40733789","long":-6.0699837}},"cursor":16620,"description":"<p><strong>Ireland’s Eye</strong> O284-414          Sheet 50 Ireland’s Eye is an interesting, small, uninhabited island off Howth Harbour. Circumnavigation is recommended as the cliff scenery is excellent. The island is most attractive and most popular in early summer. There is a regular ferry in season, from Howth East Pier. The island is noted for its rock climbing on the tor at the NE corner, on the sea stack just off it, and also on the big cliff centred on the N side. Do please though exercise caution as regards bird life, and climb later in the season. The church dates back to 700 AD, and is called Cill MacNessan. A manuscript similar to the more famous Book of Kells was penned here by three monks, and it is also preserved in Trinity College Dublin. SPA Peregrine. The island is a breeding ground for various auks, Fulmar, Kittiwake, Shag, Cormorant, gulls, and others. In particular, a Gannet colony started to breed here in 1989, and is now the only significant such colony between the Saltees to the S and Ailsa Craig in Scotland. Embarkation and Landing There is convenient access at a public slipway beside the Lifeboat Station at O285-394 in Howth Harbour. Landings can be had at various points, the best of which is at the sandy beach just SE of the Martello Tower. No water. The lusher parts of the island are rat infested, making camping unattractive. <strong>The Round of Howth Head</strong> The round of Howth Head is a popular trip for Dublin sea paddlers. Ireland’s Eye is also attractive to take in as part of the excursion. Attractive for its scenery, and its handy shuttle, the only downside to this trip used always be a sewerage outlet operating just off the Nose of Howth at O301389 on the NE corner of the Head. However, the situation is much improved in 2010 as most of the sewage now goes to the modern treatment works in Sutton and Ringsend. The put-in point to the N is at the public slipway at the RNLI station in Howth Harbour. There is plentiful parking. To the S of the Head, the launching point is the sandy beach at Sutton Sailing Club at O265-377, just NW of the Martello Tower. The Club is welcoming to small competent and considerate parties. Parking is limited so it is not suitable for large groups. Also, at LW, the tide goes a long way out. A shingle beach at O296-373, 1<em>km</em> N of the Bailey Lighthouse O297-363 offers a welcome break, and there is even a track upwards to the commonage above. Stopping is also possible in several places on the S-facing side of the head. The round of Howth is usually done anti-clockwise, on a rising tide, best in calm or gentle southerlies. An ‘out and back’ trip from Howth Harbour is also quite feasible and avoids the shuttle. SPA Fulmar, Cormorant, Shag, Herring Gull, Kittiwake, Guillemot, Razorbill, Black Guillemot. Tides The main east coast streams run north and south off the Bailey and the Nose and on both sides of Ireland’s Eye, where 2kn can be achieved. There can be very bumpy water anywhere on the seaward side, especially with wind over tide. It can be quite nasty in particular at the Bailey where the tidal stream coming out of Dublin Bay meets the main stream. The Nose at the northeastern side of the head is often very bumpy, easing as one approaches Howth Harbour.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Howth Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NW</td>\n\n<td width=\"170\">4:45 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SE</td>\n\n<td width=\"170\">1:45 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Eastern side of Howth Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">4:30 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">1:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The main east coast flood enters the south side of Dublin Bay heading northeast and circles around the inner bay to exit east along the southern side of Howth Head. The main east coast ebb, except when flowing at its strongest, which means the middle three hours, eddies behind the Bailey around the northern part of the bay. Therefore, an outgoing stream runs east along the southern shore of the Head for 9.5 hours out of the cycle.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Southern side of Howth Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"180\">3:00 after Dublin HW</td>\n\n<td width=\"57\"></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"180\">00:30 after the following Dublin HW</td>\n\n<td width=\"57\">weak</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Paddlers have found that the east-going stream exiting Dublin Bay at the Bailey can be stronger than the north-going main coastal flood from about 6 hours before Dublin HW to 4 hours before. Thus the stream at the Bailey is a nasty east going race and then a huge circular eddy for about 2km to the north. <strong>Dublin Bay</strong> Outside part All up along the S part of the E coast of Ireland lies an offshore bank, on average less than 15<em>km</em> off, called by different names as it progresses N.  Off Arklow it is called – the Arklow Bank, off  Greystones – the Codling Bank, off Bray – the Bray Bank, off Dublin South – the Kish Bank, and then off Dublin North – the Bennet Bank.  Tides flow differently inside and outside this offshore feature. From the Dublin perspective, inside the Kish Bank off Dublin South lies the smaller Burford Bank, a shallow area across almost the whole of the entrance to the bay.  Then, further E and dominating the outside of the bay, a major lighthouse lies at the N end of the outer Kish Bank (known locally and simply as “the Kish”), and prominent lights flash at the N and S ends of the Burford Bank. Outside the Kish the waters are deep, say 25<em>m</em>, at the Kish they are, say 15m, then inside the Kish they are relatively shallow, say 25<em>m</em>.  Waters are then deep to the W (with the exception of the Burford Bank outside the bay itself, which goes down to 5<em>m</em>.), to a line between Howth Head and Dalkey, when the bay gets shallow and stays shallow.</p>\n","costalZone":"**The East Coast**"}