{"name":"**Lambay Island**","nameHtml":"<p><strong>Lambay Island</strong></p>\n","safeName":"Lambay-Island","coordinates":{"irishGrid":{"sheet":"O","eastings":"315","northings":"500"},"fullIrishGrid":{"sheet":"","eastings":"331500","northings":"250000"},"tmcGrid":{"sheet":"","eastings":"731422.47","northings":"750022.732"},"geo":{"lat":"53.48379889","long":-6.01980809}},"cursor":13974,"description":"<p><strong>Lambay Island</strong> O315-500          Sheet 43 Embarkation The closest approach is from Donabate Martello Tower at O263-505 but this would only be suitable if travelling out and back on the flood.  Rush Harbour at O274-543 is almost as near, and in calm conditions is handiest on the ebbing tide. Parking though is tight at the pier but there is a convenient carpark and a cary down steps under an arch at the W end of the beac.  In NE winds or a strong ebb tide, launch in Loughshinny Harbour at O273-568.  Loughshinny is always dependable, sheltered, has good parking, and is the best choice with bigger groups. The best plan for a day trip is a slingshot from Loughshinny (excellent parking), lunching at the island during the LW slack. Landing The island is privately owned by the Revelstoke family and no landing should take place. This is particularly true of the W side of the island where the main harbour and housing is situated. The owners value their privacy, the welfare of the nesting wild bird population, and the health of their most unusual domesticated animal population, marsupials included. If in distress, at least stay below the HW line and out of sight. There are also some useful waystops on the circumnavigation of Lambay. There are two satisfactory beaches on the N side, just E of the NW point, one tucked into the point itself facing E at O310-515, and the other is just further E, below an unsightly rubbish dump, facing N at O312-514. The next option is Carrickdorrish O330-515, an islet 200m WNW of the Nose, being the extreme NE point of the island, barely offlying the main island. There are no beaches or landing sites anywhere on the E side of the island, but there are three excellent, small, sandy or stony beaches on the S side, in sheltered coves. One is in the middle in Bishops Bay at O315-500, one W of the middle O312-503 somewhat out of harm’s way, and one tucked into the SW corner O307-505. Tides Tidal races run strongly on all four corners. Local HW is the same as Dublin HW.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between Lambay &amp; the mainland</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">4:30 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">1:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>There is a north-going eddy up the eastern side of the island on the spring ebb from Sunk Island in the south to the Nose. Flora &amp; fauna The island is a significant wild bird habitat and holds internationally important numbers of breeding Cormorant, Shag, Razorbill and Guillemot. 59,000 breeding pairs of Guillemot were counted in 1995/1999, which makes it the second most important colony in Ireland after Rathlin Island (c.96,000 pairs). It is the most important colony for Herring Gull and Shag in the country. The 675 pairs (1999 census) of Cormorant qualify this as the largest colony in Ireland. The new Gannet colony started only 2008 is thriving summer 2010 at Harp Ear, the most NE point of the island O320-517.  In winter, there are up to 1,000 Greylag, and several other species of geese.  The Sunfish on display in the Natural History Museum was found in a rockpool at LW on Lambay. In the 1980s a herd of Red Necked Wallabies were donated by Dublin zoo, and began breeding in 1995.  They thrive to this day.  The colony is now 40+ strong, and hangs out at or near the summit, fenced off from the cattle. The last surviving substantial elm tree forest in Ireland is on Lambay. SPA Barnacle Goose, Peregrine History <em>Porphyry</em> flint tools of such a high quality as were probably ornamental were manufactured here from about 5,000 BC to 500 BC. The Romans never got to the Irish mainland that we know of for certain, but they did get to Lambay, traded with it, and called it <em>Limnios</em>. In 795, the first ever raid by the Vikings on Ireland happened here. Lambay is a Viking word, the <em>ay</em> meaning <em>island</em>. After the Battle of the Boyne in 1691, a 15th Century castle was used as a concentration camp for the defeated Jacobite troops.  This was converted / extended into a fine mansion around 1900 under the guidance of the renowned Lutyens.  So well is the development designed and carried out, only a trained eye can tell the new from the old.  All gates were constructed from timber carved to resemble salvaged shipwreck detritus. The sea area to the N and NE were for centuries an important anchorage for shipping awaiting entering or leaving Dublin port.  A harbour was constructed in the 1820s designed by <em>Nimmo</em>, larger than an island surely needs, proof of its then importance in the scheme of things. Seabirds eggs have been harvested here on the grand scale in times of crisis, most recently during WW2 or <em>The Emergency</em> as that débacle was known locally at the time, even being exported to England.  Apparently the birds all feed on municipal dumps across on the mainland and the eggs do no taste fishy at all at all. Lambay boasts one of Ireland’s only two <em>Real Tennis</em> or <em>Royal Tennis</em> courts, built in 1922/23 during the Civil War.  The court is the size and shape of a large tennis court but surrounded by low buildings with inward sloping roofs, where the ball may be whacked and retrieved.  The rules do not easily suggest themselves.  The other court survives in the grounds of the National Concert Hall in Dublin City. Praeger In 1905/6 Robert Lloyd Praeger, Ireland’s greatest ever naturalist, led a team of 20 professional naturalists to examine this isolated 2.5<em>km</em><sup>2</sup> island, with the intensity of a forensic police “finger tip” search. It was in part a post Darwinian experiment, in testing an offshore island as a focus point for development in the nature of species caused by lengthy estrangement from the mass. They didn’t find any, but they did find 5 species new to science (3 worms, 1 mite and 1 bristletail), 17 species new to the British Isles, and 90 new to Ireland.  They reported 60+ hectares of heath at the summit, now sadly reduced to two plants widely separated.  One pyramid orchid is conserved inside a wire cage against lawnmowers. Shipwreck The White Star Line lost the largest merchantman ever built in Britain, its biggest, best, and most modern passenger ship, on its maiden voyage, in a major tragedy with huge loss of life, trying to set a new record for the shortest ever sea passage to the new world for the British and Irish emigrants aboard. Sounds familiar ? Sounds like the <em>Titanic</em>? Wrong. Long before the Titanic in 1912, it had all happened before. The ‘<em>Tayleur’</em> left Liverpool in January 1854. It was about the first ever ironclad clipper, huge at 1979 tons, with masts 45m high, and at least 650 passengers, maybe a lot more. There were five different classifications of passengers, yet there was no mention of vegetables or fruit on any of its menus. Scurvy was just about then becoming understood. Clippers were square-riggers, built for forward speed, not for manoeuvring. It had little in the way of sea trials. The ship was undermanned. The crew was inexperienced. No one on board had yet worked out how to use a compass aboard a metal craft. “Magnetic deviation” was less understood at the time than magnetic variation. In thick weather, land was sighted ahead. It was misidentified, at terrible cost. Too late, remedial action failed. The passengers, knowing disaster was at hand, crowded the decks and got in the way of the crew.  Worse, communication among the crew became impossible in the bedlam on deck.  The ship struck the E point of Lambay. In shallow water, the ship died slowly against the rocks. Escape from the ship at this critical point favoured the able bodied, requiring climbing across a mesh of ropes to the shore.  While 200 of the 300 adult men made it, only 3 of the 200 others on board, women and children, survived. Many of the mainly Lascar and Chinese crew saved themselves and disappeared.  Bodies littered the shore for weeks after. More than half of all aboard drowned. A lot of the figures are estimates. 100 are buried on Lambay. It is guessed that 345 survived and did eventually make Australia. Three Chinese among the survivors gave the tribunal of enquiry the best accounts of the disaster, in which the captain was praised for his crisis management in all the circumstances. <strong>Carrickdorrish</strong> Sheet 43           O330-515 Barely offlying the main island, Carrickdorrish is a small low lying rocky islet, 300m NW of the NE corner (“the Nose”) of Lambay Island. The islet is an important roost site for many of Lambay Island’s gulls, waders, cormorants and shags. Grey Seals are regularly found hauled out on the numerous rocks and reefs. The narrow channel that separates Carrickdorrish from Lambay is shallow through which tides run strongly as well as outside S to the Nose of Lambay O332-512. Landing is possible from many points but probably easiest onto a sloping rock ledge in a nook on the SW side. The island is ideally positioned for a way stop / lunch point for anyone circumnavigating Lambay. No water.</p>\n","costalZone":"**The East Coast**"}