{"name":"**Malahide Arches**","nameHtml":"<p><strong>Malahide Arches</strong></p>\n","safeName":"Malahide-Arches","coordinates":{"irishGrid":{"sheet":"O","eastings":"225","northings":"469"},"fullIrishGrid":{"sheet":"","eastings":"322500","northings":"246900"},"tmcGrid":{"sheet":"","eastings":"722424.344","northings":"746923.463"},"geo":{"lat":"53.45812988","long":-6.15651342}},"cursor":15876,"description":"<p><strong>Malahide Arches</strong> O225-469          Sheet 50 The Dublin to Belfast railway line runs across the middle of the Malahide Estuary supported on a 12 arch bridge built on top of a man-made weir.  Malahide at 180<em>m</em> is the longest tidal railway viaduct in Ireland.  Built in 1844 in timber, that didn’t work.  Re-built in 1860 in stone with a wrought iron superstructure, it needed to be strengthened in 1932, for diesel locomotives.  The stone sub-works were always under pressure and despite re-pointing, the lot was replaced with pre-stressed concrete in 1966-1968.  Then in 1998 the timber sleepers in use all over Ireland for 150 years on railway lines were replaced with concrete, to allow continuous welding (impacting on garden design countrywide). The Malahide Sea Scouts knew for generations that good conditions existed for surfing on an incoming tide of HW 4.0<em>m</em> upwards, and sometimes even at lower levels. This information hit the general canoeing community in the early 1990s and the spot became very popular.  It was these local scouts that spotted an impending disaster in August 2009.  They reported severe scouring, but no-one listened, at least not attentively enough. A single pier collapsed, slightly on the S side of the middle, so that two spans then collapsed.  This was minutes after the passing of the inter-city express.  Minutes later, thankfully in daylight, the next train driver saw what needed to be seen, and no lives were lost. It happened at a big 4.5<em>m</em>(local average 4.1<em>m</em>) spring tide, just before LW. The tide floods inwards over most of the weir for a couple of hours coming up to HW, and outwards for the rest.  Because most of the face of the weir is studded with anti-scouring boulders, the weir is often mostly impassable, even to kayaks. However, when the weir was being re-built in 2010, the railway company incorporated a very special feature. The canoeing community credits the Malahide scouts with Ireland’s only purpose built leisure facility exploiting tidal energy, designed by humans for humans to play in.   Under the 5<sup>th</sup> arch from the N, a slide 4<em>m</em> wide, 0.3<em>m</em> deep and 28<em>m</em> long has been constructed on the E sea-facing side, its head at the lip of the weir and its foot at LW.  This is known as “Macker’s Slide”, after Paul McEvoy, the scout master who made it possible.  Scout leader Ivan Barrett was the first to shoot the slide, and the McKernan sisters the first females. Playtime Before 2009 the play conditions had existed on the W landward face of the weir, allowing play for about 3 hours of the 12, on immaculate standing waves and stoppers.  The post 2010 arrangement does not allow that, but instead the incoming tide creates the neatest flows and eddies imaginable, on fast flat water, the finest teaching environment possible, particularly ideal for progressing intermediates. The slide has walls either side 0.3<em>m</em> deep.  This allows preferential flow at the slide, incoming as well as outgoing, permitting such conditions on quite small tides at this particular arch. Post 2010 also allows playtime at the foot of the slide on the E seaward face, for maybe 10 hours of the cycle, pretty much the whole time except when the weir is covered, say from +0030 HW Dublin until -0130, varying a bit between neaps and springs.  The slide works above a tide height of about 3.8<em>m</em>.  The higher it gets the more powerful the hydraulics, but it never “grips” unsafely,nor does it ever “wash out”, there being something in it always for someone. The wave is certainly more powerful on larger tides, is progressively more retentive as the water level outside drops, and at all times the side walls need care exiting the stopper wave.  LW on regular tides is a very suitable time for teaching beginners because an instructor can stand on the flat foundations just beyond the wave and extract a learner caught in the wave.  Throw ropes are very useful for all parties at all times on the wave. Launch The put in point O227-463 is about 1<em>km</em> SE at a slipway just SE of the Marina Village.  Follow the one-way road system around clockwise from the village centre and park where you can.  The slip is on the left just before the road heads right and inland again.  Keep the marina on your left paddling out. The railway is not at first in sight. SPA Bar-tailed Godwit, Golden Plover, Little Egret, Ruff, Kingfisher.</p>\n","costalZone":"**The East Coast**"}