{"name":"**Rosslare Fort Island**","nameHtml":"<p><strong>Rosslare Fort Island</strong></p>\n","safeName":"Rosslare-Fort-Island","coordinates":{"irishGrid":{"sheet":"T","eastings":"121","northings":"218"},"fullIrishGrid":{"sheet":"","eastings":"312100","northings":"121800"},"tmcGrid":{"sheet":"","eastings":"712025.899","northings":"621850.952"},"geo":{"lat":"52.33681521","long":-6.35610825}},"cursor":23096,"description":"<p><strong>Rosslare Fort Island</strong> T121-218           Sheet 77 The island is nowadays merely two (it was one in October 2011, two on 24 January 2015) of the many sandbanks hereabouts except that firstly, it is very extensive and “tall” enough that it even pokes its head above HW sufficiently consistently that it has marram grass on its “summit” at T121-218 on the NE part.  The NE part of the island, having marram grass, may be “growing” again?  Secondly, to say it is redolent of history is an extraordinary understatement.  The “fort” on the SW part T114-213 is on the “other” SW half of the “island”. The island is huge.  It probably covers 100 hectares at LWS.  It runs SW/NE.  The fort is near the SW tip.  The summit is far to the NE.  Across the channel dividing the two parts.  The actual NE tip is somewhere way further north again, out of sight of the summit, appearing to stretch away and away maybe almost towards Curracloe.  The main channel once entered on the north side of the island between the island and Ravens Point, but no more.  The main channel now enters south of the island, the channel now halfway between Ravens Point and Rosslare Point. Tides Tides run strong.  Trawlers can be seen on the ebb, with their engines growling, barely making progress up the main channel south of the island.  The tides pour out of the harbour 9 / 12, supposedly weakly, and inwards 3 / 12, supposedly strongly.  HW at the quayside in Wexford town is Dublin -0430.  The tidal streams inside the harbour turn with HW and LW at the Wexford quayside.  Further out, HW/LW at our island / the harbour mouth, is about 75 miutes earlier. Embarkation Embarkation isn’t easy.  The launching spot can be hard to decide, and depends on conditions.</p>\n<ul>\n<li>Simplest is Ardcavan beach at T066-238, where there is an acceptable carry, and good parking.The problem here is the return, which in evitably involves very low water, given that the visit to the island will be fot its LW which is an hour beore Ardcavan’s LW.  Much of the return journey is in 20cm of water, and hard on the system.</li>\n<li>Do not make the mistake of trying to get closer, up by the bird reserve, 1km east.Anyone getting up on the tidal restraining wall will cause 10,000 geese to put to wing, and a tribunal of enquiry will follow locally, immediately, with lynching a strong possible outcome.  Birders are highly motivated folk and are not to be underestimated.</li>\n<li>Other possibilities apparent on the OS, further east, are dead ends.Unless perhaps one works for Coillte.</li>\n<li>Curracloe to the north T115-266 in W wind might be on.</li>\n<li>Confident paddlers might consider Rosslare Point T110-187, but be sure to have made your will before departing.See what Jasper Wynne has to say about the matter.  I have seen the tides thereabouts with wind over and would not wish them on ordinary folks.</li>\n</ul>\n<p>The fort for which the island is named was built in 1642 as part of the great struggle then overwhelming Ireland as part of the greater UK conflict.  “Royalists” stuck by their king, while “Parliamentarians” wanted democracy.  The Irish ”Confederates” just wanted to be left out of it.  Problem was that after Irish Ireland was so badly beaten at Kinsale in 1601, a lot of UK commercial interests followed.  These then expanded in Ireland, as such things have always developed, mostly agricultural on this particular occasion, at the time termed “planting”.  The 1600s was a cruel century and the 1640s a cruellest of decades (it had competition, later).  In 1641 all hell broke loose when the Confederates saw their opportunity, and in due course, one Oliver Cromwell was despatched by the Parliamentarians in the UK to subdue and punish the Irish pretenders.  He was a man in a hurry.  Custom of the time gave mercy to towns surrendering without the attackers having to waste bullets and even lives in an attack, and surrender was well rewarded, as it were. Dublin did, Drogheda didn’t, and were treated accordingly.  The Wexford defenders agreed to surrender, then broke the deal, tried to renegotiate. This really irritated the great man and Wexford paid the price. The defence of Wexford included our Rosslare Fort.  Cromwell’s navy arrived off Wexford Harbour and the small garrison fought heroically until their supply of ammunition was exhausted.They did escape, except perhaps they didn’t understand all the rules and they left their wives and children behind, 89 of them. Cromwell rounded-up the wives and children left behind and forced them to trudge along to just outside the walls of Wexford. Despite their pleas and their heart-rending shrieks they were all massacred without mercy.  One by one.  Wexford eventually got the message and surrendered. Locals say the remains of the fort and houses appear and disappear at times, but in late 2011 there was only a remnant breakwater to remind anyone where the fort once stood, nowadays marked by a N mark on a pole (in 2011 it should have been an east mark, in 2015 it should have been a south mark).</p>\n","costalZone":"**The East Coast**"}