{"name":"**Sunk Island**","nameHtml":"<p><strong>Sunk Island</strong></p>\n","safeName":"Sunk-Island","coordinates":{"irishGrid":{"sheet":"O","eastings":"323","northings":"398"},"fullIrishGrid":{"sheet":"","eastings":"332300","northings":"239800"},"tmcGrid":{"sheet":"","eastings":"732222.185","northings":"739824.934"},"geo":{"lat":"53.39200857","long":-6.01204743}},"cursor":15515,"description":"<p><strong>Sunk Island</strong> O323-398          Sheet 50 A small rocky island located on the SE corner of Lambay Island. The island marks the NE corner of a small attractive bay called Sunk Island Bay. The bay’s cliff edges hold good numbers of breeding seabirds, and the island has 40-50 pairs of Guillemots and Razorbills and c.10 pairs of Shags. Landing at times of HW is onto a very convenient flat rock platform at SW corner. No water. No camping. Climb to small grass covered top overlooking narrow cut on its W side. This very narrow cut with steep walls on both sides separates the island from Lambay Island. The cut is just about navigable by kayak in good conditions at HW. The passage is atmospheric but is committing as there is no room for paddle strokes so good judgement is necessary. <strong>Dublin North – Camping</strong> For camping kayakers on passage, getting past Dublin is a challenge. On the N side, possibilities are few. Skerries town is perfectly possible and particularly along the beach S of the town, but it is a quite public promenade. The inner islands off Skerries offer an alternative choice, but all harbour rat populations for company, as does Ireland’s Eye further S. There are two possibilities that are well secluded, or at least unobtrusive. O198-660 – Balbriggan 2<em>km</em> NNW of the town. Known locally as Bell’s Field, Bremore this headland area has some good sandy beaches located along its northern side with grassy areas for camping. No water available. The area is of archaeological interest and several burial mounds are present. O272-584 – Shenick’s Point Midway Skerries / Loughshinny, camping is available on grassland above an E-facing storm beach. It is best approached at local HW as landings at the lower waters leave a difficult carry. The site is attractive and relatively quiet and secluded. No water available. O270-545 – Rush North Beach Camping and caravan park, tel. 01-8437131. A short carry from HW mark. Land onto a safe sandy beach. Pub grub at 400<em>m</em> walk. Coming from Dublin by car, turn left in Rush along R128 for Skerries, then right after 150m, down to the beach and campsite.</p>\n","costalZone":"**The East Coast**"}