{"name":"**The Kish**","nameHtml":"<p><strong>The Kish</strong></p>\n","safeName":"The-Kish","coordinates":{"irishGrid":{"sheet":"O","eastings":"390","northings":"311"},"fullIrishGrid":{"sheet":"","eastings":"339000","northings":"231100"},"tmcGrid":{"sheet":"","eastings":"738920.66","northings":"731126.771"},"geo":{"lat":"53.31217207","long":-5.91522442}},"cursor":17610,"description":"<p><strong>The Kish</strong> O390-311        No Sheet (50) The Kish is located 12<em>km</em> E of Bullock Harbour. The Kish sits on a man-made base. The height of the tower is 29<em>m</em>.  Kish flashes twice every 30 seconds, as does its horn, its range is 28<em>nm</em>.  Kish has a 10 metre helicopter landing platform. There are strong currents off the Beaufort Bank and the Kish. Tides Plan to reach the Kish at slack. HW slack is best so as to avoid the encrusted bottoms of the two ladders, one on the eastern side and one on the western side, which are then the more handily accessed and easily climbed.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Off the Kish lighthouse</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">5:00 after Dublin HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">1:00 before Dublin HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Planning: One should depart in order to reach the Kish at slack, better HW slack. There are two ladders, one on the E side and one on the W side. These are easily climbed and can be easily accessed at slack water. If the lighthouse keeper is there, normally when maintenance is being carried out, he will more than likely come out to greet you.  If work permits, he will give you a tour of the light house. Don’t forget to sign the visitors book as there are very few kayakers in it. In fog keep an eye out for the South Burford mark. Ferries and fishing vessels pose a danger, so know the times of the ferries before departing. Remember that the ferry must go north of the Kish bank and south of the Burford bank Special interest: Storm petrels and porpoises. History A light ship was first used in 1811. In foggy weather a gong was sounded but when the Holyhead Packet ship was expected an 18 pounder gun was fired. In 1954 the first of the all electric light vessels – Gannet – was placed on the station. In November 1965 the Kish Light-vessel was withdrawn and replaced by the Kish lighthouse.   Round Trip for a kayak – 3.5 to 4 hours Inner part The inner part of the bay, with its city and industrial surrounds, holds little interest for sea kayakers, and is dealt with briefly. All the practical embarkation points are considered. The outer parts of the inner part of the bay, from Dun Laoghaire to Dalkey Island on the S side, and from Sutton to Howth on the N side, are justifiably popular. popular. Tidal Overview The tide floods north and ebbs south off the entrance to the bay. Inside the bay, the situation is more complex. Tides in the middle of the bay are almost stationary. The streams circulate around the edges. The effect of this is to constantly renew the waters of the bay which dissipates the worst polluting effects of the nearby population. Timings and strengths are very different on the two sides of the bay. The flood enters the Bay through Muglins and Dalkey Sounds, past Dun Laoghaire Harbour, around the bay and out past the Bailey. The ebb flows past the Bailey towards Dun Laoghaire Harbour and out southeast along the shore to Dalkey Island and it also eddies around the northern part of the bay. Tides in the north In the northern part of Dublin Bay, the tides are as per the southern side of Howth Head. Tides in Dublin Harbour The streams inside the harbour, under ordinary conditions, go with the rising and falling tide. Beware however heavy rainfall causing the river to flood. The overlying fresh water conditions favour short weak floods and long strong ebbs and the outgoing stream can thus be very strong at the mouth, reaching 3.5kn. This is typical of heavily freshwater-fed enclosed places. Tides in the south See Dalkey Island below. Coastline North Bull Island forms the entire inner, N side of the Bay, involving a substantial LW carry. Landing, but without road access, is occasionally possible along the S shore of Howth Head. Landing is possible all the way from the mouth of the Liffey to Sandycove, except for regulated areas inside the busy ferry port of Dun Laoghaire Harbour where some parts must be totally avoided. In particular, keep well away from the SE of the harbour. The closer to Dublin though, the less conducive it becomes to land. From Dun Laoghaire Harbour inwards, the shore is mostly sandy beach, with the tide receding long distances at LW. In addition, the railway runs all the way along here making road access only occasionally available. From Sandycove at O257-281 to Sorrento Point at the S end of Dalkey Sound at O273-261, the ground is almost entirely small granite cliffs fronting impressive private property. Pretty, but landing is practical only at the three public harbours, Sandycove, Bullock and Coliemore. <strong>Dublin Bay Embarkation Points</strong></p>\n","costalZone":"**The East Coast**"}