{"name":"**Tuskar Rock**","nameHtml":"<p><strong>Tuskar Rock</strong></p>\n","safeName":"Tuskar-Rock","coordinates":{"irishGrid":{"sheet":"T","eastings":"227","northings":"072"},"fullIrishGrid":{"sheet":"","eastings":"322700","northings":"107200"},"tmcGrid":{"sheet":"","eastings":"722623.543","northings":"607254.213"},"geo":{"lat":"52.20341057","long":-6.20597883}},"cursor":24312,"description":"<p><strong>Tuskar Rock</strong> T227-072           Sheet 77 Ireland’s most SE island, this austere, 5m high rock is 9<em>km</em> off the coast across strong currents. The passage is 11<em>km</em> from the beach, and deserves respect. There is a very remote and exposed feel to this place, which is famous for its lighthouse. Landing The steps at the small quay on the ENE side are probably the best landing. There is a narrow channel behind the quay but it surges. There are steps on the WNW side, should sea conditions allow. There are possible exposed landings at the S, and some shelving slabs on the N side, either of which might work. Fauna The island has an impressive list of recorded bird species, largely documented by R. <em>M</em>. Barrington (1900). Successive light keepers assembled the records from detailed recording in the 1800s. The island is a magnet for migrant birds due to its strategic position as the main entry and exit point from Ireland to mainland Europe. Barrington records several occasions when over 3,000 birds were killed at the light in one night during poor weather conditions. Seal, Common Porpoise and Dolphin are frequently reported. Tides and Trip Planning The trip planning requires thought. The tides run at over 3kn in the main channel on springs. A straight out-and-back ferry glide is impractical for slow boats – a slingshot approach is recommended from the northwest.  There is no suitable launching place to the southwest and worse, the tide sets over a dangerous shallow area halfway out called The Bailies at T177-060. This long, thin, north/south strip should be avoided. The option of coming from the north avoids The Bailies and means catching the last of the south-going ebb.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between Tuskar and the mainland</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">4:30 after Dublin HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">2:30 before Dublin HW</td>\n\n<td width=\"57\">3kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Aim to be on the rock at slack water. Launch 90 minutes beforehand at 3 hours after Dublin HW from the beach at T140-123 at the back (i.e. southeast) of Rosslare Harbour pier. The entrance is just off the roundabout at the entrance to the ferry terminal. Here there is room for large groups with a manageable carry to the water, but beware of a 2m height barrier. The harbour is the major ferry terminal of the southeast of Ireland. Make no mistake – on the way out, get well out from the land and come down onto the rock. The return journey is simpler but more energetic.  Make for the mainland and then creep round Greenore Point. Be careful not to be swept past the harbour and into the shipping lane. Contrary ENE flood streams speed up and overfalls occur at The Bailies and off Greenore Point.  Paddle hard. An alternative embarkation point or emergency landing spot is St. Helens Pier at T146-099.  Sheltered from east/south except in heavy swell, when it may close out, a slipway inside a pier gives much less fussy and plentiful parking, no height barriers, rough camping and even a picnic table with a street light.  The tides need closer watching though.  On the way out creep up to Greenore to provide a more manageable ferry angle and on the return be that touch more motivated. Dangers (a) Local paddlers report that the tide running past Greenore Point (as the tired paddler returns to land from the sea) can be the strongest encountered in the area. There is a report of a party seeing a lobster pot in this area, in mist, 1 or 2<em>km</em> out. Having decided to check the direction and speed of the current, they could not make it upstream to the pot! Consider that any slippage here shovels the paddler into the busiest part of the main shipping channel, and the need for care cannot be exaggerated. (b) It is important to note that the shipping channel to France approaches Rosslare W of (i.e. <em>inside</em>) the Tuskar. The shipping channel to Wales, which includes the Lynx fast ferry, as well as all merchant shipping, lies <em>outside</em> to its N, and therefore should not concern this excursion. An enquiry as to French ferry times might be sensible.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td width=\"170\"><strong>Shipping Channels</strong></td>\n\n<td width=\"142\"><strong>Shipping Company</strong></td>\n\n<td width=\"180\"><strong>Route</strong></td>\n\n</tr>\n\n<tr>\n\n<td rowspan=\"2\" width=\"170\"><strong>North of Tuskar Rock</strong></td>\n\n<td width=\"142\">Stena Line</td>\n\n<td width=\"180\">Rosslare Fishguard</td>\n\n</tr>\n\n<tr>\n\n<td width=\"142\">Irish Ferries</td>\n\n<td width=\"180\">Rosslare – Pembroke</td>\n\n</tr>\n\n<tr>\n\n<td rowspan=\"4\" width=\"170\"><strong>West of Tuskar Rock</strong></td>\n\n<td rowspan=\"2\" width=\"142\">Irish Ferries</td>\n\n<td width=\"180\">Rosslare – Cherbourg</td>\n\n</tr>\n\n<tr>\n\n<td width=\"180\">Rosslare – Roscoff</td>\n\n</tr>\n\n<tr>\n\n<td width=\"142\">Celtic Link Ferries</td>\n\n<td width=\"180\">Rosslare – Cherbourg</td>\n\n</tr>\n\n<tr>\n\n<td width=\"142\">LD Lines</td>\n\n<td width=\"180\">Rosslare – St Nazaire/Gijon</td>\n\n</tr>\n\n<tr>\n\n<td rowspan=\"3\" width=\"170\"><strong>Contact with Port Authority.</strong></td>\n\n<td colspan=\"2\" width=\"321\">Call ROSSLARE HARBOUR on VHF Channel 12</td>\n\n</tr>\n\n<tr>\n\n<td colspan=\"2\" width=\"321\"><strong>T</strong> +353 (0)53 9157929</td>\n\n</tr>\n\n<tr>\n\n<td colspan=\"2\" width=\"321\"><strong>M</strong> +353 (0)87 2320251</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>History The lighthouse was constructed in 1815 with 11 men losing their lives during construction. 10 were drowned when an October storm swept them away, leaving a further 14 hanging onto the rock for 3 days, one of whom died of his injuries later. It was also a dangerous place to be during World War 2, a light-keeper lost his life and a second was injured when a drifting mine exploded against the rock. <strong>The South Coast</strong> <strong>Carnsore Point to Baltimore</strong> <strong>The Saltees</strong> Sheet 77 Embarkation Mainland launching is from the convenient, sheltered, pebbly beach immediately behind the W pier at Kilmore Quay. The beach is tucked in between the pier and Crossfarnoge (or Forlorn) Point at S965-032. Free parking is plentiful, but there is a height barrier at the more convenient end, and the carry is across boulders.  Toilets and water. Parking is more limited at or near the harbour itself. Launching is possible off the slipway, but there is a per boat charge, rigorously policed. The beach on the E side of the harbour extends out a long way, so is inadvisable at LW.  At HW the parking is free and the carry is easy.  This beach is also sheltered in W winds. Dangers The main local trouble spot is an underwater bridge, very shallow, called Saint Patrick’s Bridge. It starts 500m E of Kilmore Quay pier, and reaches out, in a crescent shape, all the way to Little Saltee. It is particularly troublesome on the E going tide. Boats not travelling fast enough, or not laying off enough, will be pulled down onto the bridge, where rough and accelerated water is hard to escape. This happens almost immediately after leaving the harbour. If caught, it is best to ferry glide in behind Little Saltee. 3.5<em>kn</em> is achieved in springs. Saltee Sound, between the two islands, is another trouble spot. Sebber Bridge at X956-978 is a shallow reef, which extends northwards from the NE tip of Great Saltee. The tide sets more or less E/W through the Sound, over the shallows. On the W making tide, especially with a wind from the W, the water becomes very rough indeed N of Great Saltee. SPA Peregrine, Chough. Tides Trip planning requires care for the strong tidal streams, the timings of which do tend to catch out the unwary. Local kayakers strongly disagree with officially published timings, saying they are up to 2 hours out. It may well be that timings vary considerably with wind conditions, and whether there are springs or neaps occurring. One thing all local kayakers agree on is that on leaving the harbour area, you always look at a lobster pot buoy to check your calculations are right. Local HW is 20 minutes after Cobh.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Saltees – St. Patrick’s Bridge</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">2:50 before Cobh HW</td>\n\n<td width=\"57\">4.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">3:30 after Cobh HW</td>\n\n<td width=\"57\">4.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The official published information is that the E making flood tide in the two sounds flows for 6 hours, beginning at about Cobh HW –0035 and ebbs W in reverse for 6 hours from Cobh +0535. This is the same as saying the E flood about an hour before local HW and the W ebb begins about an hour before local LW. Local paddlers insist this cycle begins an hour or even two hours ahead of that. If so, the E making flood tide begins at Cobh HW -0230 or so and the W ebb begins at Cobh +0330. They say that slacks occur when the tide is halfway up or down the harbour wall. If it is halfway up and rising, the E making flood is about to start. If it is half way down and falling, the W making ebb is underway. Be cautious of making the crossing on the strongest of the E making tide (local HW or thereabouts), especially if there are any slow-boats in the party, for fear of Saint Patrick’s Bridge. Avoid also the strongest of the W making tide (local LW or thereabouts) to avoid the run off over Sebber Bridge. If needs must, cross either  race as high as possible, as the water really kicks up downstream of the gaps.</p>\n","costalZone":"**The East Coast**"}