{"name":"**Wicklow Head**","nameHtml":"<p><strong>Wicklow Head</strong></p>\n","safeName":"Wicklow-Head","coordinates":{"irishGrid":{"sheet":"T","eastings":"235","northings":"924"},"fullIrishGrid":{"sheet":"","eastings":"323500","northings":"192400"},"tmcGrid":{"sheet":"","eastings":"723423.616","northings":"692435.317"},"geo":{"lat":"52.96845976","long":-6.16254322}},"cursor":22232,"description":"<p><strong>Wicklow Head</strong> T235-924           Sheet 56 Wicklow Head is a serious attraction to E coast paddlers in search of truly powerful sea forces in a full-blooded open water environment, yet with sanctuary nearby. On the head is a huge lighthouse, amongst the most powerful on the E coast. There are cliffs and caves on both sides. There is a pronounced eddy system either side of the head itself, and guaranteed playtime except for the shortest of slacks. On passage, err with caution to get past efficiently, as this is undoubtedly one of the most significant headlands of the S part of the E coast. Tides At Wicklow Head, the north-going flood starts earlier than on the Dublin/North Wicklow coast further north.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Wicklow Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">3:45 after Dublin HW</td>\n\n<td width=\"57\">5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">1:15 before Dublin HW</td>\n\n<td width=\"57\">6kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Off Wicklow Head where big boats go, the flood is up to 4kn and the ebb 3kn, but close by the rocks where kayaks go, the current gets seriously fast. Local paddlers say 6kn. On the flood, the tide race is 600m to the south of the lighthouse. On the ebb, there is a small race at Bride’s Head between Wicklow Harbour and Wicklow Head. The main race is under the lighthouse. It is always possible to rest in eddies except when the wind is from the eastern quadrant. From Wicklow Harbour to Wicklow Head, the tide close inshore always runs southeast. On the ebb, it runs strongly at up to 3kn. On the flood, a major eddy system operates. Local paddlers report considerable struggles close inshore in springs. Going north, keep in the bumpy main flow for 1km at least and then keep at least 1km offshore until Wicklow Harbour. Going south, on the other side of Wicklow Head, keep in the main flow as long as you can. A weaker eddy system operates, almost as far as Long Rock at Silver Strand at T338-910. Inshore tides all along the Wicklow and Wexford coasts generally follow the direction of the coast and information on timing is unreliable. From Wicklow Head to Arklow, the flood is thought to run up to 3kn in springs and the ebb at 1kn and the best estimate for times is the same as Wicklow Head. Embarkation Access to the Head is usually from Wicklow town as described above, but if a launching from S is preferred, there are several awkward choices. Public access is always available from Brittas Bay, but this is 10<em>km</em> to the S. Closer access points involve an awkward carry down steep steps to a beach. Magheramore beach at T330-884 is loved by surfers, especially on a low tide with a sustained wind from the S/SSE. Surfers leave their cars out on the road at T324-886 and carry their equipment to the beach, on foot. The access at Silver Strand at T337-911 is the most reliable, at least in summer, and closest. The road access at T336-914 is through the more N of two paying caravan parks above the beach. It involves a cruelly steep carry down long steps and a (seemingly) much longer carry back up later. Camping is possible and the surroundings are pleasant. This is a famous fishing spot, and there is friendly surf on the beach for playing in. It may be closed in wintertime. SPA Peregrine, Merlin. Arklow to Wexford Tides The tides between Arklow and Wexford Harbour follow the line of the coast and begin and end as follows:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Arklow – Wexford Harbour</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">4:00 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">2:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The amphidromic point near Cahore reduces the tidal range and ensures the times change rapidly over a relatively short distance. <strong>County Wexford</strong> <strong>Wexford Harbour</strong> “<em>The entrance to Wexford Harbour is a real archipelago of sand spits, sand bars and sand islands that grow, shrink and disappear with the ebb and flow of the tide</em>.” Jasper Winn (surely the most entertaining ever “round Ireland kayaker”?) has it absolutely right.  Things do change by the minute, but more slowly, more profoundly too.  The larger picture is that huge changes occurred throughout the 20<sup>th</sup> century. Rosslare Point lies nowadays 4.5<em>km</em> SSW of Raven Point but was always historically about 1<em>km</em> to its SE ! Storms broke through the narrow Rosslare penninsula in the winter of 1924/1925, making an island out of the tip, leaving its mediaeval fort and 47 coastguard houses stranded, which have since almost disappeared, as the island sank into the sand.  Tern Island, inside the newly widened mouth, was sold by a local to Birdwatch Ireland in the early 1970s but disappeared in a storm shortly after.  What is now Horseshoe Island (SE of the entrance) was once part of the burrow of Rosslare, reachable by Honda 50 until the late 1970s. Because of the shallows, beware almost constant rough water the width of the harbour entrance and for a ways outside.  The safest passage inwards or outwards these days seems to be hard by The Raven Point or N side, but it is poorly marked.  Rough water occurs on rising and falling tides. On passage past, best perhaps keep somewhat off the direct line.</p>\n","costalZone":"**The East Coast**"}