{"name":"**Ballycastle – Cushendall**","nameHtml":"<p><strong>Ballycastle – Cushendall</strong></p>\n","safeName":"Ballycastle-–-Cushendall","coordinates":{"irishGrid":{"sheet":"D","eastings":"121","northings":"415"},"fullIrishGrid":{"sheet":"","eastings":"312100","northings":"441500"},"tmcGrid":{"sheet":"","eastings":"712027.687","northings":"941481.76"},"geo":{"lat":"55.20784313","long":-6.23988563}},"cursor":4085,"description":"<p><strong>Ballycastle – Cushendall</strong> D121-415 – D263-256     Sheet 5 There is a good view of Ballycastle Bay and Fair Head from the car park at the harbour. The strand all along Ballycastle Bay shelves steeply, and any swell produces powerful dumping waves onto the coarse sandy beach. The tides are powerful close inshore, and with rain, the outflow from the river by the harbour gives a good indication of what is happening. The shore from Pans Rock at D133-417 to Murlough Bay 6<em>km</em> E is unrepentant. Initially there are large boulders after a cable or so. There is but the one landing, at Carric_km_ore at D164-427, the most secluded campsite in Northern Ireland. Around Fair Head, the tide races, off big boulders without shelter, backed by enormous climbing cliffs. There can be vicious downdraughts from winds from the S. Fierce tide races may be expected, and even the eddies close inshore are vicious. These cliffs were discovered for climbers by a sea kayaker on passage, Keith Britton. In 1964, Geoff Earnshaw and Calvert Moore put up the first climb – Earnshaw’s Chimney. By 2003, there were 363 routes at Fair Head cliffs, the finest in the land, bar none. This was the first recorded of many such interactions between these symbiotic outdoor pursuits, kayaking and climbing. Murlough Bay requires landing onto the rocks, but is sheltered, near the bottom of the NT car park. At LW a beach appears E of the cottages. The road here is private, but there is a natural ‘slipway’ at the cottages which allows easier access or egress, capable of being used without any bother from the cottage. Eastwards, the shoreline changes to steep and unstable grass slopes, intermingled with loose cliff and scree. There is a small landing E of Torr Head at D234-408. Have a look at the interesting stone shelter in the mouth of the cave. The local fishermen are particularly informative. Have a fair tide hereabouts, or suffer. The coastline S is much the same, steep grass eroded to provide exposed rock on the shore. The lack of distinct features makes judging progress difficult. There are some pleasant shingle beaches N of Cushendun. At Cushendun, land at the S end where a lane gives access to a car park, near the outflow of the Glendun River at D251-334. There is a paying campsite up in the village, too far away to be convenient. The coastline S to Cushendall is similar. There is a car park in Cushendall at the N end of the beach, with easy access at D263-256. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Off Cushendun</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\"><strong>Direction</strong></td>\n\n<td width=\"161\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\">N</td>\n\n<td width=\"161\">Belfast HW</td>\n\n<td width=\"57\">4kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\">S</td>\n\n<td width=\"161\">Belfast LW</td>\n\n<td width=\"57\">4kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>An eddy works both ways between Cushendun and Garron Point at D303-243.</p>\n<table width=\"478\">\n\n<tbody>\n\n<tr>\n\n<td colspan=\"4\" width=\"478\"><strong>Cushendun to Garron Point eddy</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"62\"><strong>Main**</strong>Flow<strong></td>\n\n<td width=\"85\"></strong>Eddy<strong>**Direction</strong></td>\n\n<td width=\"170\"><strong>Start Time</strong></td>\n\n<td width=\"161\"><strong>End Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"62\">S</td>\n\n<td width=\"85\">N</td>\n\n<td width=\"170\">2:00 before Belfast HW</td>\n\n<td width=\"161\">1:00 before Belfast HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"62\">N</td>\n\n<td width=\"85\">S</td>\n\n<td width=\"170\">3:00 after Belfast HW</td>\n\n<td width=\"161\">5:00 after Belfast HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Garron Point to Ballygalley Head Tides An eddy works both on the flood and the ebb between Garron Point at D303-243 and Ballygalley Head at D384-081. <strong>The Maidens</strong> The Maidens or Hulin Rocks are two small lighthouse islands located 9<em>km</em> ENE of Ballygalley. The West Maiden is also known as the Northern Rock, its lighthouse is called the West Tower. The East Maiden is known as the Southern Rock and holds the East Tower. Both were active lighthouses until the West Maiden was abandoned in 1903. The East Tower was modernised, automated and went electric in 1977. Embarkation The nearest is from a large car park with a slipway and access to a small shingle beach at D378-080 between Ballygalley and Ballygalley Head. There is also embarkation at Portmuck D460-024 on Island Magee which has good launching,good carpark and toilets.From here though there is the need to exercise great caution as it will be necessary to cross the Larne  shipping channel which is used by a “fast” ferry in summer months and conventional ferries throughout the year. Local paddlers tend to prefer the Port Muck embarkation and normally try to go out  about one and half hours before LW Belfast and return after the tide has turned. Shipping: The safest route to the island means staying N of Ballygalley Head. The port of Larne just S is busy with very fast cross channel ferries and shipping. Most take a line from Larne to Scotland that passes S of the Maidens, but some do pass N and then inside the Maidens when awaiting berthing space in Larne.</p>\n","costalZone":"**The North East**"}