{"name":"**Blockhouse Island**","nameHtml":"<p><strong>Blockhouse Island</strong></p>\n","safeName":"Blockhouse-Island","coordinates":{"irishGrid":{"sheet":"J","eastings":"255","northings":"096"},"fullIrishGrid":{"sheet":"","eastings":"325500","northings":"309600"},"tmcGrid":{"sheet":"","eastings":"725424.361","northings":"809609.957"},"geo":{"lat":"54.02043588","long":-6.08594502}},"cursor":12434,"description":"<p><strong>Blockhouse Island</strong> J255-096           Sheet 29 Blockhouse Island (a guano pile in springtime) lies between Sheep Rock and Haulbowline Lighthouse, is bigger than either but is not named on the OS map. This small rocky islet guards the entrance to Carlingford Lough. A military building was erected here in 1602, now entirely ruined, and was known as Carlingford Fort. The island is small and worthwhile mainly as a waypoint on tour, as landing may always be had onto stormbeaches on the W or slabby limestone on the E side. The lighthouse just to the E at J260-096 is 20m high with a white light flashing three times every ten seconds and an ancillary red light lower down continuously flashing. Landing at the lighthouse is not permitted and anyway can only be achieved in calm conditions. The main channel into the lough passes to the N of the island, where one must avoid commercial shipping. Navigation in the lough is very buoyage orientated so consider using Chart 2800. Embark on the S side of the lough from Greenore or from the pretty Carlingford Harbour. The best launching in Greenore is from behind the pier at J225-107, and in Carlingford launch just outside the E pier at J194-118, as the silted harbour exposes black mud at the bottom of the tide. On the Northern Ireland side, launch from Greencastle Point at J242-117, or a small car park and beach at J263-107, between Soldiers Point and Cranfield Point. Tides Tides run strongly in the lough entrance near the island, where the ebb and flow start with local HW and LW, which are much the same as Dublin, especially in the dredged channels E &amp; N of the island, where 5kn can be experienced.  On the other hand, on-shore winds on the ebb throw up a fearsome sea state. The ebb tide runs at 3.5<em>kn</em> in springs in the dredged channels. The flow follows the main dredged channels except for an eddy on the flood on the E side of Blockhouse Island. Good overfalls and races occur during both the flood and the ebb around the Haulbowline Lighthouse. The most pleasant and relatively safe playing in these overfalls is on the flood tide. The area is regularly used by local clubs and centres for rough water training. <strong>The East Coast</strong> <strong>Greenore Point to Carnsore Point</strong> <strong>County Dublin</strong> <strong>Islands off Skerries</strong> A group of three low-lying islands lie just off the coast at Skerries, with ‘The Rock’ further off. Taken together they form an interesting day trip with good wildlife interest. They are listed as areas of Scientific Interest by Duchás with SPA status. Camping is possible, but no water is available. The presence of a healthy population of rats on the inner islands may discourage an overnight. Rugged Rockabill further out is a lighthouse island rock. SPA Short-eared Owl (up to 7 in winter), Golden Plover, and Common, Sandwich and Roseate Tern. Embarkation The most convenient embarkation place is at the slipway beside the RNLI building at the pier in Skerries, where parking is generally convenient at O255-612, but not for larger groups especially in summer. Otherwise its Pay&amp;Display or search.  Do not, under any circumstances, block the access to or interfere with the operation of the lifeboat station, or of the working pier. Launching may also be had less conveniently from the E facing South Strand, but only at HW to avoid a long carry. The main catch at Skerries is prawn and shrimp. Accordingly, the local fishermen are benignly disposed to seals, which do not catch either. Seals are plentiful hereabouts. Tides The flows flood generally north and ebb south. Tides flow strongly in the sounds.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Among Inner Islands</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">N</td>\n\n<td width=\"173\">4:30 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">S</td>\n\n<td width=\"173\">1:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The cycle starts and finishes about 10 minutes later at neaps at -1:20 and +4:20. The speed does not take into account local anomalies. Certainly the speed of the ebb tide on the northeastern side of St. Patrick’s Island are greater than stated due to some of the ebb flow being deflected eastwards from the inner bay. The speed and sea state are also increased by a rock shelf of the northeastern corner. The speed over Dithaun spit which runs west from St. Patrick’s Island is similarly higher but only for 1-1:30 hours after HW.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between St. Patrick’s &amp; Rockabill</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">5:30 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">0:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The cycle starts and finishes about 10 minutes later at neaps at 0:20 before and 5:20 after Dublin HW. Shallow areas to the east of St. Patrick’s and Shenick can speed up the flow locally. Local HW/LW is 20 minutes before Dublin.</p>\n","costalZone":"**The North East**"}