{"name":"**Carrickarede Island**","nameHtml":"<p><strong>Carrickarede Island</strong></p>\n","safeName":"Carrickarede-Island","coordinates":{"irishGrid":{"sheet":"D","eastings":"062","northings":"449"},"fullIrishGrid":{"sheet":"","eastings":"306200","northings":"444900"},"tmcGrid":{"sheet":"","eastings":"706129.04","northings":"944881.031"},"geo":{"lat":"55.23967118","long":-6.33123925}},"cursor":2940,"description":"<p><strong>Carrickarede Island</strong> D062-449          Sheet 5 Carrickarede Island is about 2<em>km</em> E of Ballintoy Harbour and anyone visiting the area will be directed here. It is owned by the National Trust. It can be visited by land across its famous rope bridge, in place throughout the year, once used to serve salmon fishermen. Great bravery is required.  Far easier sometimes to visit by sea. The tide race off the NW corner is powerful, but can often be avoided by going under the rope bridge. The sand bar here is covered on the top two thirds of the tide. The rock strata is interesting, giving good nest sites for Kittiwake, Razorbill and Guillemot. There is a wonderful cave on the outside, visible only from the sea. <strong>Carrickarede to Ballycastle</strong> The cliff scenery now becomes quite majestic. The small wooded area at Port More is very unusual. Buzzards are common hereabouts. Landing may be had by an old winch on the W side of a forest. It is possible to escape here, but it is a long scramble to the nearest road. Watch for the splendid through-cave in Kinbane Head at D088-438. Tides set strongly at the head, and a very defined line separates the eddy from the flow. This is an excellent teaching area. Landing is possible on the W side of the head. A long steep path leads up the cliff to a car park on the E side. Nice cliffs join Kinbane Head to Ballycastle, with dramatic caves. The cliff structure hereabouts is liable to rock fall, the slips evident by lack of vegetation. One such is directly above an inviting cave entrance, so do take care. Ballycastle has a number of options for landing. The large breakwater has a concrete slip. The old pier has a slipway beside it. Car parking abounds, except in summer congestion. There is also a car park at the E end of the beach at D132-416 by Pans Rocks. <strong>Rathlin Island</strong> Chart 2798 covers the general area, as does OSNI Sheet 5. The information in the Pilot and the Sailing Directions is essential on this challenging section of coastline. Rathlin lies just over 10<em>km</em> N of Ballycastle, where there is a good embarkation place at the pier at D122-415. The island is served by regular ferry, and boasts a stable population. Most of the habitation and services are at Church Bay. Camping with water and toilets is possible amongst old caravans at D148-506, just S of the harbour. There is a hostel in the Old Manor House at the harbour, and some guest houses, the most convenient of which is just beside the large pier at D147-510. More remote camping spots can be had along the shore by Rue Point at D151-473 and along the E coast in the many secluded bays. Camping is convenient at Portawillin at D161-512 where there is a small pier with steps. The rest of the island is generally steep with cliffs towering above boulder beaches and landing is impossible or uninviting except in an emergency. The island, steeped in history, has a distinct character all its own. Wallace Clark’s book ‘Rathlin – Disputed Island’ gives a lot of information about its history from the earliest settlers to modern times. In earliest times porcellainite, or flint (as in stone age axes) was mined here and exported. The island was successively conquered and reconquered by the Vikings, Scots, Normans and the English. Most famously, it was litigated over between Ireland and Scotland, and found to be Irish because there were no snakes (Saint Patrick is said to have banished all snakes from Ireland in the 5<sup>th</sup> Century). Circumnavigation For the sea canoeist, this is one of the most committing of paddles, which is best done clockwise as the shape of the island sets up eddies to one’s advantage. The E side is the only part where progress could be made against the tide. The island is ‘L’ shaped and at each of the headlands there are major tide races, which are always active except at slack water, though it is generally possible to stay inshore and avoid their full force. The MacDonnell Race at the NE corner is particularly fearsome. The cliffs on the N side are high and dark and the feeling of exposure is greatest here. There are caves in the NE corner near the E lighthouse, the most famous of which is said to have been used by Robert the Bruce, where he met his spider. The S facing cliffs W of Church Bay are chalk overlaid with basalt, and very picturesque. There are some interesting shapes and stacks as one nears the W end of the island. There is an old pier at D102-509 in Cooraghy Bay, which gives a chance of a rest before tackling the committing part of the paddle. SPA Peregrine, Guillemot, Razorbill. The island, and the NE corner of Ireland generally, is splendidly situated for passage migrants in spring and autumn. Puffin, Buzzard and Eider are amongst the birds abounding in summer. A large colony of Common Seal may be found in Mill Bay, just S of the main harbour. Rathlin mice are the biggest in Ireland. Tides and embarkation The most obvious embarkation place is from Ballycastle. The tides in Rathlin Sound reach 6kns so the only time to make the crossing is on slack water (HW/LW Belfast). Start half an hour to an hour beforehand. Read the Irish Coast Pilot and study the hour-by-hour tidal chartlets the Sailing Directions of the Irish Cruising Club, North and East Coasts volume. Refer also to the Admiralty Tidal Stream Atlas for the Firth of Clyde and Approaches, NP222. Southwest of Rue Point at D152-473, the overfall <em>Slough-na-more</em> is most dangerous for an hour from 1:30 after Belfast HW. The flow on the north side of the island is always easterly due to an eddy on the ebb. An alternative is to embark from Dunseverick Harbour at D000-445 or Ballintoy Harbour at D038-456 on the last couple of hours of the flood and to come back six hours later on the last of the ebb.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Rathlin Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">E</td>\n\n<td width=\"173\">5:30 before Belfast HW</td>\n\n<td width=\"57\">6kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">W</td>\n\n<td width=\"173\">0:30 before Belfast HW</td>\n\n<td width=\"57\">6kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>HW Rathlin and Ballycastle is 4:45 before Belfast in springs and 2 hours before in neaps. This large variation is due to the proximity of an amphidromic point at Port Ellen, Islay. Eddies On a coastal trip, the eddies from Fair Head at D280-438 to Kilbane Head at D088-438 can be used as follows:</p>\n<table width=\"563\">\n\n<tbody>\n\n<tr>\n\n<td colspan=\"5\" width=\"563\"><strong>Fair Head to Kinbane Head eddy</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"53\"><strong>Main**</strong>Flow<strong></td>\n\n<td width=\"85\"></strong>Eddy<strong>**Direction</strong></td>\n\n<td width=\"170\"><strong>Start Time</strong></td>\n\n<td width=\"161\"><strong>End Time</strong></td>\n\n<td width=\"94\"><strong>Strongest at…</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"53\">E</td>\n\n<td width=\"85\">W</td>\n\n<td width=\"170\">5:00 before Belfast HW</td>\n\n<td width=\"161\">1:00 before Belfast HW</td>\n\n<td width=\"94\">3:00 before</td>\n\n</tr>\n\n<tr>\n\n<td width=\"53\">W</td>\n\n<td width=\"85\">E</td>\n\n<td width=\"170\">1:00 after Belfast HW</td>\n\n<td width=\"161\">5:00 after Belfast HW</td>\n\n<td width=\"94\">3:00 after</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Rathlin is a challenging paddle even for the experienced, and careful planning is required.</p>\n","costalZone":"**The North East**"}