{"name":"**Cockle Island**","nameHtml":"<p><strong>Cockle Island</strong></p>\n","safeName":"Cockle-Island","coordinates":{"irishGrid":{"sheet":"J","eastings":"536","northings":"837"},"fullIrishGrid":{"sheet":"","eastings":"353600","northings":"383700"},"tmcGrid":{"sheet":"","eastings":"753518.704","northings":"883694.233"},"geo":{"lat":"54.67796225","long":-5.61941852}},"cursor":5394,"description":"<p><strong>Cockle Island</strong> J536-837           Sheet 15 Rumoured to be either privately owned or National Trust property, Cockle is quite extensive at LW but tiny at HW.  It shelters the harbour at Groomsport, enabling a couple of dozen moorings in its lee.  A remarkable reef, it is submerged by the highest tides, and there is no grass or greenery of any kind.  It is always separated from the shore by deep water.  Black Headed Gulls and Herring Gulls occupy different sections of it for roosting.  There are reports of Terns nesting.  Its claim to fame includes a Sooty Tern (called locally “Wideawake Tern” in Ascension Island where they spend the rest of the year) in summer 2005. Launch from the slipway at Cockle Island Sailing Club on the pier just SE (the pier is not shown on the OS). Groomsport is an unsatisfactory embarkation point for the Copelands because the tides are never right.  The ebb from Belfast Lough pushes E towards the islands while the ebb outside is pushing N away from them.  The flood in the Lough pushes away when outside it is pushing towards.  A slingshot from Donaghadee is far preferable, if it can be arranged. <strong>Copeland Islands</strong> Sheet 15 Embarkation Donaghadee is the logical embarkation point for a day trip to the Copeland Islands. There is access via ferry which allows time for wandering about Copeland Island itself. It seems to run in summer mongths only from the harbour. For kayaks, there is a small car park and slipway just W of the harbour at J588-803. Copeland Island is the innermost of the group, with Lighthouse Island next and Mew Island on the outside. Donaghadee Sound lies inside Copeland Island. Copeland Sound lies between Copeland Island and Light House Island. Given the strong tides, this is an excellent proficiency training and testing ground. Any trip around the group can be challenging, as the tides do run hard in the sounds. Grey and Common Seals are both found, the latter on Copeland itself and the former favouring the more exposed channels between Mew and Lighthouse. Tides There are strong tide races throughout the sounds.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"4\" width=\"440\"><strong>Donaghadee &amp; Copeland Sounds</strong></td>\n\n</tr>\n\n<tr>\n\n<td rowspan=\"2\" width=\"78\"><strong>Direction</strong></td>\n\n<td rowspan=\"2\" width=\"173\"><strong>Time</strong></td>\n\n<td colspan=\"2\" width=\"189\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"104\"><strong>Donaghadee</strong></td>\n\n<td width=\"85\"><strong>Copeland</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">SE</td>\n\n<td width=\"173\">5:00 after Belfast HW</td>\n\n<td width=\"104\">4.5kn</td>\n\n<td width=\"85\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">NW</td>\n\n<td width=\"173\">1:00 before Belfast HW</td>\n\n<td width=\"104\">4.5kn</td>\n\n<td width=\"85\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p><strong>Eddy south and east of Copelands</strong> This eddy runs N on the flood and starts off Ballyferris Point where it is narrow. It widens out to meet the main stream off Mew Island where it forms the Ram Race.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td width=\"90\"><strong>Direction</strong></td>\n\n<td width=\"161\"><strong>Time</strong></td>\n\n<td width=\"76\"><strong>Duration</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\">SE</td>\n\n<td width=\"161\">5:40 after Belfast HW</td>\n\n<td width=\"76\">3½ hours</td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\">NW</td>\n\n<td width=\"161\">3:00 before Belfast HW</td>\n\n<td width=\"76\">9 hours</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The Ram Race occurs east of Mew Island at the following times.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"251\"><strong>Ram Race</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"71\"><strong>Start</strong></td>\n\n<td width=\"180\">2:15 before Belfast HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"71\"><strong>Finish</strong></td>\n\n<td width=\"180\">0:30 after Belfast HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The Northern Race occurs N from Mew Island at the following times.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"251\"><strong>Northern Race</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Start</strong></td>\n\n<td width=\"173\">3:45 after Belfast HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Finish</strong></td>\n\n<td width=\"173\">6:10 before Belfast HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Bangor Marina produces an excellent tidal chart which is essential to understand the complex tides here.SPA Arctic Tern, Brent Goose, Ringed &amp; Golden Plover, Turnstone. Fauna The islands are internationally important sites for breeding populations of Manx Shearwater and Arctic Tern and nationally important sites for breeding Mediterranean Gull, Common Gull and Eider Duck.  The Manx Shearwater colony on Copeland Islands holds more than 1.7% of the world population. The colony is in excess of four thousand pairs.  The rabbit populations on the islands play an important role in the breeding success of the Manx Shearwater as the latter mainly nest in the rabbit burrows that honeycomb the islands. Grazing by rabbits maintains a short sward, which is desirable for the fledglings. Copeland Island has an internationally important Arctic Tern colony, with some 550 pairs. The site now represents the largest colony for this species in Ireland. Mew Island has been an important tern colony in the past and it is hoped that positive management will encourage terns to become re-established.  The islands are the most important breeding sites in Northern Ireland for Common Gull with over 250 pairs present. Copeland has recently held Northern Ireland’s first successful breeding pair of Mediterranean Gull. The islands are home to a nationally important population of breeding Eider Duck. In total the three islands account for 14% of the Irish population. Non- breeding Eider form part of the nationally important population that occurs along the Outer Ards coast and Belfast Lough areas. Other breeding colonies of note include Black Guillemot, Water Rail and Stock Dove. The latter species has suffered a dramatic decline in Northern Ireland, but numbers have increased on Copeland with some 100 pairs now breeding. Breeding waders such as Lapwing and Snipe may be found further inland. Here the taller vegetation, interspersed with open areas, provides an ideal breeding habitat. Birds of prey favour the islands when the breeding season is over. Hen Harrier, Sparrowhawk, Buzzard, Kestrel, Merlin and Peregrine are all be seen regularly. Grey Seal and Common Seal can be found off the Copeland Islands in significant numbers. They utilise the off-shore islands and reefs as haul-outs and as pupping and mating sites.</p>\n","costalZone":"**The North East**"}