{"name":"**Copeland Island**","nameHtml":"<p><strong>Copeland Island</strong></p>\n","safeName":"Copeland-Island","coordinates":{"irishGrid":{"sheet":"J","eastings":"590","northings":"834"},"fullIrishGrid":{"sheet":"","eastings":"359000","northings":"383400"},"tmcGrid":{"sheet":"","eastings":"758917.533","northings":"883394.332"},"geo":{"lat":"54.67359734","long":-5.5359477}},"cursor":6243,"description":"<p><strong>Copeland Island</strong> J590-834           Sheet 15 The very beautiful Copeland Island is the largest island of the group at 2<em>km</em> by 1<em>km</em>.  It is also closest to the shore, lying 3<em>km</em> N of Donaghadee. There are seven holiday/summer homes on Copeland, and the island seems deserted all winter.  The island never had fuel of any kind, neither wood nor peat, all having to be imported. Bleak enough in winter, grassy, and bracken covered in parts.  It rises to 31m History Historically called Aran Island, the gaelic name was lost in early mediaeval times, when the Norse used the island as a trading base.  The modern <em>koopman</em> or older <em>kaupmann</em> means “merchant”, and <em>Kaupmannaeyjar</em> means “Merchants Isle”.  Both names were is use side by side until the 17<sup>th</sup>century when the Norse version won out.  Anglicised as Copman, this corrupted in time to the present Copeland.  A theory that the islands were named for William Coupeland, a Norman settler, has been debunked by distinguished local historian Peter Carr. The graveyard 200m from the landing at Chapel Bay is very old, the inscribed headstones dating back to at least 1742, pointing to a once thriving community.  Cleggs, Emersons and Wrights are popular names.  A 1930s newspaper reporter wrote that the island was neat as a new pin, the hedges cut and shaped, the garden walls whitewashed.  Careful of their property the islanders were said to have been neglectful of their perception of their culture.  Neither could the aging population explain island placenames, nor did they show interest.  The population was mostly evacuated in 1946. The very last to go, Frederick and Aise Clegg, moved to the mainland in 1953.  They died in 1964 and 1965 and were the last burials in the island graveyard. Landing Sandy beach landings are possible in Chapel Bay at J591-834 on the SW and the even more beautiful Deer Bay on the NE side at J596-838. In fact there are other perfectly adequate landing points, either side of the S tip, and elsewhere.  Port Dandy at J585-836 has a beach, and its sheltered water is a popular gin palace anchorage of a sunny summer afternoon.  Best altogether keep away from the main settlement areas, as island folk value privacy. Ask on the island for permission to camp. Flora and Fauna Grazed mainly by rabbits and sheep, the island is short grassed and pleasant to walk.  Two immature Golden Eagle were seen in April 2006, some Pheasant, and a Short Eared Owl.</p>\n","costalZone":"**The North East**"}