{"name":"**Mew Island**","nameHtml":"<p><strong>Mew Island</strong></p>\n","safeName":"Mew-Island","coordinates":{"irishGrid":{"sheet":"J","eastings":"602","northings":"861"},"fullIrishGrid":{"sheet":"","eastings":"360200","northings":"386100"},"tmcGrid":{"sheet":"","eastings":"760117.247","northings":"886093.773"},"geo":{"lat":"54.69744926","long":-5.51588505}},"cursor":6773,"description":"<p><strong>Mew Island</strong> J602-861           Sheet 15 Mew Island is owned by the Commissioners of Irish Lights, and has a number of small associated islands on its SW side, all linked and walkable. The lighthouse (built in 1884) is reminiscent of an airport control tower. Apparently, this lighthouse was only automated in 1996, and until then the keepers even maintained a golf course for their entertainment! Landing is possible at the lighthouse jetty tucked into the channel, or into a cut in the NW, both deep-water landings. Before the lighthouse was built on Mew, a spectacular wreck was that of the ‘Enterprise’ in 1801. Then, in 1833, Alexander Graham Bell used a new fangled invention called a diving apparatus to retrieve its valuable cargo. A great tragedy was played out here on 31st January 1953 when the ferry ‘Princess Victoria’ got into trouble en route from Stranraer to Belfast in a severe NW gale. Heavy seas stove in the car deck doors, just after leaving the Scottish port. As the ferry slowly listed and began to sink, it drifted. The ‘Princess Victoria’ thought it was drifting down the Scottish coast, so the rescue services were sent to the wrong place. Only when the Copeland lighthouse was sighted was their correct position transmitted. The order was eventually given to abandon ship, and the life rafts were launched. The women and children were all in the first two rafts, both of which capsized. All drowned in sight of the men still on board. When the rescue services finally came on the scene, the seas were truly mountainous. Great heroism later merited several gallantry awards of the highest level available to non-military personnel. Captain Ferguson (brother of Harry Ferguson, inventor of the modern tractor) and his radio operator David Broadfoot stayed at their posts to the end and went down with the ship. 121 died. There were 44 survivors, all adult males. The same storm peaked in the North Sea that night. A combination of low pressure, a spring tide surge, and sustained NW winds raised the sea level more than 3m, flooding Holland over its dykes, and 1,600 were drowned. There have been issues with canoeists having BBQs on the island and leaving scorch marks on the grass areas.  This is a bird breeding island, and the gress is their home.  So it is important when landing on these islands to show respect and follow ”leave no trace” principles. <strong>Bangor to Strangford Lough</strong> Sheet 21 / Sheet 15 The paddling from Donaghadee at J691-802 to Ballyquintin Point at J624-454 at the mouth of Strangford Narrows – a distance of about 40<em>km</em> – is a straightforward but interesting enough piece of coastline. The Ards Peninsula has almost an island feel to it because of its remoteness by road and the ferry service which operates at the southern end at Portaferry. The coastline from Donaghadee to Ballyhalbert Point at J664-630 is less interesting than further S, being of shingle and sand beaches. Next comes Portavogie at J663-595, a busy fishing harbour often congested with trawlers. <strong>North Rocks</strong> Sheet 21           J674-561 North Rocks at J674-561 with its breeding Grey Seals, lies 3<em>km</em> SSE of Portavogie.   Consisting of two islets that stand no more than 1m above HW, this is Ireland’s most easterly landfall.   Landing at rocky coves to the NW and E is easy at LW and when conditions are calm.  At LW a decent ramble can be had among the deep rock pools and Cormorant nests.  Many ships have been lost here and the North Rocks beacon (an unlit 12m high tower 250<em>m</em> to the NW) gives a sense of maritime history. South Rock at J677-531 lies 2<em>km</em> offshore and 3<em>km</em> N of Kearney Point, and boasts the oldest standing wave swept lighthouse in Ireland (1797), Kilwarlin. The rocky shoreline of Kearney Point at J645-511 is owned by the National Trust and is a good place to go ‘rock pool peering’ for marine invertebrates such as Dog Whelks, Mussels, and Starfish. It is a very enjoyable day trip to catch the ebb tide from Strangford out to the mouth, then N to the Rocks, and back on the flood. There is a spit of land between the North Rocks and Ringboy Point at J650-574 to the WNW. Occasionally the sea can become steep and untidy here, particularly when the swell is against the tide. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Off Skullmartin Rock at J649-687</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\"><strong>Direction</strong></td>\n\n<td width=\"161\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\">N</td>\n\n<td width=\"161\">0:35 before Belfast HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"90\">S</td>\n\n<td width=\"161\">6:00 after Belfast HW</td>\n\n<td width=\"57\">2.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Further south, from Ballyhalbert Point at J664-630 to Ballyquintin Point at J624-454, the tides run along the coast and reach 1.5kn in springs. <strong>Strangford Lough</strong> Sheet 21 Strangford Lough is one of the largest sea loughs in Britain and Ireland. In ecological terms it is unique and the jewel in Northern Ireland’s coastline. It has a great deal to offer sea canoeists at every level, from sheltered backwaters for introducing novices, to powerful tide races, overfalls and whirlpools for the more experienced at the narrow entrance, called the Narrows. The old name for Strangford was ‘Cuan’ (meaning safe harbour) but the Vikings renamed it Strangford or ‘The Violent Fjord’. SPA Arctic, Common and Sandwich Tern, Bar-tailed Godwit, Golden Plover,<em>kn</em>, Brent Goose, Redshank, Shelduck. Strangford is the premier autumn arrival site for the Brent Goose. Some remain on for the winter but most disperse to other sites throughout Ireland. There are 2 species of seal to be found around our coasts. They are the Common (or Harbour) Seal and the Grey Seal. They are quite distinctly different. The Common has a spaniel dog type of head and is considerably smaller than the Grey, which has a flat head with a large obvious nose. There are about 400 Common Seals and 80 Grey Seals in the lough. The Common Seal give birth in June and it is most entertaining to watch the antics of the pups from the quiet position of a sea kayak. The greys give birth in October and it is a rare and beautiful sight to see the white furry pups of these much larger seals. Chart 2156 and OS sheet 21 each covers the lough in detail. <strong>Angus Rock</strong> Sheet 21                       J610-453 Angus Rock is the first point of note entering the Narrows, near the mouth. It is just a rock, virtually covered at HW, but on it stands a small lighthouse, white with an unusual red top band. At HW, there is just a concrete ramp proud of the water which can take a few kayaks at picnic time. At lower water, quite an extensive area of rock gets exposed. This is an important waystop, a most useful journey breaker on local day trips. There are overfalls and broken water around Angus Rock, both on the flood and ebb tide. See the tidal stream atlas for details. On spring tides, from the 1st to 3rd hour of the ebb, an interesting grade 2 rapid occurs on the N side of the Angus Rock. This can get up to about a grade 3 with a diagonal stopper during very big equinoctial springs. There is a drop in sea level across the rocks of about 3 feet and it is possible to get good surfing on the stopper wave. On the last hour of the ebb, an enjoyable set of waves often form, again on the N side of the Angus Rock, where you can join the seals for some surfing. On the flood tide, again just N of the Rock, another small set of overfalls is formed. There is an obvious drop in the sea level followed by small boils and whirlpools. <strong>The Narrows</strong> Sheet 21 Strangford Lough covers 150<em>km</em><sup>2</sup> of sea and contains 1650 million m<sup>3</sup> of sea water at high tide. HW at Portaferry is at least 2 hours later than at the mouth of the Narrows. It takes approximately 350 million m<sup>3</sup> (or tonnes) of water to fill the lough from LW to HW. All this water can only get into the lough by passing through the Narrows which is 9<em>km</em> long and at its narrowest point, only 600m wide. Hence a vast river of water rushes through at speeds of up to 7.5<em>kn</em>. Embarkation Points Where to put in and out depends entirely on the tidal flow at the time, and the main attraction of the expedition.  For the deep water surfing at the mouth, there are a number of choices along the W side from Ballyhornan as far up as Kilclief, to taste.  For the Routen Wheel approach so as to go home downstream, and for small groups that means just about anywhere, as the roads each side are favourable. Tides The tide begins almost simultaneously throughout the Narrows at the following times.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Strangford Narrows</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"170\">3:30 before Belfast HW</td>\n\n<td width=\"57\">7.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"170\">2:30 after Belfast HW</td>\n\n<td width=\"57\">7.5kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>Passage is straightforward and fairly safe on the flood. However, during the ebb, a heavy breaking sea can be encountered. This is particularly dangerous with any form of wind from the south/southeast/east creating a swell. Huge breaking seas are generated. For the more experienced and confident only, excellent deep-water surf waves are formed at the entrance, where it is advisable to play only on the last hour or two of the ebb. Routen Wheel The next point of interest is the Routen Wheel, just SW of Rue Point. The Wheel is on the E side of the channel. It is quite easy to avoid by closely hugging the coast along the E side. A good viewing point is from the wee island called Isle O’Valla at J593-488. The Wheel is characterised by short-lived but heavy and violent boils, whirlpools and stoppers. It is caused by an underwater ridge of rock only 4.6m below the surface, rising suddenly either side from 18m below, sticking diagonally out from the shallower E side of the main channel into the main flow. The NE/SW ridge that creates the Wheel is situated along a line 200<em>m</em> SW of Rue Point at J597-487 to J599-489. This is no ordinary rapid. A boil forms, then another beside it swivelling the other way, and soon a whirlpool forms on the boundary. Admire it as pretty, but then you are in it, sinking ever lower, pointing upstream, to the side, down again, then the whirlpool stops and away you go again. Paddling back up through the Wheel is an experience too as you try to read the water, the way boils are pushing and so on. A good eddy exists S of Rue Point on the E side, as far as Gowland Rock at J603-485, so that a number of runs of the Wheel can be enjoyed. The Wheel occurs during both the flood and ebb tide although it tends to be more violent during the ebb. The turbulence lasts for about 400m and any capsises can easily be dealt with beyond the turbulence. Rescues need to be swift as the speed of the current reaches 7.5<em>kn</em>. It is safer to play during the flood. Tidal Electricity A first for Ireland and the biggest by far in Europe, just 1<em>km</em> NNW of the Routen Wheel lies SeaGen at J599-494, the world’s only commercially viable underwater electricity generator.  SeaGen is a prototype wind farm for tidal races.  With twin huge blades of 16m either side of a central pillar, the propellers catch a massive 400<em>m</em>.sq of passing water.  300<em>m</em>.sq is required for profitability, and most other designs are well short of the mark.  The blades about turn every slack water so as not to lose a minutes effort, and they can be raised for easy maintenance.   Boats including kayaks may pass by with impunity as the blades are well below the surface, and no seals are as yet known to have suffered any trauma.  The pillar supporting the generator is round, which is a bad shape for downstream turbulence and consequent environmental worries, but the whole project including the impact of its water turbulence is being closely monitored, and the whole project will be reviewed after a few years. There is a rapid beside a beacon to one side, Gowland Rock at J603-485, where a surf wave forms, just like on a river. The area around here is used a lot by seals to haul out on the rocks. Care should be taken not to disturb them from their haul outs as it can cause injury. One of the greatest dangers on the Narrows is the potential for being run down by the ferry which runs between Strangford and Portaferry. This ferry has to contend with a 6<em>kn</em> tide and does a remarkably efficient ‘ferry glide’ across the flow. The Captain does not appreciate having to contend with dodging canoeists as well. The ferry departs Strangford on the hour and half hour and departs Portaferry every quarter past and quarter to the hour. The crossing time is about 5 minutes. ‘Exploris’, an excellent aquarium, is situated within a minute’s walk from the main slip at Portaferry and is well worth a visit as it has displays of the marine wildlife of the lough and the Irish Sea. Another place well worth a visit is the Barn at Castleward, owned by the National Trust, in Castleward Bay at J575-497. Access from the water is best gained during HW as there are extensive mud flats in the bay. The Barn has excellent audio visual displays of the marine wildlife, particularly the bird and mammal life found in the lough. They also have a number of very good videos on the wildlife of the lough. Entry is free. Audley’s Castle, built in the 16th Century, lies on the W side of the Narrows about 1<em>km</em> N of Strangford and is worth a visit. It is possible to land at the little beach and jetty beside it at J589-501 and climb to the top where there is an excellent view of the Narrows and the towns of Portaferry and Strangford. <strong>Inner Strangford Lough</strong> Sheet 21 Embarkation Points For such a large area, embarkation points are few enough.  There are few on the E side the main ones being a public Kircubbin J598-630 and in the Narrows at Portaferry itself at J594-507 – the slip N of the marina with reasonably good car parkingthe main towns in the Narrows.  .  The options include :</p>\n<ul>\n<li>Portaferry J594-507 – the slip N of the marina with reasonably good car parking,</li>\n<li>Strangford J589-497 – the slip at to the S of the ferry terminal with good car parking,</li>\n<li>Killyleagh J528-520 – the slip at the sailing club, in small discreet numbers.If access difficulties, there are other places along the shore, closer to town.</li>\n<li><p>Ringhaddy J526-585 – limited parking.</p>\n</li>\n<li><p>Ballydorn Lightship J526-624 – a little quay on the S side of Hen Island, to one side of the ship, and which apparently belongs to the yacht club.  The use of this should be discreet and in small numbers.  The yacht club may also be a possibility at J524-627.  There is also a splendid off-season campsite in a parking lot with toilets at J523-625, but beware extensive drying mudflats out front.</p>\n</li>\n</ul>\n<p>Tides Inside the lough, the tidal strength decreases from 6kn between Strangford and Portaferry to 4kn at Ballyhenry Island at J575-520, 2km northwest, as the water disperses into the lough. It further reduces to about 1.5kn at Dunnyneill Islands at J547-539, a further 3km northwest. The E coast of the lough has a lot less of interest to the canoeist than the W due to the lack of islands etc. However, at ‘The Dorn’ at J593-568, there is a reasonable tidal flow from an enclosed bay of up to 2.5<em>kn</em>, especially on the ebb and a spectacular marine waterfall about an hour to two after high water. Chapel Island at J562-513 and Jackdaw Island at J557-510 are the first to be reached when paddling W out of the Narrows. In the spring, Jackdaw is an important nesting site for terns and should be avoided. Many of the islands have large colonies of Irish Hares which can often be seen running along the beach. In the SW corner, Salt Island at J532-500 lies within the Quoile Estuary, and is one of the many islands owned by the National Trust. The Trust has redeveloped a bothy on the SE side of Salt which is an absolutely superb facility for the canoeist looking for a bit more comfort than a tent. The Bothy sleeeps 12, has a woodburning stove, running water and a couple of WCs. Book through the NT.  Camping is also permitted on Salt Island, both at the bothy and at the bay on the west side of the island. To the SW of Salt Island lies the Slaney River where St. Patrick landed in 432 A.D. He must have landed here during HW or he would have had to slog through the stinking mud to reach the shore. He went to Salt and was confronted by the local Chieftain who became Patrick’s first convert to Christianity in Ireland. Heading N from the barrage which protects Downpatrick from tidal flooding, lies Gibbs Island at J509-496 which is one of the few islands within the lough to have trees. There are some mature Scots Pines on Gibbs. Further N, the first major island outside the Quoile estuary is Island Taggart at J533-545. This is one of the largest islands in the lough and used to support two small farms. These belong to the National Trust and are well worth a visit as they show what life on the island was like. Look out for the coffin in the barn! They were also used for the film ‘December Bride’, a story of life in the area in the early 1900s, written by Sam Hanna Bell and there was even a film starring Ciaran Hinds. Foxes, badgers and otters are all resident on Taggart, meriting an overnight camp and exploration. Camping is permitted and most suitable on th north east corner at J536-554. The W side of the lough is a fascinating maze of submerged drumlin hills forming over 100 islands and rock pladdies.  Between Taggart and Mahee Island at J530-636, almost 10<em>km</em> N, lie the ‘basket of eggs’ – dozens of little islands which are excellent for night navigation as they are sheltered and safe. Tides can run at about 1-2<em>kn</em> during springs in a N/S direction between some of the islands and particularly through Ringhaddy Sound at J537-582. Tides Tides can run at about 1-2kn during springs in a north/south direction between some of the islands and particularly through Ringhaddy Sound at J537-582. Pawle Island at J543-571 is a lovely spot for lunch.  There is an old house in the SW tip with the remains of a slip built through the rocks on the beach. From the top of the hill behind the house there is a lovely panoramic view of the S half of Strangford. Islandmore is now inhabited all the year round.  The ‘Blue Cabin’ on the W side of Islandmore at J538-584 is owned and lived in by Michael Faulkner (son of the last prime minister of Northern Ireland – Brian Faulkner) and his wife, the artist, Lynn McGreggor.  The house was always in the Faulkner family but got sold.  Then in the last years of his life, Brian met its then owner when on holidays in the W of Ireland, and bought it back.  It became the family holiday home.  Michael and Lynn moved there after their business went bust, and they fancied starting over in “the good life”.  The house is a former prisoner of war hut from the Isle of Man, that housed German soldiers in the Great War.  It was shipped to Northern Ireland in 1921 after all the huts were auctioned off.  The Blue Cabin is thought to be the only one still intact, no water, no electricity, “period”. Their remote house and its owners are the subject of books, television programs, and endless internet activity.  Nothing is reliably known about their tolerance for visitors, if any. Between Islandmore and Ringhaddy lies the interesting wreck of the “<em>Alastor</em>” in 10 – 15<em>m</em> maximum depth.  She went down in 1946 as a result of an accidental fire on board, but is still good for diving.  She was at the time wrongly identified as the “<em>Alisdair</em>” and forgotten.  Then in April 2004 QUBSAC adopted her as the subject of an experiment to test the efficiency of a new underwater measuring tape.  The results were all over the place, to the extent they had to conclude there was some mistake.  The <em>Alastor</em> was eventually correctly identified.  Until commandeered in WW2 by the Royal Navy for active service, it had been the pleasure yacht of Sir Thomas Sopwith who designed the Sopwith Camel bi-plane of the Great War and the Hawker Hurricane of WW2 (that actually won the Battle of Briton, and not its iconic cousin the Spitfire – the Hurricane being faster than the Mescherschmitt 109, speed then as now being everything).  Later the <em>Alastor</em> belonged to the Shelley family (as in Percy Bysshe, composer of Ozymandias, and Mary Shelley inventor of Frankenstein).  Now the wreck belongs to the Faulkeners of Islandmore. Green Island Rock at J545-602 is a haul out for Common Seal and is very accessible to allow a group of novices to experience the observation of seals in their habitat. Care should be however be taken to avoid any disturbance. To the W and N of Rainey Island at J527-630, there are two channels where the tide runs either side of the island at up to 5<em>kn</em> in its rush to fill or empty Reagh Bay to the NW. Again, this is an excellent area for introducing novices to moving water. HW in the area is at approximately HW Dover +0220. Mahee Island has an early Celtic Monastery on the W side, and the island is definitely worth a visit to walk round the monastic ruins. The monks are believed to have occupied the area from the 5th to the 10th Centuries. There is a great view from the top of the monastery hill.  Recently there was a discovery of early Celtic fish traps in the N facing cove on the W side J525-637 (where easiest to land), but these are only visible at LW. The area NW of Mahee Island holds little of interest to the canoeist, unless you’re into mud wrestling in a big way, as large expanses of mudflats cover the area. The NW mudflats do support vast numbers of waders. During the winter, the statistics of birds using the lough demonstrates the international importance of Strangford as a wildlife sanctuary: Swans 290+ Geese 13,500+ (including 1,300 Pale-bellied Brent Geese, more than 75% of the world population) Ducks 9,000+ Waders      50,000+ Chapel Island – J555-675.  There are ruins of an old church in this island and it is a bird sanctuary.  It is accessible at all tides and has a remote feel although close to the E shore.  It is owned by the NT and shouldn’t be visited in the breeding season. The lough has areas renowned for their beauty or scientific importance and legislation protects this valuable and unique area. Access is unrestricted in the lough and conservationists rely heavily on the goodwill of recreational users. The National Trust has produced ‘The Castaways Code’ and map for those using the lough for recreational boating. This should be consulted before paddling in the lough during the nesting season (April-June) and the islands marked ‘Birds Welcome’ should be avoided.</p>\n","costalZone":"**The North East**"}