{"name":"**Muck Island**","nameHtml":"<p><strong>Muck Island</strong></p>\n","safeName":"Muck-Island","coordinates":{"irishGrid":{"sheet":"D","eastings":"465","northings":"025"},"fullIrishGrid":{"sheet":"","eastings":"346500","northings":"402500"},"tmcGrid":{"sheet":"","eastings":"746420.119","northings":"902490.215"},"geo":{"lat":"54.84881873","long":-5.71992556}},"cursor":5132,"description":"<p><strong>Muck Island</strong> D465-025          Sheet 9 A medium sized island, about 1km N/S, located 300m off the mainland near the beautiful little harbour of Portmuck at D460-024. The island is interesting and has a nice mixture of wilderness habitats. Coastal grasses dominate the central part and the island rises steeply from W to E. There is a beach of mixed sand and shingle on its western side and a rocky bar extends shorewards off its southern point. This dries and is a problem for kayakers attempting to pass inside, especially at LW, when it is possible to walk out to the island. The island increases in height on its eastern flank to give quite attractive steep basalt sea cliffs and holds breeding populations of Puffin, Kittiwake, Razorbill, Black Guillemot and Guillemot. Three small rocky stacks lie off the northern end. The Ulster Wildlife Trust owns the island and information signs on the mainland do not encourage visitors. A strong tide race runs off the southern end of Muck at about 5/6 knots and can produce some great standing waves and broken water. Muck Island is off Island Magee which, despite its name, is not an island. However, it does have some excellent paddling, particularly in the section known locally as ‘The Gobbins’. The best part starts after Heddles Port at D479-991 and continues to Hills Port at D485-972. It boasted a great Victorian walkway, the remains of which are still visible from the sea. Unfortunately it was closed years ago due to disrepair. There are also seven caves in this section. <strong>County Down</strong></p>\n","costalZone":"**The North East**"}