{"name":"**Portballintrae to Dunseverick**","nameHtml":"<p><strong>Portballintrae to Dunseverick</strong></p>\n","safeName":"Portballintrae-to-Dunseverick","coordinates":{"irishGrid":{"sheet":"C","eastings":"930","northings":"424"},"fullIrishGrid":{"sheet":"","eastings":"293000","northings":"442400"},"tmcGrid":{"sheet":"","eastings":"692932.061","northings":"942381.596"},"geo":{"lat":"55.21988365","long":-6.53948915}},"cursor":1664,"description":"<p><strong>Portballintrae to Dunseverick</strong> C930-424 to C999-447    Sheet 5 The rocks between the harbour and Bushfoot Strand can be fun at HW. On passage however, give them plenty of clearance. Stay at least 200<em>m</em> clear of the E harbour entrance to avoid a boomer called the Blind Rock. Bushfoot is named for the River Bush which flows in here at the SW corner. Upriver 2<em>km</em> is the town of Bushmills, famed globally for its Black Bush whiskey. The beach tends to surf and should be used with caution. After rain, a brown tongue of water enters the sea and what happens to it is a good guide to what the tide is doing just then. The E part of the beach is irregularly rocky and not a good place for small boats. There is a small slip below Runkerry House at C934-435. The coastline eastwards is the Giant’s Causeway section. It is committing and there are no easy landing places. It is also one of the most beautiful sections of the entire Northern Ireland coastline. Just SE of the off-lying rock, the Mile Stone at C934-440, is the massive and beautiful Runkerry Cave at C935-439, complete with boulder beach and long dry passage. There are other caves hereabouts, most notably in a small cove 0.5<em>km</em> E of Runkerry called locally Portcoon, with a dry side entrance. There is a slip in Portnaboe, the last cove before the Causeway proper. Visitors once walked from this point, before the access from above was organised. The Causeway section itself is 5<em>km</em> around Benbane Head (C965-461). There are many exposures of geological features; dykes, sills and the various layers of volcanic activity are easily seen. The Causeway itself and all the related geology are far better seen from seaward. In strong offshore winds there are vicious down draughts and each of the bays can funnel the wind to strong gusts. Formidable tides run off Benbane Head and great seas can build up off it and off Bengore Head 1<em>km</em> E. The Spanish Armada The tragedy of the <em>Girona</em>, wrecked at Lacada Point C952-455, was that it was the most seaworthy of several ships that sailed on 16<sup>th</sup> October 1588 from Killybegs for Scotland. 1300 were drowned, including members of most of the noblest families in Spain. The remains of the wreck were discovered c1967 by a team of divers and a great number of artifacts including many many trinkets and jewellery did survive in the cracks and crevices off the Point, as well as cannons, cannonballs and other memorabilia which are now in The Ulster Museum in Belfast. Port Moon Port Moon at C979-451 on the E side of Contham Head C978-4456 is a natural small boat harbour among low rocks at the base of a 60<em>m</em> cliff. A bothy with a rusty roof marks the spot to the passerby, as do the salmon net poles around it, when close in. The bothy is presently the subject of a renovation programme which should be finished by summer 2011. The gut is 100<em>m</em> by 8<em>m</em> and there are rings on either side for shorelines. The port enjoys 1.5<em>m</em> LWS at the outer end. Landing is possible onto a sheltered but rough and stony shore/slip. Camping is nearby on grass, and there is even a stream. It has the remote feel of an island, despite a steep zig-zag path up the cliff to the public Causeway Coast Path. The coastline eastwards towards Dunseverick Castle falls away, but is bouldery. There is a small, well-sheltered harbour near Dunseverick at C999-447, about 1<em>km</em> E of the castle ruin, with a small maritime museum and good enough parking. Camping is possible here but forbidden, except in emergency. There are some lovely rock pools just W of the harbour, suitable for swimming and diving. This carpark has saved many a kayaker a long trip (E/W) if the weather breaks. Leaving a car at Dunserevick on a coastal passage is recommended.</p>\n","costalZone":"**The North East**"}