{"name":"**The Skerries – Portrush**","nameHtml":"<p><strong>The Skerries – Portrush</strong></p>\n","safeName":"The-Skerries-–-Portrush","coordinates":{"irishGrid":{"sheet":"C","eastings":"875","northings":"427"},"fullIrishGrid":{"sheet":"","eastings":"287500","northings":"442700"},"tmcGrid":{"sheet":"","eastings":"687433.304","northings":"942681.552"},"geo":{"lat":"55.22358133","long":-6.62578557}},"cursor":1184,"description":"<p><strong>The Skerries – Portrush</strong> C875-427          Sheet 4 These rocky islands lie about 2<em>km</em> NE of Portrush. The islands are basalt and the N side is ‘steep to’ and usually has unsettled sea conditions as the tide and swell often work in opposition. They are mostly grassy and low on the S side. Strong tide races set between the islands and associated rocks to their N. The sheltered S side is usually settled, and the best landing on the large skerry is towards the E end where there is almost a gap in the island. The Skerries are privately owned so get permission to land from Mr Metson in Portrush at 028 70857412, especially if intending to camp. There is a small brackish lake on the large skerry. Large numbers of birds nest and some rabbits survive. The best embarkation point is at Portandoo Harbour at C857-412 on the NE part of the headland, which is well sheltered. The rocks S of the harbour are a nature reserve and of interest to the geologist for its ammonite exposures. There are Grey Seal and a small colony of Common Seal. The Storks at C897-425 are rocks lying 2<em>km</em> ESE of the Skerries, and 1<em>km</em> NNW of Dunluce Castle. They are marked by a tall, unlit red beacon. Fishing is good hereabouts. Tides</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"251\"><strong>Skerries Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"170\">6:00 before Belfast HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"170\">1:00 after Belfast HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>On the east-going flood, there is an eddy between Curran Point at C875-411 to Reviggerly at C855-415. HW Portrush is 4:40 before Belfast HW.</p>\n","costalZone":"**The North East**"}