{"name":"**Aranmore Island**","nameHtml":"<p><strong>Aranmore Island</strong></p>\n","safeName":"Aranmore-Island","coordinates":{"irishGrid":{"sheet":"B","eastings":"685","northings":"156"},"fullIrishGrid":{"sheet":"","eastings":"168500","northings":"415600"},"tmcGrid":{"sheet":"","eastings":"568458.861","northings":"915588.295"},"geo":{"lat":"54.98690785","long":-8.49280586}},"cursor":138797,"description":"<p><strong>Aranmore Island</strong> B685-156          Sheet 1 Mostly known more simply as ‘Aran’. The island is mountainous at 227m high and about 6.5<em>km</em> square, the largest island off Ireland not connected by bridge. Day trippers can enjoy a circular walk called Siúlóid Aran Mhóir, almost entirely on roads and good bog tracks and rivals the necklace walk on Great Blasket. The island has a stable and prosperous population of about 650, considerable by island standards. Landing and Camping The main landing is onto a sheltered sandy beach in front of the main village, midway up the E coast. The strand is bounded on the N side by two piers and on the S by a gentle point, where there is excellent camping near the new school, beside a football pitch. The more northerly pier is the busy ferry pier. In normal conditions, land at the extreme S end of the beach at B685-156, from which there is a very short carry. The best landing in N winds is at the N end, in the shelter of the smaller, S pier. This avoids the surf farther down the beach but carrying to camp is then a problem. Water in the village. The S end of the beach is the best semi-private camping convenient to everything. Remoter camping exists elsewhere as described. Accommodation and Services A many-times-a-day ferry services the island with a sheltered run from the mainland at Burtonport. The ferry runs punctually during peak (usually summer) times but less so in the off-peak. The car ferry can take up to 8 cars, is regular and well run. Information can be had from Annie Bonner at 074 9520532 who also runs a restaurant and B&amp;B on Aran at the pier. There is a hostel by the beach which also appears well run, 074 9520515. Glen Hotel is just above the beach for those seeking comfort at 074 9520505. Circumnavigation From the paddler’s point of view, the entire W side is challenging. Great cliffs reflect huge waves, especially at the steeper cliffs and mighty headlands. There would often be no real stopping point between the two waystops midway on the S and N coasts next described. That involves 14<em>km</em> of committed paddling on the outside stretch. With ‘pottering’, allow almost 20<em>km</em> around the whole of the island altogether. Factor in the foul ground off the SE corner and this adds up to an achievable yet demanding circumnavigation. Some say it yields some of the finest seakayaking in Donegal, where the competition is plentiful.  Certainly it contains a real wealth of riches – with a tremendous variety of caves, arches and stacks to explore.  It deserves two days if the weather is favourable.</p>\n","costalZone":"**The North-West**"}