{"name":"**Ardboline Island**","nameHtml":"<p><strong>Ardboline Island</strong></p>\n","safeName":"Ardboline-Island","coordinates":{"irishGrid":{"sheet":"G","eastings":"550","northings":"444"},"fullIrishGrid":{"sheet":"","eastings":"155000","northings":"344400"},"tmcGrid":{"sheet":"","eastings":"554961.1","northings":"844403.548"},"geo":{"lat":"54.34632753","long":-8.69271373}},"cursor":129322,"description":"<p><strong>Ardboline Island</strong> G550-444          Sheet 16 A small island 1<em>km</em> outside and to the W of Horse Island, taller, with steep sides, and altogether more substantial. The central plateau has steep sides, is ungrazed and is given over to nettles. Camping would ordinarily be entirely out of the question. Around the edges are sloping limestone pavements, wider on the seaward side. Marvel at the remains of part (mostly propeller shaft and housing) of a 248 ton iron steamer lodged near the SSW tip, said locally to have been driven deliberately on shore, successfully saving the crew. Local lore is that the captain was from Sligo, knew the ground, and in a rising gale, drove the ship up on the island, because he knew he could. Objectively, it is known that the ‘Sligo’ sank here on 5<sup>th</sup> February 1912, carrying coal inward to Sligo from Garston. Public records show that Captain Devaney and his crew of 13 escaped ashore from a ladder at the bow at LW. Worms up to half a metre long are fossilised in the rocks around the island, some quite raised by erosion. SPA Internationally important numbers of Barnacle Goose in season. Landing and Embarkation Landing is quite challenging, especially at HW. The island is sausage shaped lying NNE/SSW. Landing will always be entirely unappealing on the outside due to permanent swell. A deep water landing may be had at a choice of spots along the inside. At lower water there may be available storm beaches, simplifying things. Embarkation is easiest from the N side of the horseshoe bay, 1.5<em>km</em> to the NE at G564-456, called locally Ballyconnell West. Yellow Strand to the E has no easy vehicular access.</p>\n","costalZone":"**The North-West**"}