{"name":"**Glenlough Bay Group**","nameHtml":"<p><strong>Glenlough Bay Group</strong></p>\n","safeName":"Glenlough-Bay-Group","coordinates":{"irishGrid":{"sheet":"G","eastings":"568","northings":"908"},"fullIrishGrid":{"sheet":"","eastings":"156800","northings":"390800"},"tmcGrid":{"sheet":"","eastings":"556761.121","northings":"890793.645"},"geo":{"lat":"54.76327487","long":-8.67184657}},"cursor":133309,"description":"<p><strong>Glenlough Bay Group</strong> G568-908          Sheet 10 Firstly, there is a group of three stacks in the E part of the 1<em>km</em> wide bay.  Access by land to the beach is not easy.  From Port follow the cliff top path N for approx 3<em>km</em>. Once you pass the Tormore viewpoint G557-906, continue to follow the cliff tops as they descend along Glenlough Bay. At G567-904, descend to the wide gully immediately to the SW of the large ominous looking buttress. Follow the stream down this gully until approx 70m above the sea, traverse NE for 50m and descend the scree slope to the beach, directly below the ominous buttress. The largest middle stack is the easiest to climb in the technical sense.  The WSW stack is technically difficult, but the small 30m ENE quartz tower is magnificent, extremely serious, technically hard, and it is reported that a fall from the last 12 metres, consisting of the summit ridge, would be fatal. Secondly, at G573-916 about 1<em>km</em> NE, just 250m past the headland 500m N of the Glenlough River, lying one third of the way from Tormore to Gull, there is a fine 60m twin headed stack.  A very atmospheric gothic sea channel separates the stack to landward. Land on its SW side and climb easily to the W summit.  The E summit is much more difficult of access.  Much loose rock and certain death await those who fall from here. In between, there is also a land seacliff crag at G569-911, a hanging slab of immaculate quartz, that sits at the tip of the headland at the ENE end of Glenlough Bay, about 300m W of the Glenlough River. Access is a short exposed scramble down to the top of the crag.</p>\n","costalZone":"**The North-West**"}