{"name":"**Gola Island**","nameHtml":"<p><strong>Gola Island</strong></p>\n","safeName":"Gola-Island","coordinates":{"irishGrid":{"sheet":"B","eastings":"773","northings":"271"},"fullIrishGrid":{"sheet":"","eastings":"177300","northings":"427100"},"tmcGrid":{"sheet":"","eastings":"577257.094","northings":"927085.79"},"geo":{"lat":"55.09068297","long":-8.35625921}},"cursor":142585,"description":"<p><strong>Gola Island</strong> B773-271          Sheet 1 This is a truly beautiful island, a must to visit. The island is now uninhabited, though the houses show signs of being kept up, and an increasing number of summer homes have been built. Against the national trend, the population grew during the 19<sup>th</sup> century, rising from 70 in 1841 to 200 in 1930. Numbers dwindled after that and it was finally empty by the mid-70s. Unusually, there was never a church on the island. Mains water and electricity were supplied to the island in 2005,a nd there is a public tap 10m from the pier on the E side. In a remarkable feat of co-operation, the water and the electricity were placed in the same trench. A book ‘Gola, the Life and Last Days of an Island Community’ by Aalen and Brody was written in 1969 and a film ‘Terminus’ was made by RTE at the same time. Gola is famed also in song, ‘<em>Báidín Fheidhlimí, d’imigh go Gabhla</em>…’ was about a drowning tragedy involving a Gola boat on passage to Tory. It was written by Felim’s brother, the renowned seanchai of Rannefast in the nearby Rosses.  Two Gola men Patrick McGinley and Charles Duggan are commemorated at Mullach an Aird for having been in the crew of the <em>Asgard</em>, the gun running yacht that armed the Irish Volunteers in 1914.  They sailed into Howth in Dublin under Erskine Childers.  The episode made the Easter Rising 1916 possible. Landing and Camping Land at the modern concrete pier and sheltered beach on the E side, the main landing point for the island. The main village, called Portacrin, is on the S side and is exposed to south-westerlies. A number of sandy beaches exist at the SE corner of the island, which provide soft landings in any conditions. There are a number of other landing places available which are sheltered from different sea and weather conditions. A south-facing beach, near the E tip, has good camping on grass by its W end. A storm beach landing is possible at all stages of the tide in Magheranagall Bay at B764-269, the deep indented bay on the W. Camping is possible here but departure may be difficult if the sea gets up. Mains water at houses. 3 Corncrake were heard calling in 2010. Circumnavigation Circumnavigation offers spectacular views of cliffs, arches and caves. Tororragaun Sound on the N side, between Gola and Umfin, can be lumpy at times, being shallow, and a lot of clapotis can be expected on the W side. A tunnel penetrates through the tip of the N side of Magheranagall Bay at its seaward end, which is worth looking out for if there is not too much swell. The entrance is not obvious from either end. Rock climbing Gola has excellent climbing on good granite, more developed than Owey and very popular. Climbs have been put up on the N side of Magheranagall Bay and on the sea cliffs of Mweelmore, the hill S of Magheranagall Bay, facing S towards Owey. There are hundreds of climbs there as of 2010.  The 2002 Donegal climbing guide book edited by Alan Tees and published by the Mountaineering Council of Ireland www.mountaineering.ie in 2002 has all the Gola climbs. Look it up also on www.climbing.ie.</p>\n","costalZone":"**The North-West**"}