{"name":"**Horn Head**","nameHtml":"<p><strong>Horn Head</strong></p>\n","safeName":"Horn-Head","coordinates":{"irishGrid":{"sheet":"C","eastings":"012","northings":"423"},"fullIrishGrid":{"sheet":"","eastings":"201200","northings":"442300"},"tmcGrid":{"sheet":"","eastings":"601152.131","northings":"942282.364"},"geo":{"lat":"55.22773174","long":-7.98189035}},"cursor":147703,"description":"<p><strong>Horn Head</strong> C012-423          Sheet 2 The mainland coastline from Bloody Foreland to Horn Head (Sheets 1/2) is mostly sandy beaches. Horn Head is a local ‘big’ paddle, well worth the shuttle for its magnificent coastal features on a grand scale. Other than as mentioned below, the paddle is a non  stop 15<em>km</em>. Pollaguill Bay at B990-388 is the obvious rest-stop enroute, midway between Horn Head and the Back Beach, about 4.5<em>km</em> from each. Also, less obvious, though dependable in all but bad W/NW winds, is a well sheltered storm beach in a deep west-facing cut, 1<em>km</em> SW of Horn Head itself at C006-413. From here, there is at least the theoretical possibility of human escape (in dire emergency) up the tall cliffs of Coastguard Hill, which lean back slightly in the gully. This storm beach probably represents a more convenient way stop for those on more serious passages. <strong>Shuttle</strong> Put in or out on the W side at a beach unnamed on the map but known locally as the ‘Back Beach’ at B948-350 (Sheet 1). Turn N off the main coast road 1.5<em>km</em> E of Falcarragh, following signs for ‘Trá’, eventually to a good car park where the River Ray flows into the sea. This beach involves a carry and may surf. Better perhaps to start on this side, to be disappointed before, rather than after, a long paddle. If it is surfing badly, try Magheraroarty Pier further W at B889-333. A last resort option might be Ballyness on the E side of Ballyness Bay at B923-336, NW of Falcarragh, but watch the bar on the way out. On the E side, there is a good, sheltered, dependable ‘in  all  conditions’ pier C047-372 near Portnablagh, 3<em>km</em> E of Dunfanaghy, just off the main road. Tides A sustained lump may be expected, as this is a significant headland, so avoid any wind over tide. The Round of Horn Head is thus perhaps best done W to E on the flood in calm or light westerlies. Tides are as Tory Sound, ENE from HW Galway   0350 to +0235. This is half an hour ahead of the main west coast tidal stream, or a couple of hours behind the rise and fall by the shore. SPA Peregrine, Chough.</p>\n","costalZone":"**The North-West**"}