{"name":"**Inch (_Inis_) Island**","nameHtml":"<p><strong>Inch (<em>Inis</em>) Island</strong></p>\n","safeName":"Inch-(_Inis_)-Island","coordinates":{"irishGrid":{"sheet":"C","eastings":"310","northings":"265"},"fullIrishGrid":{"sheet":"","eastings":"231000","northings":"426500"},"tmcGrid":{"sheet":"","eastings":"630945.552","northings":"926485.449"},"geo":{"lat":"55.08484598","long":-7.51531905}},"cursor":148815,"description":"<p><strong>Inch (<em>Inis</em>) Island</strong> C310-265          Sheet 2/6 Situated at the head of Lough Swilly, Inch is now attached to the mainland due to extensive drainage and reclamation works on the SE side. Inch can be accessed by two-lane roads, and lacks all island feeling. There are even small housing estates.  The population is about 350 but there is no village, pub or shop. The whole SE of the island is an extensive farm that featured infamously some years ago in a major legal battle during the 1980s depression. Its owners were evicted by a bank for failure to meet mortgage repayments.  The channels along the S and NE sides dry at lower tide levels to reveal extensive ‘<em>glár’</em>, a local term for unpleasant grey knee-deep silt. Only enter these channels on a rising tide! The SE ‘channel’ contained within a barrage at each end is actually a fresh water lake, constantly pumped out to keep the salt water at bay. Circumnavigation is therefore impossible. Only the W side has any real interest to small boats. The highest point on the island is Inch Top in the NW at 222m high, a pleasant walk. At the extreme S tip of the island lies Inch Castle, now in ruins. Built about 1430 by Neachtain O’Donnell for his father-in-law, Cahir O’Doherty, who jailed a rival chieftain Dónal O’Donnell in it. O’Donnell managed to escape and take over the castle, but in 1454 his enemy Rúairí O’Donnell laid siege to the castle and tried to burn him alive in it. The remains of Inch Fort, a later fortification, are at the extreme N tip. Embarkation By road, a left turn off the R238 from Letterkenny towards Buncrana, after the village of Burnfoot, C358-248. From the E side of Swilly at a small pier near Fahan C334-267 near the sailing club. From the W side of Swilly at Rathmullan pier C299-277 or the beach beside it. Landing and Camping Land at the island pier, C310-265 at the NW of the island. Some occupied houses make the limited camping above the small beach at the pier a bit public. Inch Fort is nearby. Whooper In winter there are Whooper Swans on the lake area a-plenty, this being the Irish landfall in autumn for the entire wintering Irish population.  Counts of 2,000 occur.  Greenland White-fronted Geese also occur in numbers. Sandwich Tern breed in summer. Otter may be found on the island.</p>\n","costalZone":"**The North-West**"}