{"name":"**Inishsirrer**","nameHtml":"<p><strong>Inishsirrer</strong></p>\n","safeName":"Inishsirrer","coordinates":{"irishGrid":{"sheet":"B","eastings":"785","northings":"300"},"fullIrishGrid":{"sheet":"","eastings":"178500","northings":"430000"},"tmcGrid":{"sheet":"","eastings":"578456.869","northings":"929985.165"},"geo":{"lat":"55.11678486","long":-8.3376851}},"cursor":143543,"description":"<p><strong>Inishsirrer</strong> B785-300          Sheet 1 3<em>km</em> N of Gola, Inishsirrer is the most northerly of the chain. Inishsirrer is a most attractive island, formerly inhabited (abandoned 1943), but now only occasionally. The village is SE of the middle of the island. No drinking water found, the lake E of the village is brackish, but contains good cockles. Many deserted houses, old fields, paths and walls. A walk to the automated lighthouse in the NW is worth the effort, as this end of the island has quite an ‘oceanic feel’ to it. SPA Barnacle Goose, Tern, Chough, Corncrake. Landing From the SE end of the island a boulder-strewn spit juts out E, ending at a prominent rock, Damph More. On passage from the S, at LW it is necessary to keep close to the mainland, E of Damph More. Only cross the Damph More spit at HW, with care. There is a landing point by a pier/slipway at B791-297, just N of the spit. At LW when the slip is too high to use, the landing is onto boulders/sand. A more secluded landing point can be found in a bay at B782-306 on the SW- facing side, the first bay SE of the NW tip. This is near the highest point of the island and onto a storm beach, and drying shoals at the entrance can be a problem in south-westerlies. Also, at HW, a landing may be had just further SW at B784-304 in a sheltered inlet just NW of halfway along the SW side, at a place called locally Slodanawaud. Here there is a rusty windlass and a ruined boathouse, but beware that Slodanawaud is a tidal  pond which forms on the lower half of the tide and may trap your escape.</p>\n","costalZone":"**The North-West**"}