{"name":"**Inishmurray**","nameHtml":"<p><strong>Inishmurray</strong></p>\n","safeName":"Inishmurray","coordinates":{"irishGrid":{"sheet":"G","eastings":"580","northings":"539"},"fullIrishGrid":{"sheet":"","eastings":"158000","northings":"353900"},"tmcGrid":{"sheet":"","eastings":"557960.529","northings":"853901.505"},"geo":{"lat":"54.43192054","long":-8.64792785}},"cursor":129603,"description":"<p><strong>Inishmurray</strong> G580-539          Sheet 16 About 6<em>km</em> WNW of Streedagh Point G632-514, this is a lovely, remote, low-lying, formerly inhabited island, with a most interesting history both ancient and recent. Its monastic ruins are excellent and worth the visit in themselves. A row of fairly recently abandoned houses lines the SE side above the unsatisfactory pier/slip. Fields, bog, lake and scrub comprise the rest. The NW point has interesting small cliffs and passages. Tides Local HW Galway +0040. Tidal movements are not strong. Embarkation Inishmurray lies about 6<em>km</em> WNW out from the nearest and most common embarkation points, either side of Streedagh Point G632-514. Choose depending on conditions between the NNW-facing beach at G637-510, and a smaller SW-facing beach at G631-502. Otherwise the position is a bit more complex. By far the most convenient embarkation place for bigger boats or larger groups of kayakers is the harbour at the village of Mullaghmore at G709-576, about 15<em>km</em> ENE from the island. Here there is parking and dependable shelter. There are several other possibilities, first amongst which is 7<em>km</em> S of the island, at Ballyconnell North, a N-facing beach at G566-462, where reasonable parking for a handful of cars. Landing From the S/SE direction, there is a roofed building prominently visible at the E end of the island. This is the schoolhouse, which lies just above the pier wall. The shoreline generally is slippery boulders and slab. Landing with kayaks can be difficult, even at the pier wall, which is not very sheltered and distinctly open to the SE. The village is a single line of houses just above the shore just W of the schoolhouse. Landing can also be had further W on the S side in the often more sheltered deeply indented coves at G571-537, W of the village, onto rocks. This spot, though sheltered, is more suited to boats that can be tied or anchored, such as dinghies or ribs where one can hop or step onto rock. For those overnighting, a landing here leaves a good distance to carry gear to the better campsites near the schoolhouse. Camping and Water No drinking water was found though there is a lake in the centre. Camping is perhaps best at the schoolhouse. Wildlife The Eider and Common Scoter ducks are sometimes found here in summer. This was until recently considered almost the most southerly breeding area of the Eider. Local History Of special interest on the island is the monastic ruined settlement, founded by Columba in 550 AD. It is inside a Bronze Age fortification, the walls of which were once about 4.5m high. They are now half that, having been restored in 1880. The enclosure of cells, beehives, churches, altars, and carved stones, which in themselves make the island a must for a visit, are in better condition after 1400 years than the village houses after 100. The men-folk of the island were buried inside the enclosure and the women outside, at Teampalnamban about 150m distant.There are cursing stones here, five <em>Clocha Breacha</em>, capable of cursing ones enemies. The cursing stones have recently been removed by the OPW and are kept in the old school house. You may be lucky and be on the island when the OPW are working there and get to see the stones. The island was pagan until Columba built a new monastery inside the fort and installed St. Molaise as Abbot. The monastery obtained fame almost immediately. Columba, back on a visit, borrowed a book from the library. Without telling Molaise, he copied it. A furious Molaise demanded the return of the copy. Denied, he appealed all the way to the High King, Diarmuid, who was then like the Supreme Court is today. His judgement was ‘to every cow its calf, to every book its copy’, probably the first ever recorded copyright decision in Western Europe. Worse was to come. Columba still wouldn’t return the copy. Diarmuid, feeling he was being challenged, set out westwards with an army of 3,000 to punish Columba and his followers. Columba resoundingly beat the army of the high king near Culdrennan outside Sligo, with the loss of all his men. Columba was upset by all these unanticipated downstream consequences of his thievery. He relented, and presented himself on Inishmurray to Molaise in confession. As penance, Molaise banished Columba to Scotland, never to return until he had converted to Christianity as many pagans as the 3,000 killed in the battle. Columba sailed, and didn’t settle until he could no longer see Ireland. He landed at Iona, and there founded his greatest ever monastery. He never returned to Ireland. The Vikings raided Inishmurray in 795 and 802, and the Black and Tans in 1921. In 1915, a British warship, mistaking the island for a submarine, torpedoed it. It is thought the fort was mistaken for a conning tower. The islanders were shaken but not stirred. The island was infamous for <em>poitín</em> making. There being no natural embarkation point for access to the island, and no easy landing, visits by the authorities were few. This enabled the undisturbed islanders to distil the best illicit whiskey in the country, marketed as ‘Old Inishmurray’. When the Revenue officials did come, they had to hire boats locally and word would escape. Then, in the absence of any one truly sheltered landing spot, it seems it was always necessary for the local boatmen to circle the island looking for the easiest landing place. The illicit brew was normally well hidden by the time anyone got ashore. The school was built in 1889 when there were 102 people living here in 15 houses. There were only 46 in 1948 when the last people left. The islanders were renowned for a combined rowing/sailing technique unique in Ireland which made them the safest, fastest and bravest sailors around.</p>\n","costalZone":"**The North-West**"}