{"name":"**Inishkeeragh**","nameHtml":"<p><strong>Inishkeeragh</strong></p>\n","safeName":"Inishkeeragh-42","coordinates":{"irishGrid":{"sheet":"B","eastings":"685","northings":"125"},"fullIrishGrid":{"sheet":"","eastings":"168500","northings":"412500"},"tmcGrid":{"sheet":"","eastings":"568458.827","northings":"912488.956"},"geo":{"lat":"54.95906291","long":-8.49246557}},"cursor":134962,"description":"<p><strong>Inishkeeragh</strong> B685-125          Sheet 1 1.5<em>km</em> S of Aranmore. This is a fine island, not to be lightly missed. The main street is immediately along the beach on the N side.  There is now a substantial pier.  Several house are being rebuilt, some already have and there are even some brand new log houses. View the remarkably located schoolhouse to W.  Apparently none of the islanders wanted it closer to the village as the land was too valuable to them. Winter storm waves rolled across much of the W side.  Thus the better land in the middle and E was too valuable to sell for a school.  That was a standard way of looking at things since Adam and Eve were children.  One wonders what they would make of EU “set aside”?  Peadar O’Donnell taught here. The island was abandoned by its 10 families in March 1955, when their numbers suddenly dipped below a tipping point and there weren’t enough hands to share the harder work of hauling boats to safety, cutting turf etc.  “<em>Inniscaorac – My Account</em>” privately published 2008 by former resident Susan O’Donnell tells the story in detail. Landing and Camping Land easily at E end of the N side onto a gravel beach, or on the ESE side of the island, on N side of the projecting Portnamweela, where there is a sandy beach, and once the island well. There is good camping by the ruined houses on short sheep-grazed grass. Good water is to be had in a well, found behind ‘main street’ along the north side. N.B. Wells need use, so you may need to clean it out and let the sediment settle before you take water from it.  The islands used this well for all purposes other than drinking as the water contained too much iron, and they preferred a number of wells on the E side, or even trapped rainwater. SPA Barnacle Goose, Tern. Also, Brent Goose, Eider, Greylag, Shelduck and Lapwing seen in May 1999. 3 Corncrake were heard calling in 2010.</p>\n","costalZone":"**The North-West**"}