{"name":"**Inishcoole**","nameHtml":"<p><strong>Inishcoole</strong></p>\n","safeName":"Inishcoole","coordinates":{"irishGrid":{"sheet":"B","eastings":"800","northings":"244"},"fullIrishGrid":{"sheet":"","eastings":"180000","northings":"424400"},"tmcGrid":{"sheet":"","eastings":"579956.482","northings":"924386.345"},"geo":{"lat":"55.06654696","long":-8.31378517}},"cursor":142055,"description":"<p><strong>Inishcoole</strong> B800-244        Sheet 1 Island of history and mystery, known locally as Skull Island, with good reason.  Cut off from Derrybeg Beach in Magheraclogher Bay on the E side of Gweedore Bay, in front of the big hotel for only for a couple of hours either side of HW, it is a lovely spot.  Land onto a beach on the N side. Otter.  Well worth the effort for the peace at HW. Spanish Armada In 1901 a group of Dublin archaeologists found a mass grave of Formorians, ancestors of the modern Gael, which had become disturbed by rabbits, exposing the remains of the long dead.  The bones were carbon dated to 3,000 years before present but the real mystery was the great assortment of bones of young men buried nearby with vastly different bone structure, and of a much later vintage altogether, late 16<sup>th</sup> century. They had accidentally stumbled upon the burial site of most of the soldiers and sailors of <em>La Juliana</em>, an 860 ton Spanish grain carrying merchantman pressed into service for the great invasion of England 1588.  Italian, it was impounded into the Levantine Squadron of the Spanish Armada and given large poopdecks for the comfort of the officers, besides 32 cannon and 1,600 cannonball as ballast.  Sailing was difficult under benign conditions, treacherous otherwise.  It was one of four such vessels that went down on 28<sup>th</sup> September 1588.  La Juliana foundered SW of Gola with great loss.  Two utility boats were launched.  Two soldier captains and a troop of soldiers made Maghernagallon Bay on Gola in one, and six of the original unknown complement of the other (with the ship’s treasure chest) made Inishcoole. 20 or so was all of the 70 Italian crew and 325 Catalan solidiers to survive.  Three other boats perished similarly, only one reliably named, the <em>Santiago</em>.  Rumours of buried treasure on Inishcoole, Gola and the mainland are not uncommon. This was but one of many such tragedies.  In retreat homewards that autumn, many ships of the great Armada sank, 39 off Ireland, 10 off Scotland (4 in the E, 6 in the W), and 2 up in Shetland. The tale received value added when Robert Louis Stevenson came to honeymoon in Bunbeg in late 1880.  An autumnal gale shifted a lot of sand about the place, revealing some valuable commodities.  Captivated by the tales he was told of <em>La Juliana</em> and her colourful crew, and other research on the Armada he undertook, he wrote a great work of fiction around them.  The captain had a peg-leg, an eye patch, a crutch, and a parrot sat on his shoulder.  Long John Silver is a composite of two sailors marooned from <em>El Gran Griffon</em> on Fair Isle.  Treasure Island is Gold Island (“Gola”), which prior to 1588 was call McGee Island.</p>\n","costalZone":"**The North-West**"}