{"name":"**Inishillintry**","nameHtml":"<p><strong>Inishillintry</strong></p>\n","safeName":"Inishillintry","coordinates":{"irishGrid":{"sheet":"B","eastings":"737","northings":"218"},"fullIrishGrid":{"sheet":"","eastings":"173700","northings":"421800"},"tmcGrid":{"sheet":"","eastings":"573657.81","northings":"921786.942"},"geo":{"lat":"55.04289959","long":-8.41214966}},"cursor":141413,"description":"<p><strong>Inishillintry</strong> B737-218          Sheet 1 Off the E side of Cruit, this island consists of high heathery separated mounds. Never inhabited. See the fish-holding tanks in offshore rocks off the SE side. A nice sea cave on the N side deserves a look. The grass is a bit long for camping. No grazing. No water. Embarkation and Landing Land in a sandy cove in a cut on the SE side. There is a good embarkation point from a harbour about 1<em>km</em> NW of Kincaslough, where the parking is convenient, and which is sheltered. <strong>Gola Section</strong> This section stretches from Inishfree Lower in the S to Inishsirrer in the N. The generally most convenient embarkation point for all the islands of the Gola Group and certainly for Gola Island is from a pier at B793-266 just N of the entrance to Gweedore Bay. It is the more northerly of the two such piers locally. By road from Derrybeg, go past the football pitch, then the graveyard and then fork right. There is good camping beyond the graveyard along the access road but no water.  There is good parking by the pier, and a beautiful beach. Ferry An all-year-round ferry to Gola is run by Jimmy Sweeney 087 6607003. It leaves from Bunbeg Pier B802-235. The Tory ferry is based here, as the harbour is very sheltered. Nearest provisions are to be had in a shop at the main road, 2<em>km</em> or more from the pier. Full provisions are available in Bunbeg, just S of Derrybeg. Bunbeg harbour is accessible to kayaks at all stages of the tide. There is a hostel 1<em>km</em> up the road from Derrybeg in Magheragallon, 07495 32244. Ensure the tide is with you in the estuary, local HW being Galway +0100. For the N part of the group there is also an excellent pier right opposite Inishmeane at B799-284 known locally as Carrick Pier. Here there is an extensive sandy beach, good camping on machair grassland or in dunes behind the pier, but no water. By road, drive 3<em>km</em> N out of Derrybeg, then (1<em>km</em> N of a significant junction), follow signs left for ‘Beach’, and continue past an enclosed soccer pitch.</p>\n","costalZone":"**The North-West**"}