{"name":"**Inishtrahull**","nameHtml":"<p><strong>Inishtrahull</strong></p>\n","safeName":"Inishtrahull","coordinates":{"irishGrid":{"sheet":"C","eastings":"482","northings":"652"},"fullIrishGrid":{"sheet":"","eastings":"248200","northings":"465200"},"tmcGrid":{"sheet":"","eastings":"648142.204","northings":"965177.02"},"geo":{"lat":"55.43105366","long":-7.23938986}},"cursor":150518,"description":"<p><strong>Inishtrahull</strong> C482-652          Sheet 3 About 9<em>km</em> NE of Malin Pier, Inishtrahull is the most northerly ‘big’ island of Ireland. The passage by kayak takes about one and a half hours. Inishtrahull is a mighty island, about 1.5 <em>km</em> in length E/W and somewhat hourglass shaped. Hills form the E and W ends, joined by a low flat piece of ground where the abandoned village and farmland lie. It is thought monks were here in the early Christian era, but there is no sign now. Uninhabited since 1928, except for visiting lighthouse personnel, there are ruined cottages and lazy beds, and some rabbits. Beside the old schoolhouse there was until recently a huge flat rock with a Maltese cross inscribed, probably a Mass Rock, and which was stolen in 2009. There is at least one grave evident. Geology Ireland’s oldest rocks are to be found on Inishtrahull and the off-lying Tor Rocks. The rocks hereabouts were formed 1780 <em>ma</em> (billion years ago, during the Palaeoproterozoic Age), which is old, apparently. Consider that modern man has walked the earth for only 200,000 years and the last Ice Age occurred only 13,000 years ago. On Inishtrahull and the Tor Rocks, the rocks are known together as the Rhinn Complex and are made up of types of gneiss (pronounced ” nice”), a coarse crystalline metamorphic rock type, whose most identifiable characteristic is the tortured banded textures that bear witness to the enormous forces of burial or shearing to which the rocks have been subjected. Locally the gneiss is termed Augen (german for eye) where lozenge shaped crystals of pale-pink feldspar dominate the rocks fabric. Apparently it attracts a lovely blue-grey luminous lichen.  Syenitic orthogneiss basically means the rock was originally an igneous (magmatic) rock but has been severely buggered up by the subsequent continental barn-dancing The exact same rock types as the Rhinn Complex of Inishtrahull also crop out in the Hebrides, Greenland and Scandinavia. Paradoxically the rocks show no similarity to the deep basement rocks of the nearby Irish mainland. This observation was first noted in 1900 and published in 1930 by W. J. McCalliom, a graduate of Glasgow University. McCalliom grew to doubt his work probably because he could not explain the geographical separation between the apparently related rocks. It wasn’t until the 1960’s that the explanation for the dislocation became available, with the concept of “seafloor spreading”, that provided the mechanism that underpinned the theory of continental drift. Yet the question remained unresolved until 1989 when two geologists researching the gneiss’s of Islay and Colonsay in the Scottish Hebrides stumbled on the McCalliom report and created a paleogeographic reconstruction that proposed a link between Greenland, Islay, Colonsay and Inishtrahull in Palaeoproterozoic times. So now it is accepted that Inishtrahull, Colonsay and Islay broke free of the southern tip of Greenland, all those zillions of years ago.  The other two anchored off Scotland, but Inishtrahull drifted that bit further south to the Donegal coastline. Only two Irish kayakers are known to have visited any two of these locations, but both are working on completing the <em>meitheal</em>. Lighthouse A massive automated lighthouse stands at the west end, 23m high, reinforced concrete, novel in design. It flashes white 3 times every 20 seconds, built in 1958. There is a white accommodation block attached. A disused stub of a lighthouse stands at the east end, built in 1810/1813. It has a very visible base surrounded by large cogs, bits of machinery and derelict living quarters which could provide shelter if stranded. Because of its pivotal position, Inishtrahull Sound is a major route of passage for all sorts of living creatures and Basking Shark and Sunfish have been seen. Perhaps because of the strong tides, no debris is found on Inishtrahull, most unusual for such an island. Fauna In 1994, a herd of 5 Sika deer was brought onto the island, and 4 now remain as of May 2010, all does. They are very shy, and very efficient at keeping out of the way. It is more than possible for a small party never to find them on a visit. In summer 2001, a huge party of 200 or so visited the island for a commemoration. The deer could not evade so many forever, took flight, jumped into the sea, and swam for it. Fortunately, they were spotted leaving by some scuba divers walking about the island. A rescue mission was mounted. By the time they were found, they were two thirds the way to Malin Head. In the rescue efforts, unfortunately one drowned, the only stag. The remaining four were saved, and were returned at very high speed to the Hull. A good news story emanating from Ireland’s scuba people! In 2009 it became apparent to Ireland’s conservators of whales and dolphins that this whole Malin area was a hot-spot for Basking Shark (which actually are fish), and many of the 100+ tagged to try and find out where they go in winter were encountered near the island.  Then in 2010 there was an explosion of population and in a calm weather week in May, 104 were tagged in a frenzy of activity. This shy and elusive species may yet yield up, to technology, a ton of knowledge of its darkest secrets. Simon Berrow became a household name overnight. SPA Barnacle Goose, Peregrine, Arctic Tern, and a significant breeding Eider population. General Area Malin Head, pier, and the very pretty village are all on the well signposted coast road tour around the headland, the Inishowen 100. Malin Head Radio Station (VHF channel 23) has a very positive attitude to interaction with canoeists and a visit is very educational. Embarkation Embarkation is from Malin Pier C423-585 in the small harbour in Slievebane Bay, 4<em>km</em> E of Malin Head. The pier faces the Garvan Isles C436-602 at 2<em>km</em> out to the NE across Garvan Sound and Inishtrahull is 7<em>km</em> further out beyond them across Inishtrahull Sound in the same direction, 9<em>km</em> in all. Park so as not to obstruct fishermen. This recently improved pier supports the fishermen’s co-op for the whole area and is quite busy. Inishtrahull Sound The tides in Inishtrahull Sound itself, reaching about 4<em>kn</em> in Springs, are notorious with wind over tide and are said to get steeper more quickly than in Tory Sound, but are otherwise quite manageable. It tends to cut up rougher just W of the Garvan Isles than to their E. It is strongly advised to keep east of the Garvan Isles, bound inwards or out, in any wind. Landing The most convenient landing on the island is in the waist at the W end of the S side of the island just under the W lighthouse, where a narrow SW-facing cut leads to a jetty and steps, called Portachurry. The landing is said to be a problem as it can be exposed to swell. A much more sheltered landing is also possible in the waist of the island midway along the N side at Portmore. There is a jetty and an impressive 15m raised shingle beach. There is less of a carry at Portachurry. The well at Portmore seems well maintained. Tides</p>\n<ul>\n<li>Local HW is approximately HW Galway +0100.</li>\n<li>Belfast HW is approximately Galway LW.</li>\n<li>Belfast HW is Dover HW -0015.</li>\n</ul>\n<p><em>Tides run strongly, are very complicated, and deserve respect. With wind over tide, the sea sets up steep waves more quickly in Inishtrahull Sound than even in Tory Sound or Rathlin Sound.</em> Tides The tides in Inishtrahull Sound reach about 4kn in springs and are notorious with wind over. They are said to get steeper more quickly than in Tory Sound but are otherwise quite manageable. It tends to cut up rougher to the west of the Garvan Isles than to the east. It is strongly advised to keep east of the Garvan Isles, bound inwards or out, in any wind. At Inishtrahull itself, there is shallow foul ground at the southwest, tidal races flood and ebb at the northwest and the island even boasts a whirlpool off the northeastern corner, a circular eddy that gets ferocious in springs, from an hour after Belfast HW until about 4:30 after. Fortunately, this whirlpool seems always avoidable, as Gull Island at the northeast is navigable inside by very small craft. The stream through Inishtrahull Sound on its southern side runs at full strength to within 3m of the shore off Portachurry and a 300m wide race guards the entrance to Portachurry during all the ebb. The main ESE flood stream passes outside the Garvan Isles, in Inishtrahull Sound itself, for 8 hours as follows:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"424\"><strong>Inishtrahull Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Start Time</strong></td>\n\n<td width=\"173\"><strong>End Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">ESE</td>\n\n<td width=\"173\">3:00 after Belfast HW</td>\n\n<td width=\"173\">1:30 before Belfast HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">WNW</td>\n\n<td width=\"173\">Belfast HW</td>\n\n<td width=\"173\">3:00 after Belfast HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>There is virtually no slack at the start of the flood. There is an hour and a quarter of slack at the start of the ebb, although much less in springs, half an hour. At the Garvan Isles and in Garvan Sound to landward, the position is somewhat more complicated. The mainstream of the flood tide passes further out, through Inishtrahull Sound. Therefore, in Garvan Sound and through the Garvan Isles, the tide never runs with much strength ESE at any time, because of the eddying effect of being bypassed. In for the last couple of hours or so of the flood, the stream eddies back around and runs weakly WNW, from about 3:15 before Belfast HW to approximately Belfast HW. So the inshore ebb stream runs continuously WNW from 3:15 before Belfast HW until 2:45 after. It is stressed though that while it runs relatively weakly while an eddy (say 3:15 before Belfast HW to 0:15 before Belfast HW), it runs very strongly indeed on the main ebb for the rest of the time. The Garvan Isles must (please believe their reputation in this particular regard) be avoided during that period as the streams set strongly through its shallower channels and outlying rocks. To look is enough and do not go there. Best keep well east of them altogether on passage in or out and choose the timing carefully. It might seem soundest to leave the mainland at 1:45 before Belfast HW or so and ferry eastwards for a while against the weakly eddying flood inside the Garvans, until slack water outside the Garvans permits an untroubled trip across Inishtrahull Sound. Returning after multiples of twelve (not six) hours later, depart the island at 0:45 before Belfast HW or so, as soon as it looks right. Then bear up eastwards a little while, traversing the Inishtrahull Sound to be carried westwards home across the Garvan Sound, once close to land. There is also the ‘non-slack’ at about 2:45 before Belfast HW, when the direction of flow changes, they say instantaneously. In calm conditions, bite it. It really must be stressed that in calm conditions, both sounds are quite manageable and timing becomes more a matter of navigation and convenience than safety or necessity. For advance planning of trips, be aware that in neaps, Belfast HW falls during hours of darkness, which can mean usable slack waters force a choice between a return 12 hours later in the dark or 24 hours later, increasing the commitment levels somewhat. Realistically though, it is better to go spontaneously, when conditions invite.</p>\n","costalZone":"**The North-West**"}