{"name":"**Inishfree Upper**","nameHtml":"<p><strong>Inishfree Upper</strong></p>\n","safeName":"Inishfree-Upper","coordinates":{"irishGrid":{"sheet":"B","eastings":"715","northings":"126"},"fullIrishGrid":{"sheet":"","eastings":"171500","northings":"412600"},"tmcGrid":{"sheet":"","eastings":"571458.181","northings":"912588.915"},"geo":{"lat":"54.96014159","long":-8.44564699}},"cursor":135368,"description":"<p><strong>Inishfree Upper</strong> B715-126          Sheet 1 2<em>km</em> SE of Aranmore, at the mouth of Dungloe Bay. Large interesting island worth exploring. Homes on the NW apparently result from recent settlement by English and Welsh families, one permanently occupied by a saxophonist from 1991 to 2013. The island was electrified August 2000. The island is developing a tradition in art that yet may rival Tory. The shipwreck of the ‘Mallrin’ is to the W. There is tidal peat with bog oak (some say giant cedar?) in the baylet W of the S point at B714-114. The old schoolhouse is at the E end of the island. Landing and Camping Land easily on sheltered sandy beach just SW of N point of island, where there is a slipway, if preferred. The landing point is backed by machair that is friendly to camping. Cows grazing. No water found. You may land and camp also at a beach to the SW at B711-114.  2 Corncrake were heard in 2010. Tides Tides flood strongly E past the N point. Peadar O’Donnell Peadar O’Donnell (1893 – 1986) taught for many years. Born and bred in nearby Dungloe, he wrote of island life – ‘Islanders’ 1927 and ‘Proud Island’ 1975. He also dealt with his political phase in ‘The Gates Flew Open’, a reference to his escape from internment as a Republican during the Irish Civil War in 1923. He was the leader of IRA militant agitation for land reform in the 1930s. This led to the withholding from Britain of land annuities by the fledgling Irish government of the new state. These annuities were due as the repayment (mortgage fashion) of the capital investment in agricultural land made by the Congested Districts Board pre-independence in 1921. The economic war with the UK that followed brought Ireland to its knees. Strangely, when the dispute was settled in 1938, as part of the deal, the UK handed back to Ireland its maritime ports. After independence, Britain had continued to occupy and utilise deep harbour naval facilities at Cobh, Bearhaven and Lough Swilly (Rathmullen). The UK would regret its folly almost immediately, as they could have well done with these ports during the Battle of the Atlantic that followed during World War 2. Ireland could hardly have remained neutral in such a conflict were these ports in British use. One side or the other would surely have invaded. The association of such a remote place with such momentous events is amazing! Notwithstanding his nationalistic background, he was essentially a man of the people. “Adrigoole” in the late 1920s was about a remote crofting family starving to death, that he felt especially appalling in the context of the new Irish state.  He felt it would never have happened under foreign / British rule. He spoke of what he called “human rights” in1932, fully 16 years (and a World War) before Eleanor Roosevelt addressed the United Nations in that regard in 1948. He started the idea that became “The Bell”, an independent and truly important outlet for Irish writers in a time of strict censorship.</p>\n","costalZone":"**The North-West**"}