{"name":"**Inishinny**","nameHtml":"<p><strong>Inishinny</strong></p>\n","safeName":"Inishinny","coordinates":{"irishGrid":{"sheet":"B","eastings":"712","northings":"182"},"fullIrishGrid":{"sheet":"","eastings":"171200","northings":"418200"},"tmcGrid":{"sheet":"","eastings":"571158.308","northings":"918187.725"},"geo":{"lat":"55.0104251","long":-8.45089243}},"cursor":138397,"description":"<p><strong>Inishinny</strong> B712-182          Sheet 1 1<em>km</em> N of Cloch Ghlas, this medium sized island is reachable on foot from mid-tide, and is well grazed by sheep and even a donkey, especially at its E end.  Short cropped grass gives excellent camping.  Lazybeds.  Little bays and big bays yield lots of exploration.  That N facing inside Bent Island at the NE is a natural sheltered harbour for smaller boats.  The W facing harbour in the W is less sheltered altogether.  Common Sandpiper.  Ringed Plover.  Ruin in mid-island. <strong>Aran Sound South</strong> The South Sound of Aran on the E side of Aran is a fearsome place with a high swell, particularly if the swell is from the N. The safest N/S passage goes approximately 200m east of Aileen Reef. Aileen Reef extends SE for 1<em>km</em> from Cloghcor Point at the SE corner of Aran. Boomers may be experienced over the shallows on the E side of the sound at a point E of Cloghcor Pt., off the beach on Rutland. You may also encounter boomers immediately west of the Carrickbealatroha Upper rocks beacon B695-147, which is shown but not named on the 1:50,000 OS map. If you plan to paddle from the village (Leabgarrow) on Aranmore to Burtonport via the S end of Rutland, with swell about, it is best to follow the channel S to Clutch beacon, marking the S end of Aileen Reef and then turn E, aiming for the beacon on the S end of Rutland. This should avoid any of the breaks on the E side of the Sound. <strong>Aran Sound North</strong> A large swell runs through the Sound of Aran in strong north-westerlies. At the N end, Blind Rocks at B686-166 and Ballagh Rocks at B693-170 are places to be avoided. Blind Rocks are just E of Calf Island and Ballagh Rocks (marked on the 1:50,000 OS map) are 0.6<em>km</em> NW of Eighter Island. In these conditions, the North Sound is virtually closed. Waves frequently break <em>over</em> the Ballagh rock light (10m high). This lighthouse was built in the autumn of 1875 and was originally known as Black Rock. It was converted to electric batteries in 1983. Waves also break over the Black Rock beacon (red) just off Leabgarrow pier. If in doubt, follow the ferry route around the N end of the beacon and then down to the beach and the landing described in the Aranmore section.</p>\n","costalZone":"**The North-West**"}