{"name":"**Island Roy – _Oilean Ruaidhe_**","nameHtml":"<p><strong>Island Roy – <em>Oilean Ruaidhe</em></strong></p>\n","safeName":"Island-Roy-–-_Oilean-Ruaidhe_","coordinates":{"irishGrid":{"sheet":"C","eastings":"129","northings":"379"},"fullIrishGrid":{"sheet":"","eastings":"212900","northings":"437900"},"tmcGrid":{"sheet":"","eastings":"612849.567","northings":"937883.191"},"geo":{"lat":"55.18804343","long":-7.79822606}},"cursor":148426,"description":"<p><strong>Island Roy – <em>Oilean Ruaidhe</em></strong> C129-379          Sheet 2 Island Roy is a lovely retreat.  It is secluded even though access is possible by road, except at very HW, by a short causeway, from the W towards Downings, which still floods, but only very occasionally.  Situated off the Carrickart / Downies road, the island is largely undeveloped, except for the new half dozen holiday homes, all similar.  The walking of the shores is rocky.  The views of Fanad and all around are majestic, especially of the new bridge across Mulroy Bay. Before the roadway / causeway was built, island children had to make their way to school in Downies by boat, or wading at LW, or using stilts if the tide was in between.  Once called Oileán Bhráidhe (reputedly Island of Prisoners). Population used to be 36 once, now 7.  Official Gaeltacht. <strong>Mulroy Bay, Inner</strong> Inner Mulroy Bay is a lovely place and a splendid paddle on blown out days. Tides The tides run strongly at the various narrows. As is normal with such configurations, the flood and ebb start later as one penetrates further into the bay. 7km southeast of Island Reagh at C184-357 is the most significant narrows of the bay, opening south into the inner bay proper, called Broad Water.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Third Narrows</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">2:20 before Galway HW</td>\n\n<td width=\"57\">8kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">3:35 after Galway HW</td>\n\n<td width=\"57\">8kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The times are likely to be earlier in springs and later in neaps. So constricted is the rush of water that the height difference can be as much as 0.5m, producing huge turbulence with the current up to 8kn. There is also a strong flow at Moross Channel at C183-393 which gives access from Broad Water to North Water. Here the flood and ebb start up to an hour later still. Within Broad Water and North Water, the tidal flows are not significant. For a day trip, there are good shuttle points. To the south, there is a car park / picnic site in a wood at C190-305 on the main Milford / Carrickart road. To the north there are multiple choices, including Fanny’s Bay pier at C118-390, a working pier east of Downies. <strong>Inishowen Peninsula</strong> Inishowen Peninsula lies between Lough Swilly to its W and Lough Foyle to its E, and is almost totally in the Republic of Ireland.</p>\n","costalZone":"**The North-West**"}