{"name":"**Malinbeg**","nameHtml":"<p><strong>Malinbeg</strong></p>\n","safeName":"Malinbeg","coordinates":{"irishGrid":{"sheet":"G","eastings":"494","northings":"799"},"fullIrishGrid":{"sheet":"","eastings":"149400","northings":"379900"},"tmcGrid":{"sheet":"","eastings":"549362.609","northings":"879896.005"},"geo":{"lat":"54.66467911","long":-8.78490026}},"cursor":131364,"description":"<p><strong>Malinbeg</strong> G494-799          Sheet 10 A most important embarkation place for kayaking. Landing, while safe at the sheltered pier and steep slipway, is a little awkward and involves a steep carry. There is excellent camping on commonage immediately above the pier, by a white house with three chimneys and a garage. The nearby beach is splendid. Drinking water is available at a tap external to an outhouse beside a dwelling, near the crossroads in the village on the road to the beach. The beach is a huge carry. The rock climbing hereabouts, mostly under the prominent signal tower, is nationally important. Malinbeg’s situation makes it a most attractive venue for paddling to Rathlin O’Birne Island, E along the Slieve League cliffs, or N to Glen Head. Basic provisions may be had in the village, as may B+B, and the hotel at Malinmore (3<em>km</em>) is excellent for eating and drinking. Local HW Galway +0040. Finding the harbour from the sea needs care. Once close, the white house with three chimneys in a line is prominent atop a low cliff and is just above the pier, which can then be made out. At night, the pier is lit. From out to sea to the SE, aim between the beach and the prominent square signal tower. Coming from the E, pass the prominent white strand, well to the E of the tower until the white house appears. Coming from the N, the spread out village disappears as one paddles past the promontory with the obvious signal tower, off which are two prominently visible (actually there are more) rocks. Turn in left (E) after the rocks. Follow around until the white house appears.</p>\n","costalZone":"**The North-West**"}