{"name":"**Owey Island**","nameHtml":"<p><strong>Owey Island</strong></p>\n","safeName":"Owey-Island","coordinates":{"irishGrid":{"sheet":"B","eastings":"719","northings":"229"},"fullIrishGrid":{"sheet":"","eastings":"171900","northings":"422900"},"tmcGrid":{"sheet":"","eastings":"571858.21","northings":"922886.72"},"geo":{"lat":"55.05268154","long":-8.44041369}},"cursor":140627,"description":"<p><strong>Owey Island</strong> B719-229          Sheet 1 Owey is uninhabited since about 1980, with a deserted village. Some refurbishment seems to be in progress, and in 1991 it was thought that some of the houses might be summer occupied by former islanders, or by persons wanting solitude more than comfort. In 2009 up to 8 houses had been restored in some ways. 2 log cabin type holiday houses had also been newly built. The island seems to be visited far more frequently than before. There is neither mains electricity nor water. A pleasant island, square shaped, tilted a bit anticlockwise, with granite sea cliffs all along its N half. Well worth a visit. A distinctive type of curragh was found in this region which was sculled over the bow and was used by islanders for access to and from the small pier on Cruit. Embarkation The nearest launching place for Owey is at the N end of Cruit, opposite Owey. Launch from a sheltered beach and slipway at B724-224, just below a golf clubhouse. Park in the clubhouse car park. Beware of flying golf balls when crossing to the slip as you’re on the 18th fairway and the golfers are unsighted at that point. From a car, the more convenient embarkation point is from a harbour B742-210, about 1<em>km</em> NW of Kincaslough, which is sheltered, where the parking is convenient, and is free of aerial bombardment. Landing and Camping The traditional landing place is at a slipway on the E point, in a small sheltered cove at the N end of the narrows opposite Cruit Island. The slipway in the cove is easily found coming from the N but can be missed coming from the S, as the cove opens ENE and is low lying. The markers are a large rock in the Sound, the cove itself and a prominent schoolhouse on the island all in line. There are lights on Cruit at 070º leading into the Sound from the S. In 2009 a new pier had been built on the S side but it is ugly and unattractive and poorly constructed.  Any boat activity observed was into the original landing. Water and Camping There is water in the stream through the village. Camping at slip. 10 Corncrake were heard calling in 2010. Rock Climbing There is excellent rock climbing on good granite, relatively undeveloped. It started in 1991, began in earnest in 1993 and there are now a few dozen routes. Some routes just 300m north of the landing place at the S end of ‘the Canyon’ do not need an abseil for access. With an abseil there are more in the Canyon itself at its N end, in the first cove N of the Canyon, and on slabs at the NE point. The NNW coast of the island has not yet begun to yield its unlimited climbing potential, though it will, well into the future, especially to access from the water. <em>Cladagharoan</em> (Seal Shore) B715-237, a small bay immediately S of the NE corner, is famous in sea stack circles.  It contains what must be the most spectacular small needle stack in the country called locally <em>Tor a’Mhadaidh Uisce</em> (Sea Dog Tor) but is shown on larger OS land maps as<em>Stackaniller</em> (presumably from <em>Stacán an Iolair</em>), wonderfully metamorphosed by climbers to <em>Stackamillion</em>.  First noticed by climbers in 1991, it was climbed in 2003 by a Polish party led by Andrzej Smialy, featured in a photographic competition in 2004, and was strongly reported to have collapsed shortly after that.  I am certain that only Ozymandias would have approved.  Rumours of its collapse proved incorrect.  It is still there. Circumnavigation Circumnavigation gives good caves, canyons, channels and stacks. Owey in Irish – ‘Uigh’, means ‘Caves’. There is a through cave with a right angle turn going through the NE tip. There is a passage on the NW side of the island which is entered from the land, leading to a large underground cavern. There are deep sea caves along the ENE side, including one with connecting chambers. These are easily accessible when the wind is from the S/SW. A through cave system also located in SW corner, where in a bay with 3 caves take the right hand one, to exit next bay E. Tides Local HW and LW are Galway +0100. Tidal streams in the sound with Owey turn with the tide by the shore, or half an hour later, flowing very strongly indeed and can cut up very rough in contrary winds.</p>\n","costalZone":"**The North-West**"}