{"name":"**Rathlin O’Birne Island**","nameHtml":"<p><strong>Rathlin O’Birne Island</strong></p>\n","safeName":"Rathlin-O’Birne-Island","coordinates":{"irishGrid":{"sheet":"G","eastings":"467","northings":"801"},"fullIrishGrid":{"sheet":"","eastings":"146700","northings":"380100"},"tmcGrid":{"sheet":"","eastings":"546663.193","northings":"880095.976"},"geo":{"lat":"54.66619738","long":-8.82677408}},"cursor":131700,"description":"<p><strong>Rathlin O’Birne Island</strong> G467-801          Sheet 10 2<em>km</em> W of Malinbeg, this is a low-lying, grassy island indented all round with channels, bounded by cliffs and even bisected by a sea arch. It has a major lighthouse, now automated. While the building was completed in 1846, the light was not fitted for another 10 years. The light is 35m above sea level on an all white tower. It flashes white and red every 15 seconds. Lighthouse keepers and their families lived here from 1856 to 1912, when the families moved to shore dwellings in Glencolumbkille. Ireland’s first nuclear powered light (and thought to have been the world’s most powerful) was switched on here on 15<sup>th</sup> August 1974. This was replaced with wind power in 1987 when the nuclear battery became worn down. Wind power was replaced with solar energy in 1993, and that is the position to this day. Two parallel cut stone walls, 2m high and 4m apart, enclose a roadway, once used by the lighthouse keepers as protection against the Atlantic winds on their journey from the beach to the lighthouse. N of the walls lies the kayak landing, and beyond it across the ‘moraine’, lies the remains of lazybeds, a house, and what looks like the evidence of monks’ dwellings. South of the landing there is a monastic settlement that has some cross inscribed crosses, altar stones, and offering bowls.  The site is now very ruined but still interesting. There is a covered well built stone well located northwest down the slope from the monastic complex. The water in July 2013 needed to be cleaned out but should provide good water after a few days. Several other small seepage streams are to be found around the main landing beach and at the old Lighthouse landing steps on the north side. The island has good camping on the ledges just west of the main boulder beach landing on the north side. There were large numbers of breeding Herring and Greater Black-backed Gulls, a flock of Greylag Geese,  1 Corncrake calling and 1-2 pairs of Great Skua in July 2013. SPA Storm Petrel, Leach’s Petrel, Barnacle Goose, Terns. Landing and Embarkation Best landing is at a stony beach visible from the mainland in the NE in a somewhat sheltered bay, where the island appears to be almost dissected. The pier at the SE is unsuited to kayaks. Out of Malinbeg, the crossing is only about thirty minutes. Tides Tides in the Sound run north strongly for 9.15 out of the 12 hours.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"260\"><strong>Rathlin O’Birne Sound</strong></td>\n\n<td width=\"180\"></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"180\"><strong>Max Rate Sp.</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"180\">2:30 before Galway HW</td>\n\n<td width=\"180\">1.5kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"180\">Galway LW</td>\n\n<td width=\"180\">Weak</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The spring rate of the north-going stream is about 1.5kn and the south-going stream is very weak. The main west coast tidal stream runs along the coast from Rathlin O’Birne to Aran.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Rathlin O’Birne to Aran Island</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"180\">3:20 before Galway HW</td>\n\n<td width=\"57\"><1kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"180\">3:05 after Galway HW</td>\n\n<td width=\"57\"><1kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The flows are stronger inshore off the salient points and the flows probably change 1-2 hours earlier. The Evelyn Marie fishing boat went down here in 1975 and then the Carrig Una in 1976, tragedies that rocked west Donegal. <strong>South West Donegal</strong> The stretch of coastline from Rathlin O’Birne G467-801 to Loughros Point G645-934 is dominated by huge stretches of awesome cliffs, hundreds of metres high, accessible from land only in Malinmore, Glencolumbkille and Port.  Along the entire length lie mighty sea stacks, all close in to the shore.  These are almost unknown to the general body of sea going folk, certainly outside the ranks of a new breed of adventurers that specialise in the challenge of climbing them. Climbing sea stacks is not entirely new.  The televised ascent by legendary Joe Brown and Chris Bonnington of the Old Man of Hoy in the Scottish Orkneys many years ago is well renowned.  It is thought that the first ever organised and recorded rock climbing in Ireland was in the NE corner of Ireland’s Eye in County Dublin.  Anyone who visits Loop Head will look with awe across the 100m high gap to the prominent cairn atop its huge sea stack, Diarmuid and Gráinne’s Rock. British climbers Mick Fowler and Steve Sustad placed it there in 1990.  But there has been an explosion of this kind of activity this century, mostly by Donegal based climbers, led by Iain Miller. Their passionate pursuit of this new adventure model is much to be admired. One may only marvel at the level of commitment necessary to flourish at this new sport, access often requiring difficult and obscure manoeuvres.  Typically the approach requires the climber to descend a frightening grass or scree cliff, often probably never previously descended, maybe needing an abseil and a fixed rope for the retreat.  The right place is then achieved horizontally, either by “coastaleering” or by floating, necessarily in the flimsiest of inflated “boat”, it not being practical to carry anything remotely seaworthy on such an approach.  Incredibly, even the outside face of Sturrall headland has been climbed, accessed by scrambling down the N face to a sea level slab, facing the collection of off-lying stacks. Scramble around the corner S to the foot,</p>\n","costalZone":"**The North-West**"}