{"name":"**Rinrawros Group**","nameHtml":"<p><strong>Rinrawros Group</strong></p>\n","safeName":"Rinrawros-Group","coordinates":{"irishGrid":{"sheet":"B","eastings":"643","northings":"188"},"fullIrishGrid":{"sheet":"","eastings":"164300","northings":"418800"},"tmcGrid":{"sheet":"","eastings":"564259.804","northings":"918787.637"},"geo":{"lat":"55.01536734","long":-8.55880896}},"cursor":139800,"description":"<p><strong>Rinrawros Group</strong> B643-188          Sheet 1 For generations Irish climbers have looked hungrily at the expanse of virgin rock in the wild and scenic bay on the NE of Aranmore lighthouse at Rinrawros Point.  No one until recently has possessed the appetite.  Access is of itself committing, whether by floating past Tourneady Point to the N, or, for the climbs immediately at the lighthouse only, by abseil. The showpiece of the whole group of stacks and faces and ridges is the very visible landward ridge of the sea stack found immediately below the lighthouse.  The climbing and situations are superb.  The technical climbing grade is quite manageable on all theclimbing routes in this immediate area. 1<em>km</em> to the E at B653190, routes climb the 120m monster stack sitting in the middle of the ampitheatre of huge cliffs.  Access is by Torneady Point.  The climbing is hard and committing, varying from sound quartzite to grass and mud.  The better route is the steep seaward W ridge, and the landward face has its own virtues. 300m N lies a ridge climb of elegant simplicity at Grid Reference B654193. This truly monstrous 150m+ ridge rises from sea level to the summit. The ridge can be very easily seen from anywhere on this coast, immediately identifying itself on a quick glance at OS sheet 1.  Access to sea level is via Torneady Point. Simply follow the very  exposed crest of the ridge from sea to summit! 400m further N, just on the lighthouse side of Torneady Point, a stack at B654-196 gives good quality easier climbs, the N face route being the better. <strong>North West Donegal – Tidal Overview</strong> For Aran Island to Bloody Foreland, Horn Head, Tory Sound and the Inishbofin Group, local HW and LW are 40 minutes after Galway HW. The main northeast tidal stream in the area generally starts, half an hour ahead of the main west coast tidal stream as follows:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Aran Island to Bloody Foreland</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NE</td>\n\n<td width=\"180\">3:50 before Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SW</td>\n\n<td width=\"180\">2:35 after Galway HW</td>\n\n<td width=\"57\">1kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>However, it is important to note that this general statement does not hold good close in to Tory or amongst the inshore islands of the Cruit, Gola and Inishbofin Groups, where the details are given individually. The streams here tend to turn an hour or more earlier. In Tory Sound, the maximum spring rate is 2kn. At Bloody Foreland itself, as might be expected, usable eddies form inshore downstream. Further east, inshore past Horn Head, Melmore Head and on towards Malin Head, the stream runs ENE as follows:</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"317\"><strong>Bloody Foreland to Malin Head</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">NE</td>\n\n<td width=\"180\">3:50 before Galway HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">SW</td>\n\n<td width=\"180\">2:35 after Galway HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The bays tend to start to fill an hour or more earlier, from 5:0 before Galway HW to about 1:00 after. <strong>Owey Group</strong> Admiralty Chart 1883 covers Crohy Head to Bloody Foreland and is well worth having for a visit to this area. The main offshore tidal stream from Aran to Bloody Foreland starts and finishes half an hour earlier than the main west coast tidal stream further S. The NE flood starts at HW Galway   0350 and the ebb at +0235. In this region however, it merely brushes off the outside of the islands, eddying. The streams in the channels tend to be from HW Galway +0130. These tidal streams are not said to be significant throughout the whole group except in Owey Sound.</p>\n","costalZone":"**The North-West**"}