{"name":"**Roaninish**","nameHtml":"<p><strong>Roaninish</strong></p>\n","safeName":"Roaninish","coordinates":{"irishGrid":{"sheet":"G","eastings":"658","northings":"027"},"fullIrishGrid":{"sheet":"","eastings":"165800","northings":"302700"},"tmcGrid":{"sheet":"","eastings":"565758.496","northings":"802712.382"},"geo":{"lat":"53.97255779","long":-8.52192001}},"cursor":134042,"description":"<p><strong>Roaninish</strong> G658-027          Sheet 10 A lovely, remote, low-lying, short-grassed island, 6<em>km</em> WNW out from Portnoo. Land and camp at a sheltered sandy beach in an E-facing little bay called Portnatra on the E side. There is also an attractive landing at the W end of Roaninish in an embayment called Portnagall formed by its satellite islands. At times of HW this area is an attractive bay full of channels that allow passage by kayak and small craft between Nee Beg, Nee More, and Roaninish itself. There is evidence of some settlement at Tonavally just above the W landing where there are the remains of four small buildings. Interestingly, there is a named entrance to access Tonavally from the S called Portnageeragh, which suggests that this channel was used in former times. The main island has at least three satellite islands Nee Mór, Nee Beg and one unnamed on its W/ NW sides and one on its E flank also unnamed. All are similar in topography to the main island, low lying and grassy with many humps and hollows,  except the unnamed Emost island which has predominantly large areas of storm beach. All entrances to the various channels, including Portnatra, are subject to swells and boomers can catch the unwary. A small lake by the campsite should be treated with caution as sheep graze the island. No other water spotted. The Greenhaven was wrecked on the W side in 1956. She sat on the island until a storm in the late eighties, and since then is submerged just off the shore.  The wreck and the island featured in a BBC feature film in the 90s entitled “The Secret of Roaninish”.  In 2001 kayakers found no sign of the remains of the wreck even at LW. The birdlife is interesting with Widgeon, Teal, Greylag, Barnacle Geese, Purple Sandpiper, Whimbrel, Ringed Plover, and Turnstone all present in April 2012. Breeding species include Gulls, Eider, and Storm Petrel. SPA Storm Petrel, Tern. <strong>Aranmore Group</strong> This group extends from Illancrone in the south to Aranmore itself in the north. Embarkation The normal embarkation place for the Aranmore group is from Burtonport at B717-152 which has good facilities in terms of pubs, restaurants and shops. Launch from the main wide slipway, but it can be busy. Be sure though to park 150m away in front of the pub. This will keep the slipway and pier free. Otherwise there is a smaller slipway 200m to the S of the main slip, where also good parking and even toilets.  Also, be aware that the sea in the immediate vicinity of Burtonport is very protected and is no indication of what may be happening outside. The North Rutland Channel runs SE to NW and is the narrow sound between Eighter and Rutland which gives access from Burtonport out to Aran. The SE entrance to the Channel is difficult to identify from Burtonport. Aim for the two-story house on the Rutland skyline WSW of Burtonport pier. Navigation locally is far more challenging in windy conditions than any casual glance at the OS 1:50,000 map might suggest. Accordingly, some considerable nautical detail is given for this area, and a proper nautical chart is recommended to any visiting group. Maps and Charts Chart 1883, Crohy Head to Bloody Foreland (1:30,000) covers the area. The details of the seabed give a good indication of what to expect on the surface in bad weather and in this respect it is much better than the OS 1:50,000, sheet 1. However, many of the beacons on the approaches to Burtonport are not marked on the chart but can be worked out from the Pilot or Sailing Directions. This is a complicated area. The Sailing Directions (South and West Coasts of Ireland) give a good sketch map of Aran Sound, shows most of the beacons and all of the shoals. The Pilot gives detailed information but needs to be used with a map or chart. The older half-inch, (1:126,720) sheet 1 OS map is virtually useless (unusually perhaps) for bad weather navigation in this area. Tides Tidal streams in the locality flow strongly and can cut up rough in contrary winds. Local HW and LW are an hour after Galway HW. The tide floods from both ends of Aran Sound simultaneously, meeting near the Carrickbealatroha Upper beacon at B695-147, midway between Rutland and southeast Aran. This is also sometimes known as Stream Rock and the beacon is a wide square tower, 5m high. On the eastern side of Rutland, the tides meet halfway up, at Teige Rock, a large white beacon, at B713-145.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"260\"><strong>Aran Sound</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"180\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">In</td>\n\n<td width=\"180\">5:20 before Galway HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">Out</td>\n\n<td width=\"180\">0:50 after Galway HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The tide floods southeast through the North Rutland Channel, strongly, up to 2-3kn in springs, but one may eddie-hop going against. This is one of the very few channels on the west coast of Ireland where the tide floods south. Other examples are mainly north-facing bays such as at Achill Sound and Valentia Harbour. Similarly, the tide floods logically into Dungloe Bay around both sides of the more south islands in the group.</p>\n","costalZone":"**The North-West**"}