{"name":"**Round of Malin Head**","nameHtml":"<p><strong>Round of Malin Head</strong></p>\n","safeName":"Round-of-Malin-Head","coordinates":{"irishGrid":{"sheet":"C","eastings":"381","northings":"590"},"fullIrishGrid":{"sheet":"","eastings":"238100","northings":"459000"},"tmcGrid":{"sheet":"","eastings":"638044.355","northings":"958978.443"},"geo":{"lat":"55.37625732","long":-7.39976159}},"cursor":149341,"description":"<p><strong>Round of Malin Head</strong> C381-590          Sheet 3 Malin Head is popularly but incorrectly known as the most northerly point of Ireland. In fact nearby (2<em>km</em> ENE) Dunaldragh Head at C398-598 is the most northerly point. Malin Head faces west and is small, low-lying and thoroughly undistinguished, except for the seas off it. Dunaldragh Head faces north and is a high rocky headland, complete with a Lloyds Signalling Station since 1805, an Eire sign from 1939, and lookout sheds from the same period. There is a nice non-waymarked trail around the immediate area. Tides The tidal streams in the area are complex and require careful study, after which passage close inshore is perfectly feasible. The diagrammatic hour-by-hour sketches in the Sailing Directions are highly recommended. Paddlers have studied these for days at a time and found them remarkably accurate. Remember:</p>\n<ul>\n<li>Local HW is approximately 1 hour after Galway HW.</li>\n<li>Belfast HW is approximately Galway LW.</li>\n<li>Belfast HW is 15 minutes before Dover HW.</li>\n</ul>\n<p><em>Beware that HW at Malin village can be as much as 3 hours behind HW in Lough Swilly outside.</em> At about an hour before local HW, which is HW Dover -0600, the flood stream starts hammering eastwards and is split by its collision with Malin Head. This gives associated turbulence, initially off Dunaldragh Head, followed (after about an hour or so) by Malin Head itself, until about HW Dover -0400. Then there is slack for about an hour until HW Dover -0300. Then until about HW Dover the inshore flow around the Head favours a passage S to N, but beware wind over tide. From about HW Dover +0100 until about +0400 the stream is hammering west, so that eddies are set up inshore and these turbulently collide with the main flow, mostly at Dunaldragh Head and to the E of it, making things difficult indeed. Therefore the only reliable window of opportunity is at about Dover -0400 or -0300, an hour or two after local HW. If travelling anticlockwise, aim to pass the danger zone closer to HW Dover -0400 than -0300, and if going clockwise, there is slack at HW Dover -0400, followed by several hours of mostly favourable flow until HW Dover. The really troublesome times are as follows:</p>\n<ul>\n<li>Dover HW -0600 to -0500, which is local HW –0100 to local HW and</li>\n<li>Dover HW +0100 to +0400, which is local LW to local LW +3000</li>\n</ul>\n<p>In calm conditions, paddlers will succeed anytime, but do respect that there is significant turbulence hereabouts at other times. Short Option A worthwhile half-day trip around the head is between Malin Pier at C423-586 in Slievebane Bay and the small pier in a sheltered bay locally named as Port Ronan (or West Town on the OS 1:50,000 at C406-573). A 2<em>km</em> walk saves a shuttle. One and a half hours in all, quite leisurely. There are regular escape points along the route, so the only committed section is the 2<em>km</em> section between Malin Head and Dunaldragh Head, where you also have the best cliffs, scenery, caves and waves. There is a 400m long passage, only a boat width in places, at Dunaldragh, which is thought might be passable at higher water. The nearest escape point on the N side is at C404-595 where a stream falls onto the beach and on the S at C387-589 in Breasty Bay, or more leisurely in Ineuran Bay at C390-584. There is a newly upgraded pier facility at Port Ronan, which is hard enough to spot, but there are now half a dozen or so holiday homes clustered above. It is almost at the E end of the high ground. There is a useful hostel in a prime position just at Port Ronan, for a kayaking meet or for the weary passer-by. Longer Option A longer trip at 35<em>km</em> with a short shuttle is from the bridge in Malin village at C470-498 (or from Port Ronan, a longer shuttle, paddling distance 23<em>km</em>) to Portaleen Pier at C525-528 or a small pier near Culdaff at C538-507. Departing Malin village has the disadvantage of a long trip through Trawbreaga Bay, which needs an appropriate tide. Beware that HW at Malin village can be as much as 3 hours behind HW in Lough Swilly outside. Any of these longer options include the committing 11<em>km</em> section of escape-proof cliffs from the Garvan Isles to Glengad Head, which are quite stunning and highly recommended. The stretch from Malin Pier to Culdaff is unremitting with high and brooding cliffs. An early morning paddle perhaps! The stacks add interest along the route but caves and arches are very few and far between. There are good numbers of breeding Fulmars along the high cliffs and the stacks hold Kittiwakes and Auks. A flood tide on this section is noticeable between the stacks at Reaghillan at C459-580 and Glengad Head at C526-547. Interesting tidal races set up quite unexpectedly at times. There are beaches of shingle and small pebbles under these cliffs but these may be exposed to a northerly swell. There is a small, well sheltered, east-facing shingle beach at C526-541 just S of Glengad Head near Burren, but at that stage it would probably make more sense to go on to the pier at Portaleen. Culdaff itself is an attractive place. There is a fine landing at Portaleen pier. You could also try a small picnic site up the Culdaff River at C537-499. There is a track from the picnic site to the river but at low tide getting up the narrow channel may sometimes be a problem. Alternatively, there is a gap in the sand dunes on the beach C540-500 with access to a car park behind. The coast from Glengad Head to Culdaff gets progressively lower in height and for the paddler the pier and river channel stay hidden from view until you are very close. On the S side, the extra journey has almost continuous escape potential. SPA Trawbreaga Bay is an SPA. Whooper Swan, Barnacle Goose, Golden Plover, Bar-tailed Godwit.  </p>\n","costalZone":"**The North-West**"}