{"name":"**Rutland Island**","nameHtml":"<p><strong>Rutland Island</strong></p>\n","safeName":"Rutland-Island","coordinates":{"irishGrid":{"sheet":"B","eastings":"704","northings":"151"},"fullIrishGrid":{"sheet":"","eastings":"170400","northings":"415100"},"tmcGrid":{"sheet":"","eastings":"570358.446","northings":"915088.39"},"geo":{"lat":"54.98253322","long":-8.46307574}},"cursor":136295,"description":"<p><strong>Rutland Island</strong> B704-151          Sheet 1 Very much the largest of the outer islands immediately inside Aran, SW of the North Rutland Channel. There are a fast-growing number of newly built holiday homes on the NE quadrant of the island facing Burtonport. In late 2009 the pace seemed if anything to be accelerating, bucking the national trend.  There is even a RoRo slipway, which is only one step short of a crane. West of a line from the NW tip to the SE tip, the entire island is a desert of prickly sand dunes. This is a most attractive island, accessible yet quiet, whose main tourist feature must be its magnificent beach running the length of its W side and where few others would ever be met. Absolutely worth a visit. Landing and Camping Landing on the main beach would involve a lengthy and difficult carry, easily avoided by accessing a small, hidden, sandy cove through a short, narrow channel just inside the mouth of the North Rutland Channel (beside a sign warning of a Power Cable). A 100m carry then accesses splendid machair short-grass camping in the shelter of the dunes and near the north end of the beach. Alternatively, land 150m further SE into the North Rutland Channel, onto a steep, sandy beachlet at B705-150, just seaward of a new house with new steps to the sea and just inside a green navigation marker. This gives a shorter carry to the same camping, but the beach, although sheltered, is steep at most points of the tide. The island has long been electrified, but there is no mains water. Tides Beware strong tides all around, and foul ground off the SW tip. There are many landings possible all around the island. History Rutland Island has a remarkable history, having been the commercial capital of NW Ireland 200+ years ago. The herring industry thrived so strongly in the 18th Century that the local landlord Lord Burton Conyngham invested heavily in providing access via Burtonport to a major new town on Rutland Island. By about 1785, the island had a Post Office, hotel, harbours, fish handling facilities and a population of hundreds. Then the herring shoals declined and disappeared altogether in 1793. The town degraded somewhat but was still occupied in September 1798 when the second wave of French invaders to Ireland that year landed on Rutland. Napper Tandy, commander of the United Irishmen on board, raided the post office. He found out that the first wave of the invasion of the previous month under General Humbert, which had landed at Killala and had some early successes, had been beaten. The 1798 Revolution was as good as over. Tandy retreated towards France, was caught, but not executed. Wolfe Tone would accompany a third wave of invaders a couple of months later but they were beaten by the Royal Navy in a battle just off the back of Aranmore. When Ireland became independent in 1921, the country was awash with licenced public houses.  “Pub” numbers were growing and out of control.  To slow things down, a law was passed that to be allowed to open a new pub anywhere, even in an area of huge population growth which therefore might need the like, it was necessary to close down two other pubs.  The two other pubs closed didn’t have to be nearby pubs, they could be anywhere.  A market in pub licences flourished for a time.  The absurdity of the rule was forced home whan a Dublin pub was opened, one of the two pubs it had closed elsewhere being that of the Rutland Island pub, hundreds of miles away, and which anyway hadn’t served drink for eighty years.  The law has since been changed. The island remained the administrative capital of the region for a century. A channel to the nearby mainland was dredged out, so that Burtonport became eventually more important and took over the marine industry hereabouts. The island was inhabited until the 1960s. Nowadays there are holiday homes on all these inner islands. In 2003 a marina for pleasure yachts has been planned, but lack of funds has frustrated progress. The main fishing hereabouts is now out of half-deckers, for crabs and lobsters. Trawling is very much in decline. This area may thus become principally a tourist destination, but that is the way of things. Rutland badger are much smaller than normal, so that they were once commonly mistaken for Mink.  They also have distinctive white noses.</p>\n","costalZone":"**The North-West**"}