{"name":"**Torhonadoogha**","nameHtml":"<p><strong>Torhonadoogha</strong></p>\n","safeName":"Torhonadoogha","coordinates":{"irishGrid":{"sheet":"B","eastings":"802","northings":"304"},"fullIrishGrid":{"sheet":"","eastings":"180200","northings":"430400"},"tmcGrid":{"sheet":"","eastings":"580156.508","northings":"930385.066"},"geo":{"lat":"55.12044854","long":-8.31107191}},"cursor":143835,"description":"<p><strong>Torhonadoogha</strong> B802-304          Sheet 1 This 20m stack is situated just off the Glashagh Lower headland. Access is by a short sea passage. The stack’s S face is a 20m vertical wall of excellent “Gola” type sea battered granite. Land Directions From Jacks Hotel, as you leave Gweedore, take the sharp left and follow the B class road to the small beach car park. On foot, follow the coastal path N over several new wooden bridges to the headland overlooking the stack. Many easy / middle grade high quality rocks climbs await the visitor. <strong>North Donegal</strong> <strong>Rockall</strong> No Irish Grid Reference  No Irish OS Sheet          (British Grid Reference NF 68694-70525) Rockall is the most disputed, the most infamous, the most unique, the most isolated, the most desolate and the most far-flung island off the Irish coast.  It is located at <a href=\"http://stable.toolserver.org/geohack/geohack.php?pagename=Rockall&amp;params=57_35_48_N_13_41_19_W_\">57°35′48″N, 13°41′19″W</a>, just 424<em>km</em> NW of Bloody Foreland in County Donegal. Rockall is an extinct volcano, disputed by Ireland, the UK, Iceland and Denmark (on behalf of the Faeroes). The islet is located approximately 430<em>km</em> SE of Iceland, 461.5<em>km</em> NW of Ardnamurchan point (though much closer is St. Kilda Island at 301.4<em>km</em>) Embarkation There is no immediately obvious embarkation point for this island, by kayak or otherwise. Landing Neither is there an easy landing spot.  A sustained settled spell is required. The depth of the waters generally surrounding the rock is over 1000m, but this rapidly shallows to 150m within 2<em>km</em> of the rock itself, which looms up out of the depths. There are some off-lying reefs, so caution is needed against rogue swells, and even boomers. There are very strong surges and scends around the base of the rock. Summiting The island itself is solid rock rising to a height of approximately 20m. While the surface is all rock, it has a soft, malodorous, slimy guano coating which is rather pungent, thus making the island very slippy, apart from the areas regularly stripped by the swell.  The S side of the islet is almost vertical. The other sides are steep and cracked. The rock is granitic in texture and has unusual pock marks, which makes climbing the initial section relative easy (if you survive the swell). It is strongly recommended that both landers have at least limited rock climbing experience. Low down on the W side there is a “thread belay” which is invaluable in fixing both the climbers and the boat to a secure belay point.  From there, it is easy but exposed scrambling along sloping ledges to the summit. The exposure to noise and waves below can be a bit unnerving.  Upon achieving the summit one is rewarded by a magnificent vista of nothing but open sea, thus giving an interesting sense of vulnerability. Current Position On the summit in 2007 all that remained was part of the base of a navigation beacon which had been removed by the swell at some stage. Within the base of this, some Fulmars clung to the inner margins for shelter, and were not in the least perturbed by human presence. Camping / Water / Hall’s Ledge There is a ledge near the summit with some modern “bolts”.  The ledge is named after the leader of the first landing party in 1810, Lieutenant Basil Hall. It would be possible to spend a night here, but probably not to be recommended. Obviously due to the barren nature of the rock there is no freshwater available. History The first known landing was on 8<sup>th</sup> July 1810 by a party from HMS <em>Endymion</em> led by Lieutentant Basil Hall, all of whom summitted. A member of a landing party from HMS <em>Porcupine</em>, the famous survey ship after whom the whole Porcupine Bank is named, a Mr Johns, gained a foothold, but did not summit, in 1862. Near the edge of Hall’s Ledge is a plaque claiming the rock as part of the British Empire. This was laid in 1955 by a landing party from HMS <em>Vidal</em> (coincidentally named after the man who first charted the island), that formally claimed the island for the UK. This claim was motivated by a fear that the Soviets would occupy Rockall to use it as a spying base.  The context was that Britain was about to launch the “Corporal”, its first ever guided nuclear missile, from Uist, so they were nervous. The Irish, the Danes and the Icelanders sniggered. However in 1972 the UK Government passed the Isle of Rockall Act, formalising the claim, declaring it part of Inverness-shire. They even put an 80<em>km</em> exclusion zone around the rock. In 1975 Willie Dick summitted, and measured its height with a climbing rope.  His navigator Michael d’Alton measured the circumference at sea level by paddling around it trailing a long length of red twine. They found their measurements and the Rock generally “very close indeed to the description in St Brendan’s <em>Navigatio</em>”. They were left with no doubt that the Irish monks were well aware of it. D’Alton also landed nearby Hasselwood Rock by partly swimming.  Hasslewood only shows in the troughs at LW, and he said it was like straddling a horse. He took one rock sample. Conceivably this was the only landing ever on Hasslewood? Still Ireland and the rest laughed, denying the claim on the grounds that no one could live on the rock. Ireland, Iceland, and Denmark argued (successfully in the end) that barren rocks which cannot sustain life are part of the environment, and their “ownership” depends on other factors like “continental shelfs”, that may create rights but barren rocks are not self proclaiming merely for being visible above the surface. So the British sent the SAS to reinforce their claim and left Tom McClean to live on the rock for 39 days in 1985 from 26<sup>th</sup> May to 4<sup>th</sup> July, explaining the present day bolts to hold down the module which housed his sleeping quarters. The manoeuvring continued.  Our own Sean “Dublin Bay” Loftus legally changed his name by Deed Poll to Sean Dublin Bay “<em>Rockall</em>” Loftus, to promote Ireland’s claim and denounce Albion’s perfidy. The Wolfe Tones released a song “Rock on Rockall” to highlight Ireland’s interest. A 1986 party including the renowned arctic explorers John Gore-Grimes and Pat Colleran landed and summitted, fuelling Irish populist ambitions.  Irish British diplomacy had suffered a set-back in 1982 over differenig attitudes to events in the South Atlantic, and feelings were still stirred at the time. In 1997 the environmentalist organisation Greenpeace occupied the islet for a short time, calling it Waveland, to protest against oil exploration under the authority of the British. They asserted their claim by renaming the rock “Waveland”. Greenpeace declared the island to be a “new Global State”, and offered citizenship to anyone willing to take their pledge of allegiance. The British Government’s response was simply to give them permission to be there, and otherwise ignore them. Kevin O’Callaghan (a.k.a. GEO), first President of the Irish Sea Kayaking Association, summitted in 2007. Departing The most difficult operation on Rockall is to vacate the place in one piece. It is easiest to launch the boat and get it beyond the wave-breaking zone, then swim out after it, very reminiscent of Fastnet. Shipwreck Despite its lonely position, a major shipwreck took place here on 28th June 1904.  The passenger steamer Norge <em>en route</em> Oslo to New York struck an off-lying reef and went down quite quickly.  There were insufficient lifeboats for all aboard.  Two of the lifeboats were lost while being put out, and the rest were quickly filled.  Everyone else had to swim for Rockall itself or perish.  The full lifeboats deliberately left the scene rather than be swamped by the despairing swimmers. A trawler happened upon the scene within hours, but it was too little too late.  600+ drowned. International Law The relevant law is the United Nations Convention on the Law of the Sea 1982.  Everyone except USA and Uzbekhistan has signed up.  This agreement provides for “extended continental shelf” claims in certain circumstances beyond the “normal” limit of the “exclusive economic zones” projecting seaward from sovereign states for 200<em>nm</em> from their coastline, the usual limit that everyone agrees in principle that everyone else may enjoy. These rules work well in most circumstances. There are less than 20 disputes worldwide to go to the scientific committee of the UNCLOS, the final arbiter in these things.  Most disputes involve competing neighbours disagreeing benchmarks or angles. Russia did plant a flag on the seabed of the North Pole, but no one takes that seriously. On the other hand, when for instance the UK ratified the Convention, it gave up its (previously claimed) right to a 200nm zone around Rockall, and effectively rowed in with the opposition views in the matter. Ireland has a huge undisputed wedge of the NE Atlantic.  In acreage terms we box well above our weight.  The undisputed part of our 200nm EEZ extends over large parts of the Hatton Basin in addition to the Rockall Trough/Bank The Irish undisputed area does not however include the position where the rock of Rockall lies.  Ireland is in dispute with Iceland, Denmark and the UK for seabed type rights of the 200<em>nm</em>+ type with regard to a huge area of seabed that (inconsequentially) does include Rockall, so the issue is “live”.  The Danes have recently clarified their claim, so the adjudication process should begin soon enough. Rockall isn’t urgent.  The main current national economic benefit of the Rockall area is in its fishery, and the management of EU fisheries were in any event ceded to the EU many years ago.   It is overstating it that sovereignty has also thus been ceded, but realistically, if Iceland were to join the EU, the whole position would be moot entirely. <strong>Tory Group</strong> <strong>Inishbeg, Inishdooey</strong> and <strong>Inishbofin</strong> together form a worthwhile group for a day trip or for an overnight camp, or just for shelter on passage out to Tory. Embarkation for all the islands is from the sheltered strand E of pier at Magheraroarty at B889-333. SPA Storm Petrel, Greenland White-Fronted Goose, Barnacle Goose, Tern, Chough, Corncrake, Peregrine. Tides Local HW and LW are about 40 minutes after Galway. Tides flow strongly through the sounds and off the points, nowhere more so than over the shallow bar off the southeastern point of Inishbofin. The causeway here dries in LWS and there is often a fair race. Tides in the channels amongst the islands and in Tory Sound close in to Inishbeg turn about an hour after HW/LW by the shore.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"336\"><strong>Tory Sound, close by both Tory and Inishbeg</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"255\"><strong>Time</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">E</td>\n\n<td width=\"255\">4:50 before Galway HW</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">W</td>\n\n<td width=\"255\">1:35 after Galway HW</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<table width=\"355\">\n\n<tbody>\n\n<tr>\n\n<td colspan=\"2\" width=\"249\"><strong>Tory Sound, middle</strong></td>\n\n<td width=\"106\"></td>\n\n</tr>\n\n<tr>\n\n<td width=\"75\"><strong>Direction</strong></td>\n\n<td width=\"174\"><strong>Time</strong></td>\n\n<td width=\"106\"><strong>Max rate Sp</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"75\">E</td>\n\n<td width=\"174\">3:50 before Galway HW</td>\n\n<td width=\"106\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"75\">W</td>\n\n<td width=\"174\">2:35 after Galway HW</td>\n\n<td width=\"106\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>As the exposed part of the passage between Tory and Inishbeg takes an hour or so and as another hour is needed for the passage between Inishbeg and Magheraroarty, it is impossible to organise slack water all the way across. Local advice is to emphasise the later ‘middle of Tory Sound’ tide for planning purposes, accepting some wind over tide as necessary in the first or last part of the trip, to taste.</p>\n","costalZone":"**The North-West**"}