{"name":"**Tormore Group**","nameHtml":"<p><strong>Tormore Group</strong></p>\n","safeName":"Tormore-Group","coordinates":{"irishGrid":{"sheet":"G","eastings":"555","northings":"908"},"fullIrishGrid":{"sheet":"","eastings":"155500","northings":"390800"},"tmcGrid":{"sheet":"","eastings":"555461.401","northings":"890793.652"},"geo":{"lat":"54.76316141","long":-8.69204002}},"cursor":133030,"description":"<p><strong>Tormore Group</strong> G555-908          Sheet 10 2<em>km</em> NE of Port, the Tormore Group is a cluster located just off a headland.  Tormore is high and precipitous, the largest and most seaward of this broken triangle of islands. The sea has breached this group of islets in several places and one can enter a narrow stretch of water through a sea arch in the most southern islet of the group. High cliffs all round make it a dramatic place, as all entrances are narrow and a tricky place to be in heavy swell. The N-facing breach is too narrow and dangerous for kayaks at LW. Breeding colonies of Kittiwake, Guillemot, Razorbill and Fulmar. For land access to the lovely shark’s fin stack to the S, descend the 200m grass slope on the headland to the lonely pebble beach facing the stacks. Keep to the grassy slopes, directly above the beach and avoid the scree to your right.  The landward arête of this southernmost stack yields a magnificent middle grade climbing route.  Its smaller neighbour is also climbed. Land access to Tormore itself is much more complex, by coastaleering from the beach well to the E (its own access an enormous challenge), but finally by water surface, a full 3.5 hours for the 2<em>km</em> from a car at Port.  Climbers term the stack inside Tormore as The Hidden Stack.  At 150m high Tormore is considered the Daddy of Donegal’s Sea stacks.  It can be seen from Dungloe, approximately 40<em>km</em> to the NE! The climbing route on Tormore is by its landward arête, which as a feature can clearly be seen from any position along this coast. SPA Peregrine, Chough, Grey Seal.</p>\n","costalZone":"**The North-West**"}