{"name":"**Tory Island**","nameHtml":"<p><strong>Tory Island</strong></p>\n","safeName":"Tory-Island","coordinates":{"irishGrid":{"sheet":"B","eastings":"856","northings":"464"},"fullIrishGrid":{"sheet":"","eastings":"185600","northings":"446400"},"tmcGrid":{"sheet":"","eastings":"585555.536","northings":"946381.623"},"geo":{"lat":"55.26434966","long":-8.22725283}},"cursor":146077,"description":"<p><strong>Tory Island</strong> B856-464          Sheet 1 12<em>km</em> NNE of Bloody Foreland, Tory is named for the dramatic appearance of the high tors at its E end as seen from the mainland; this is the most remote inhabited Irish island and holds a special place in history. SPA Tory is the only inhabited island the entire of which is so designated.  Storm Petrel, Tern, Chough, Corncrake, of which 10 males were calling in 2010. Facilities The main pier on the island is at Camusmore Bay serving West Town at B855-465. In the village there is water available, two shops, a new hotel, hostel, cafe, pub and post-office. Camping Camping is possible at West Town, but a bit public. A more remote landing can be had onto a storm beach at Port an Dúin on the E end of the island at B877-454. This is the dramatic square-shaped indent in the skyline, just E of the last house on the island. Camping may be dramatically had on the flat ground just above the cliffs. The disadvantage of camping here is that all visitors walking to the Anvil and Tormore pass directly by. For larger groups, or those requiring privacy or greater security, perhaps in high season, a well sheltered landing may also be had hereabouts at a small storm beach (HW) / sand beach (LW) just 500m W of Port an Dúin. There is good camping at the shore directly SW of the last dwelling on this side of the island at B874-453. In either case, there is good water at a spring beside this house, where asking would be respectful. Tides Tory is a challenging trip, at almost 13<em>km</em> out from Magheraroarty Pier at B889-333. However, the Inishbofin Group shelters half of this, and the trip out can be broken. Local HW is Galway +0040. In the middle of Tory Sound, the ENE flood runs from HW Galway   0350 to +0235. Close in to Tory and to the islands of the Inishbofin Group, (as well as in and around and through the Inishbofin Group), the tidal streams turn one hour earlier. The E making flood runs from HW Galway   0450 to +0135. Slack occurs about one hour after local HW/LW. As the exposed part of the passage between Tory and Inishbeg takes an hour or so, and as another hour is needed for the passage between Inishbeg and Magheraroarty, it is impossible to organise slack water all the way across. Local advice is to emphasise the later ‘middle of Tory Sound’ tide for planning purposes, accepting some wind over tide as necessary in the first or last part of the trip, to taste. Circumnavigation The N and E sides of the island are sheer for their entire length and offer no rest other than as mentioned below. A landing may be had at three places on the north side.</p>\n<ul>\n<li>Immediately behind Port an Dúin at B876-456 onto a sheltered storm beach.</li>\n<li>A very sheltered landing onto a sandy beach 300m N of West Town at B855-468, at the head of a deep cut, but regrettably, under grassy cliffs.</li>\n<li>Onto a slipway near the W end of the N side at B849-471, just south of a prominent house.</li>\n</ul>\n<p>The scenery on the N/NE sides is magnificent. The whole E end from Port an Dúin outwards is a prehistoric promontory fort known as Dún Balair, once the stronghold of Balor of the Evil Eye, the baddest of Fomorian bad guys. He ended up being killed by his own grandson, Lewey, who penetrated his one good eye with a huge wooden stake. Lewey hailed from Dunlewy at the foot of Errigal mountain on the mainland to the south. Lewey was mean and was nicknamed ‘Lewey Lamh Fhada’ meaning ‘long arms’, a reference to his habit, when he came to visit, of having one arm as long as the other i.e., empty handed. The remains of Balor’s four outer defensive ramparts may still be seen. His citadel is the mighty Tormore, an unapproachable pinnacle at the end of an alpine rocky ridge, called The Anvil, sticking N out to sea. Note the cairn on its summit put there by local kids for a dare. The Anvil may be bypassed on circumnavigation by going though a majestic arch at B878-460. The cliffs change from quartzite in the E to granite in the W. The cliffs at the E end of the N side are unsurpassed anywhere for unyielding verticality. Arches and offshore reefs abound for the more daring paddlers. Clapotis may be always expected on the W side, by the lighthouse and S of it. A shallow reef sticks far out to sea at the SW corner, which must be given a very wide berth. The S side is less dramatic, being flat, but the ground inshore at the W end is shallow for some way out and boomers may catch the unwary. Best to keep well off. Climbing The development of climbing on Tory, all on its N face, is in its infancy.  Some routes were made in 2004 by the ubiquitous Alan Tees NNW of West Town.  P. Stevens and others climbed 4 prominient 50m sea stacks that sit either side of the huge natural tower at B869-462 N of East Town. This tower is attached the main island of Tory by a knife edge ridge and can be clearly seen from mainland Donegal as the high pillar bisecting the island. To the NW of the tower sits a trio of conical spires and to the SE sits an excellent twin summited “V” stack. Art Derek Hill first came to Tory in 1957 or so, and rented as his studio the former Lloyds signalling station above the slip at B849-471.  Locals came and watched.  Some learned as they watched and in particular James Dixon felt he could do better and said so.  Hill encouraged him and in time there was a flourishing school of local artists with a distinctive naturalistic style, capturing what they knew best – cliffs, boats, wild sea and sky, the island villages and people.  The Tory art tradition still flourishes. Local History Tory’s most famous shipwreck is that of HMS Wasp in 1884 when the ship struck in daylight just near the lighthouse. 51 men died and only six survived. The incident is hard to explain, as the visibility was good so the lighthouse must have been visible for hours and the ship struck just after dawn. It has been attributed to a curse having been put on the ship with the aid of local cursing stones. There were also personality problems in the ranks of the officers and men of the ship, whose attitude to their work of carrying out forcible evictions up and down the west coast varied greatly. At the time of the wreck, Wasp was carrying policemen to evict the inhabitants of Inishtrahull. Much has been written about the myth, legend and history in which the island is steeped, especially ‘Stories from Tory Island’ by Dorothy Harrison Therman, Wallace Clark’s ‘Sailing Round Ireland’, and more recently “The Waves of Tory” by Jim Hunter. There are remains of a Columban church and of a round tower in West Town. Beside the tower is a very unusual tall cross, ‘T’ shaped, called a ‘Tau’, almost unique in Ireland. The cross is 3,000 years old and was adopted into Christianity. Colmcille himself founded the monastery here in the 560s. There are three types of curragh associated with Tory, the smallest of which was the smallest in Ireland, at eight feet, handled by one oarsman, kneeling at the bow. Nowadays there is only one type, the two-man curragh found all over North Donegal. Of note locally also is the more modern type of double-ended (i.e. transomless) clinker boats somewhat peculiar to Tory, usually white, said to be livelier handlers than transomed boats and with a mast that is purely for the radio. They are the subject of a book by Dónal MacPolin, entitled ‘The Drontheim, Forgotten Sailing Boat of the North Irish Coast’. There are no trees or rats on Tory.  The wind prevents the former and the soil the latter.  A handful of Tory clay brought home and stored in your house will keep it forever rat free, but only if the clay is properly acquired.  It must be asked for in the traditional manner “in the name of God and Colmcille” from the eldest member of the Duggan family living on Tory. Rare birds turn up frequently on Tory and those breeding include Corncrake, Storm Petrel and Little Tern. Legal affairs are carried out most informally on the island, with land being transferred without anything at all being put down in writing by the parties to the deal. Instead, land ownership and inheritance is settled by the island king.  They let the resident priest know his decision and he keeps a track of who owns what. Tory was once renowned for its Poitín making and it was the turf burned in its illicit stills that accounts for the barren look Tory now presents. Its huge tracts of bog, once rich, are now barren desert, home mostly to rabbits. There is now a modern hotel in West Town and some modern housing beginning to appear, but most streets and roadways on the islands present a somewhat 19th century appearance. A salvaged World War 2 torpedo marks the high point of the road between the two villages, East Town and West Town. The island has its own king, Patsy Dan Rogers.  The king is voted in for life.  Nowadays his duties have a lot to do with promoting and managing tourism. The permanent population is approximately 120, swelling to 190 in summer.</p>\n","costalZone":"**The North-West**"}